[
  {
    "title": "Asignación de registros",
    "url": "https://omegaup.com/arena/problem/Asignacion-de-registros",
    "history": "Cierto procesador cuenta con veintiseis variables identificadas con letras de ` A` a ` Z` , con cinco registros identificados como ` r0` hasta ` r4` y con el siguiente conjunto de instrucciones: - ` IMPRIME ` V: Imprime el valor de la variable V. Tarda tres ciclos de reloj. - ` IMPRIME r` _ i: Imprime el valor del registro ` r` _ i. Tarda un ciclo de reloj. - ` CARGA r` _ i ` ` V: Carga el valor de la variable V al registro ` r` _ i. Tarda tres ciclos de reloj. Cuentas con una lista de instrucciones que contiene únicamente instrucciones del primer tipo. Escribe un programa que produzca una lista de instrucciones cuya ejecución sea más rápida que la ejecución de la lista original. Sabes de antemano que, en una instrucción ` IMPRIME ` V, es exponencialmente más probable que V se refiera a una variable recientemente impresa que a una variable que hace mucho no se imprime.",
    "input": "Una secuencia de líneas que deberán procesarse hasta el fin de la entrada y que denota la lista original de instrucciones. Puedes suponer que habrán entre 500 y 1000 líneas.",
    "output": "Una secuencia de líneas que denote una lista de instrucciones optimizada. Tu programa será aceptado si la lista generada es semánticamente equivalente y es al menos el doble de rápido que la lista original. Se garantiza que un algoritmo glotón clásico resuelve el problema.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 16677
  },
  {
    "title": "Mejor baraja",
    "url": "https://omegaup.com/arena/problem/Mejor-baraja",
    "history": "Tienes n cartas * * ordenadas* * a_ i, cada una tiene un dígito ( un entero entre 1 y 9) . Tu familia tiene una creencia de que siempre se debe sacrificar algo material para obtener la felicidad. De manera muy curiosa, un día te encuentras con un presentador de shows que te dice lo siguiente: - Te daré un entero k, si eliminas k cartas de tu baraja y unes las cartas restantes * * en su orden original* * , te llevarás esa misma cantidad de soles. Como crees que este es un sacrificio necesario, tu meta es eliminar k cartas de manera que la cantidad de soles que te lleves sea la máxima posible.",
    "input": "La primera línea de entrada contiene dos enteros n y k, la cantidad de cartas y la cantidad de eliminaciones que debes realizar. La segunda línea de entrada contiene n enteros a_ i separados por un espacio, el i- ésimo de los enteros es la i- ésima carta.",
    "output": "Imprime una sola línea, la respuesta al problema.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 16380
  },
  {
    "title": "Empanadas de Adrián",
    "url": "https://omegaup.com/arena/problem/Empanadas-de-Adrian",
    "history": "Adrián es un amante de las empanadas. Un día entra en una tienda de empanadas donde se venden N empanadas y está dispuesto a comprar máximo M de ellas. Cada empanada, aporta a_ i puntos de felicidad si Adrián llega a comer esta empanada y tiene un sabor b_ i. Además si es la primera vez que Adrián prueba ese sabor de empanada en su vida, obtendrá K puntos de felicidad adicionales. Habrán empanadas que también son del desagrado de Adrián, siendo que le restarían puntos de felicidad si las come, de tan feo sabor que tienen. Dados los puntos de felicidad de cada empanada y su sabor, determina la mayor cantidad de puntos de felicidad que Adrián podrá obtener, siendo que inicialmente nunca ha probado ninguna de las empanadas de la tienda en su vida.",
    "input": "En la primera línea, primero un entero N representando el número de empanadas disponibles, después un entero M representando el máximo número de empanadas que Adrián está dispuesto a comprar, y un entero K, representando los puntos de felicidad adicionales, si Adrián come por primera vez un sabor de empanada que jamás había probado. En la segunda línea con N enteros, los cuáles describen al arreglo A y muestran la cantidad de puntos de felicidad que la empanada i aporta ( 1 < = i < = N) . En la tercera línea con N enteros, los cuáles describen al arreglo B y muestran los sabores de cada empanada i( 1 < = i < = N) .",
    "output": "Imprime la mayor cantidad de puntos de felicidad que Adrián puede obtener comiendo a lo más M empanadas, posiblemente 0.",
    "note": "",
    "topics": [
      "two pointers",
      "greedy",
      "sortings"
    ],
    "id": 15740
  },
  {
    "title": "Subiendo niveles",
    "url": "https://omegaup.com/arena/problem/Subiendo-niveles",
    "history": "Se hizo una rifa para ver quién tendría la suerte de participar en un nuevo juego altamente interactivo, y tú te llevaste el boleto ganador! # ProblemaEl juego consiste de N salas, que puedes visitar cuando quieras y como quieras. Inicialmente comienzas con un nivel de poder k, y todas las salas i tienen un nivel de poder x_ i. Si entras a una sala i cuyo poder es menor o igual al tuyo, entonces ganas esa sala, y tu nivel k aumenta la cantidad de poder x_ i del nivel. Por ejemplo, si tu nivel es 50, y entras a una sala de nivel 35, entonces al salir, tu nivel será 85. Si entras a una sala y tu poder es más bajo que el de la sala, pierdes el juego, y tu puntuación final será el nivel final de poder que conseguiste. Sabiendo que puedes acceder a las salas en cualquier orden, calcula el máximo nivel que puedes alcanzar sin perder.",
    "input": "Una línea con dos enteros N, k, siendo la cantidad de salas, y tu nivel inicial de poder. En la segunda línea, N enteros x_ i, describiendo el nivel de poder de cada sala.",
    "output": "Un solo entero que contenga el nivel máximo que se puede alcanzar en el juego.",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 15676
  },
  {
    "title": "Juntando amigos",
    "url": "https://omegaup.com/arena/problem/Juntando-amigos",
    "history": "Todos conocemos la Feria de Santa Rita, todos van a divertirse en grande, y al ser un evento tan importante para la ciudad, debemos asegurarnos de que todo esté muy bien organizado, para ello requerimos tu ayuda. # ProblemaGracias a los censos de población, sabemos que van a atender N personas a la feria, numeradas desde 1 hasta N y no solo eso, sino que todas estas personas van solas y no conocen a nadie más en la Feria. Tu trabajo consistirá en mantener registros de un total de Q actividades. Lo más importante en la feria son los juegos, y siendo una feria, las personas van a invitar a otros a subirse a un juego juntos, tras lo cual se vuelven amigos, concretamente, si la persona a invita a la persona b a subirse a un juego, siempre terminarán siendo amigos. Pero no siempre tienes que subirte a un juego con alguien para ser su amigo, basta con que alguno de tus amigos lo conozca. Así que cualquier persona que sea amigo de alguno de tus amigos, también es tu amigo, aunque nunca te hayas subido a un juego con esa persona ( si a y b son amigos, y b y c también son amigos, entonces siempre se cumplirá que a y c son amigos) . Los juegos no lo son todo en la feria, también es muy importante la buena comida! Las personas se invitarán a comer unas a otras, pero solo aceptarán si ya son amigos, así que cuando una persona a invite a comer a la persona b, tienes que responder si aceptará o no aceptará.",
    "input": "* En la primera línea dos enteros N y Q, la cantidad de personas en la feria, y la cantidad de actividades que se van a hacer. * En las siguientes Q líneas, primero un caracter x, seguido de dos enteros a y b* Cuando x es * * J* * , quiere decir que la persona a y la persona b se subieron a un juego juntos. * Cuando x es * * C* * , quiere decir que la persona a invitó a comer a la persona b",
    "output": "Para cada vez que alguien invita a otra persona a comer, debes imprimir una línea diciendo * * Amigos : ) * * si comieron juntos, o * * Desconocidos : ( * * si no comieron juntos.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 15675
  },
  {
    "title": "Iluminando la Mina",
    "url": "https://omegaup.com/arena/problem/Iluminando-la-Mina",
    "history": "Al momento de hablar de videojuegos no puedes omitir hablar del juego más jugado de los últimos años ̈Minecraft ̈. Por lo menos es lo que Santy dice. La parte favorita de Santy del juego consiste en minar. Esta es una actividad muy satisfactoria y desestresante. En el juego puedes buscar minas naturales que son generadas por el juego o artificiales que son minas que tu creas. La forma más eficiente de crear una mina artificial es haciendo una línea recta. Lamentablemente al ser artificial no existe iluminación dentro de la mina. Sin embargo, existen artefactos llamados * * antorchas* * . Las antorchas son elementos que colocas en una posición x ( un bloque) e ilumina todas las posiciones [ x - k, x + k] donde k es el radio de iluminación de las antorchas. Por ejemplo, si el radio de iluminación es de 2 y colocas la antorcha en el bloque 10 entonces los bloques desde el 8 hasta el 12 van a quedar iluminados. Obviamente Santy quiere que toda su mina se encuentre iluminada. Pero otro dato a considerar es que muchas veces al crear las minas artificiales te encuentras con * * lugares interesantes* * . Además de querer iluminar toda su mina, Santy quiere que exista una antorcha en estos lugares interesantes para tener cierta * marca* de estos. # ProblemaSe tiene una mina unidimensional de N bloquees, numerados del 0 al N- 1. Dentro de la mina existen M lugares interesantes en los bloquees a_ 1, . . . , a_ M que requieren tener una antorcha. Teniendo en cuenta que el radio de iluminación de las antorchas es de k, ayuda a Santy a saber la mínima cantidad de antorchas que santy necesita para iluminar toda su mina.",
    "input": "Tres enteros N, M, k que representan la cantidad de bloquees en la mina, el número de lugares interesantes y el radio de iluminación de las antorchas respectivamente. En la siguiente línea se te darán M enteros ordenados de menor a mayor que representan las posiciones de los lugares interesantes.",
    "output": "La cantidad mínima de antorchas necesarias para iluminar la mina",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 15263
  },
  {
    "title": "Maximizando Puntos",
    "url": "https://omegaup.com/arena/problem/Maximizando-Puntos",
    "history": "Este año la competencia a nivel nacional se celebró de una forma diferente a como estamos acostumbrados. Cada estado podía llevar la cantidad de participantes que quisiera. Yucatán decidió llevar N alumnos. Antes de empezar el examen se le pide a cada estado entregar una lista con los estudiantes numerados del 1 al N ( donde N es la cantidad de participantes) . Después del examen cada estudiante obtiene una calificación a_ i. Uno pensaría que naturalmente la calificación del estado consiste en el promedio de las calificaciones de sus alumnos. Pero no es así, olvidamos que los que organizan esta olimpiada les gustan las matemáticas tanto como a nosotros. Entonces decidieron hacer lo siguiente: - Cada estado va a elegir una subsecuencia contigua de al menos dos de sus estudiantes ( previamente numerados) . Es decir, van a elegir a los estudiantes desde una posición l hasta una posición r con 1 ≤ l < r ≤ N. - Una vez elegida la secuencia de estudiantes, el puntaje del estado queda determinado por max( a_ l, . . . , a_ r) ×min ( a_ l, . . . , a_ r) . Es decir, se toman al que obtuvo calificación más alta y más baja de esa subsecuencia y los multiplican. Obviamente el estado de Yucatán quiere obtener la mayor cantidad de puntos posibles. Ayúdalos a conocer este dato. # ProblemaSe te dará la secuencia con las calificaciones que obtuvo cada estudiante a_ i y debes determinar cuál es la mayor cantidad de puntos que se pueden obtener calculando la calificación como se mencionó la descripción.",
    "input": "Un numero N indicando la cantidad de estudiantes, seguido se te darán N números en donde la posición i indica la calificación del estudiante a_ i.",
    "output": "Un único entero denotando la calificación máxima que se puede obtener. # Ejemplos| | input31 3 2| | output6| | descriptionLas posibles secuencias que podemos elegir son: [ 1, 3, 2] , [ 1, 3] , [ 3, 2] . De todas estas aquella con mayor calificación es [ 3, 2] con una calificación de 6 puntos. | | input51 1 1 1 1| | output1| | input269 69| | output4761| | end# Limites* * Para 25",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 15089
  },
  {
    "title": "Secuencias geniales",
    "url": "https://omegaup.com/arena/problem/Secuencias-geniales",
    "history": "Decimos que una secuencia es genial para un dado entero positivo x, si podemos partirla en pares de números tal que el primer número del par multiplicado por x es igual al segundo. En una secuencia genial no importa el orden de los pares, es decir, todas las permutaciones de una secuencia genial siguen siendo geniales para un dado x. Le contaste sobre estas secuencias a tu amigo, y ahora necesita tu ayuda para construir varias secuencias geniales. Cada secuencia tiene N_ i números, y su propio número x, él quiere convertir estas secuencias en geniales, para hacer eso puede comprar nuevos enteros positivos y agregarlos a la secuencia, pero es bien sabido que los enteros positivos son muy caros, así que quiere saber la menor cantidad de números que necesita comprar para transformar cada secuencia en genial ( puede que necesite comprar 0 números) .",
    "input": "En la primera línea un entero t, la cantidad de secuencias que tiene tu amigo. En la primera línea de cada secuencia, dos enteros N y x, el tamaño de la secuencia de tu amigo y el número x que escogió. En la segunda línea de cada secuencia, N enteros a_ i, los numeros que tu amigo ya tiene.",
    "output": "Imprime la mínima cantidad de números que debe comprar para transformar todas sus secuencias en geniales.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14880
  },
  {
    "title": "Hidden Number",
    "url": "https://omegaup.com/arena/problem/Hidden-Number",
    "history": "# DescriptionAs you know, Santiago is an expert summing numbers, this time he issumming numbers from a list L of N positive integer numbers, not necessarily different. He likes to performsums so much that he selects an integer X and looks for a subsequenceof S from L such that the sum of the elements of S equalsX. For example, if the list is ( 10, 3, 1, 2, 2, 4) , and X= 14, then, Santiagocan take the subsequences ( 10, 3, 1) , ( 10, 4) , or ( 10, 2, 2) since 10 + 3 + 1 = 10 + 4 = 10 + 2 + 2 = 14. Santiago has noticed there may be some values for X for which he can choose multiple differentsubsequences S, however, you have pointed out that there also exist some values for X for whichno possible subsequence S exists. Santiago does not believe you, thats why he wants you to findthe smallest possible value for X for which no subsequence S exists in his list.",
    "input": "The first line of the input contains an integer N ( 1 ≤ N ≤ 10^ 6) , representing the number of elements in the list. The second and last line in the inputcontains N numbers separated by a space between, the numbers in the list, each numberwill have a value between 1 and 10^ 6.",
    "output": "Print a line with containing an integer indicating the smallest positive integer value for X such that Santiago can not find a subsequence S. # Example| | input21 1| | output3| | input53 2 5 4 10| | output1| | end",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14811
  },
  {
    "title": "Conversor de decimal a otras bases",
    "url": "https://omegaup.com/arena/problem/Conversor-de-decimal-a-otras-bas",
    "history": "Dada una base b ( 2 ≤ b ≤ 36) y un número entero positivo n en base decimal de 32 bits, expresa el entero n en la base b.",
    "input": "Un entero T ( 0 ≤ T≤100) , que representa el número de casos de prueba. Por cada caso de prueba, dos valores b y n.",
    "output": "El valor de n en la base b por cada caso de prueba, expresado con dígitos de 0- 9 y caracteres A- Z ( mayúsculas) .",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14712
  },
  {
    "title": "Peones",
    "url": "https://omegaup.com/arena/problem/ofmi-2022-peones",
    "history": "Durante su primer año de secundaria Maeva Jane Watson se inscribió al club de ajedrez de su escuela. El ajedrez era un juego que desde su infancia le llamaba la atención, pero que nunca había intentado. Desde las primeras semanas en el club, Maeva desarrolló una habilidad estratégica y analítica extraordinaria que la llevaron a destacar sobre los demás estudiantes del club y a los pocos meses ganar el campeonato anual estatal de ajedrez, el cual defendió por los siguientes dos años consecutivos. Lorena Stacy, su maestra de ajedrez, decidió ponerle un nuevo reto, el cual consiste en lo siguiente: Tienes un tablero de ajedrez de N filas y M columnas. En el tablero hay M peones de color negro, exactamente uno en cada columna; cada peón negro puede estar en cualquier posición a lo largo de su columna. En el tablero también hay solo un peón de color blanco que se encuentra en la esquina inferior izquierda. Dadas las posiciones iniciales de los peones negros y la posición final deseada del peón blanco, ayuda a MJ Watson a saber si es posible que el peón blanco pueda llegar desde la esquina inferior izquierda a su posición final deseada. Los peones se pueden mover de dos formas ( como en una partida de ajedrez) : - Si la casilla de enfrente está libre ( no hay ningún peón) , se puede mover el peón únicamente una posición hacia delante. - Una posición en diagonal ( hacia delante, ya sea izquierda o derecha) cuando pueden capturar a un peón enemigo. Cuando esto sucede, el peón enemigo se descarta del tablero. El frente de los peones negros es la parte inferior del tablero y el frente del peón blanco es la parte superior del tablero. Puedes mover los peones ( negros o blanco) en el orden que quieras ( no se respeta un movimiento por turnos) . Mover un peón ya sea hacia delante o en diagonal, cuenta como 1 movimiento. # ProblemaTu tarea es determinar el mínimo número de movimientos de peones que se necesitan para que el peón blanco llegue de su posición inicial a su posición final. En caso de que no exista un camino posible para el peón blanco, imprime - 1.",
    "input": "- En la primera línea dos enteros separados por un espacio, N y M que representan la cantidad de filas y columnas del tablero respectivamente. - En las siguientes líneas una matriz de N* M enteros separados por un espacio que representan la configuración inicial del tablero. ( 0 representa espacio libre y 1 representa la posición de un peón negro. ) - Finalmente, dos enteros separados por un espacio, X y Y que representan la fila y columna respectivamente de la posición final deseada para el peón blanco. * * NOTA: * * La coordenada ( 1, 1) es la posición de la esquina superior izquierda del tablero.",
    "output": "Un entero con el número mínimo de movimientos de peón que necesitas para llevar al peón blanco de su posición inicial a su posición final o - 1 en caso de que no se pueda.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14530
  },
  {
    "title": "Creando Personaje",
    "url": "https://omegaup.com/arena/problem/Creando-Personaje",
    "history": "Almendro acaba de comprarse un nuevo videojuego donde puede crear un personaje y completar misiones. El personaje tiene 10 atributos a los cuales puede asignarle puntos. En el inicio del juego, él tiene m puntos los cuales puede repartir libremente entre todos los atributos de su personaje. Todas las misiones son secuenciales, y deben ser terminadas en un orden en específico, ninguna puede ser saltada o completada sin primero haber terminado todas las misiones previas. Cada misión tiene ciertos requisitos para ser completada, el personaje debe tener un mínimo de puntaje de atributos para completarla. La compañía que desarrolló el videojuego vende puntos por separadolos cuales pueden ser asignados a los atributos del personaje. El juego es muy difícil y Almendro sospecha que es imposible terminarlo sin comprar puntos extra. Por desgracia Almendro ya jugó durante 0. 0023 segundos y ya no es elegible para un reembolso. Ha decidido ver qué tan lejos puede avanzar en el videojuego. Quiere saber como debe distribuir los puntos en los atributos de su personaje para así llegar lo más lejos posible. Por fortuna él sabe de antemano los requisitos para cada misión, por lo que le es posible formular una estrategia.",
    "input": "En la primer línea un número 2≤ m ≤ 100 los puntos que Almendro puede distribuir entre los 10 atributos de su personaje. En la segunda línea un número 1≤ n ≤ 1e5 la cantidad de misiones en el videojuego. Cada una de las siguientes n líneas describe una misión del videojuego, en el orden que deben ser completadas. La descripción consiste de 10 enteros 0≤ a_ i ≤ m separados por espacios, el i- ésimo entero representa el puntaje mínimo que el personaje debe tener en el i- ésimo atributo para pasar la misión. El personaje debe cumplir todos los requisitos para poder cumplir con la misión y seguir adelante.",
    "output": "Imprime dos líneas. En la primer línea la cantidad de misiones que es posible completar asumiendo que el personaje será creado óptimamente. En la segunda línea imprimir 10 enteros, la descripción del personaje, el i- ésimo entero es el valor que tiene el i- ésimo atributo. Recuerda que la suma de estos valores no puede exceder m. Si existen múltiples formas de crear este personaje, puedes imprimir cualquiera.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14500
  },
  {
    "title": "Bob Rossado",
    "url": "https://omegaup.com/arena/problem/Bob-Rossado",
    "history": "Bob Rossado tiene un muro el cual le encargaron para que pintase. Un pintor anterior dejó el trabajo a medias y ahora él debe repararlo. El muro es un cuadrado ( la base y altura son iguales) y está dividido en secciones de 1x1. Algunas de estas secciones están pintadas y otras no. Bob quiere terminar de pintar el muro con un solo brochazo. Él escogerá un segmento cuadrado del muro y lo pintará con un solo movimiento. El segmento que elija debe tener la misma altura y base ( porque es un cuadrado) . Como esto implica que muy probablemente termine pintando secciones que ya estaban pintadas, terminará gastando pintura, así que le interesa escoger el cuadrado más pequeño posible. Ayúdale a saber el área de este cuadrado y la cantidad de celdas que ya estaban pintadas pero volvió a pintar. Está garantizado que habrá por lo menos una celda sin pintar.",
    "input": "En la primer línea un número 2≤ n ≤ 1e3 el tamaño de uno de los lados del muro. En cada una de las siguientes n líneas habrá una cadena de exactamente n caracteres. Estos caracteres pueden ser ' . ' o ' # ' significando una celda vacía y una pintada respectivamente.",
    "output": "Imprime dos enteros en una sola línea separados por un solo espacio, el área mínima del cuadrado a escoger para pintar, y la cantidad de celdas ya pintadas que Bob repintará respectivamente.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14494
  },
  {
    "title": "Listón",
    "url": "https://omegaup.com/arena/problem/Liston",
    "history": "Nepomuceno tiene un listón largo de tres colores, rojo ( R) , verde ( G) y azul ( B) . Puedes visualizar el listón como una secuencia de colores ( ej. RRBGR) . A Nepomuceno no le gusta la variedad y quiere hacer adornos de un solo color con el listón. Como quiere hacer el adorno mas grande posible, necesitará el trazo de listón mas largo compuesto del mismo color. Ayúdale a saber de qué color y qué tan largo será este trozo.",
    "input": "En la primer línea un entero impar 3≤ n ≤ 1e5. El tamaño del listón. En la segunda línea una cadena de n caracteres donde el i- ésimo caracter será ' R' , ' G' o ' B' .",
    "output": "En una sola línea, separados por un espacio, imprime un caracter y un entero. El color del trazo de listón más largo y su tamaño. Si existen múltiples respuestas, dale prioridad al trazo de listón que se encuentre más \" A la izquierda\"",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14340
  },
  {
    "title": "Chismes",
    "url": "https://omegaup.com/arena/problem/Chismes",
    "history": "Parte de nuestra naturaleza humana es darle duro al chisme. ¿A quien? A quien nos quede al alcance de la mano. . . o, más bien, ¡de la boca! Considera una matriz de personas; definimos a dos personas \" al alcance\" una de la otra si están adyacentes ( al norte, al sur, al este o al oeste) la una de la otra. ! [ Ejemplos] ( samples. jpg) En la imagen, la persona p no podrá pasarle el chisme a ninguna de las personas 1, 2, 3 o 4. En cambio, la persona q puede pasarle el chisme a las personas 5, 6, 7 y 8. Desde luego, cada persona que recibe el \" chisme fresco\" pasa, a su vez, a difundirlo a todas las personas a su alcance. Deberás hacer un programa que, para cada matriz de personas de su entrada ( primero el número de renglones, luego el número de columas y finalmente los valores 0 para \" vacío\" y 1 para \" persona\" ) imprima en su salida el número mínimo de personas a las que se les debería \" sembrar\" el chisme para que todas las demás acaben enterándose.",
    "input": "Matrices binarias con la dimensión por delante; puedes contar con que las dimensiones son enteros estrictamente positivos no mayores que 100; cada 1 en la matriz indica la presencia de una persona.",
    "output": "Por cada matriz, un entero no negativo: el menor número de personas a quienes hay que dar el chisme para que se encarguen de difundirlo a sus adyacentes; que éstos divulguen el chisme a sus adyacentes; y así sucesivamente hasta que el chisme termine siendo del dominio público. | | input4 31 0 10 1 11 1 01 0 1| | output3| | descriptionCon sembrar el chisme en la persona de arriba a la izquierda, la de abajo a la derecha y alguna otra ( no importa quién) es suficiente. | | input3 31 1 01 0 10 1 12 51 0 1 1 11 1 1 0 1| | output21| | descriptionDos matrices. | | end",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14316
  },
  {
    "title": "Viaje al espacio",
    "url": "https://omegaup.com/arena/problem/Viaje-al-espacio",
    "history": "Desde pequeño, Pedro siempre quiso volar, llegar más allá del cielo, alcanzar las estrellas; esto se debe a que su papá era un gran piloto de avión y por tanto él quería superarlo, logrando llegar al espacio. Debido a las limitaciones físicas que tenía por ser humano, decidió ponerse manos a la obra para fabricar un coche que fuera capaz de volar y así cumplir su mayor ilusión. Después de mucho tiempo estudiando la ingeniería necesaria para hacerlo posible, y después de muchos intentos fallidos, Pedro casi ha logrado terminar de construir, el vehículo: solo le falta el motor, el volante y las cuatro llantas ( tampoco le ha instalado los frenos, pero él cree que no los necesitará) . Muchas tiendas alrededor tienen las piezas que necesita, pero como no quiere perder tiempo ni caminar mucho, decide que solo va a ir a una tienda, la que le salga más barata en total. ¿Puedes ayudarle a decidir a qué tienda debería ir para que le salga lo más económico posible?",
    "input": "Un entero t que representa la cantidad de tiendas. Luego, t líneas con 3 enteros cada una separados por un espacio que representan los precios del motor, del volante y de cada llanta en la i- ésima tienda. Las tiendas se enumeran del 1 al t según el orden de aparición en la entrada del problema.",
    "output": "Un entero que representa a la tienda que ofrece el precio más barato en total. Si hay un empate en el precio total más bajo, se debe elegir la tienda con el número más bajo.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 14130
  },
  {
    "title": "ONI 2021",
    "url": "https://omegaup.com/arena/problem/OIEC_2021",
    "history": "Ha comenzado la ONI 2021 y con la emoción se había vuelto tendencia publicar en las redes la palabra \" OOOIIEEECC! ! ! \" con cada vez más letras. Mientras se acercaba la fecha, eran cada vez más las personas que publicaban y comentaban, de tal forma que se saturaron todos los servidores de Facebook e Instagram. Para que esto no suceda nuevamente, los propietarios de la redes tomaron cartas en el asunto y decidieron plantear las siguientes reglas: - Solo se pueden publicar comentarios que contengan cinco enteros. - Los enteros deben estar en líneas distintas. En seguida, los participantes y seguidores de la OIEC aprovecharon esta medida para seguir expresando su emoción y ahora escriben mensajes con cinco enteros: k< sub> o< / sub> , k< sub> i< / sub> , k< sub> e< / sub> , k< sub> c< / sub> , k< sub> ! < / sub> , indicando el número de caracteres \" O\" , \" I\" , \" E\" , \" C\" y \" ! \" respectivamente. Dado un conjunto de comentarios de los seguidores de la OIEC, tu tarea consiste en decodificarlos todos. # # Ejemplo: | | input12345| | outputOIIEEECCCC! ! ! ! ! | | descriptionSe imprime cada letra de la palabra \" OIEC! \" con el número de repeticiones especificado. | | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 13814
  },
  {
    "title": "En busca de la mayor diversión",
    "url": "https://omegaup.com/arena/problem/edm2021n1-diversion",
    "history": "Nicolás es un niño muy caprichoso y sabe que su mamá hará lo posible por mantenerlo feliz. Nicolás suele aprovecharse de este hecho ( por favor, no seas como Nicolás) . Cada vez que Nicolás y su mamá van a hacer las compras, el niño exige que se le compren N juguetes. Normalmente termina ocurriendo, pero esta vez, la madre se puso firme y le dijo a Nicolás que no le comprará N juguetes, sino solamente N - 1. Es decir, si siempre le compraba 5 juguetes, esta vez le compraría solo 4. Nicolás está en una situación difícil y necesita conseguir la mayor diversión posible. Cada juguete tiene un nivel de diversión y la diversión final es la suma de los niveles de diversión de los juguetes adquiridos. Tu trabajo es conseguir la mayor diversión posible.",
    "input": "* Una línea con la cantidad N de juguetes que eligió inicialmente Nicolás. * N líneas, cada una con el nivel de diversión de un juguete.",
    "output": "Una línea con la mayor diversión posible habiendo dejado exactamente un juguete sin comprar ( puede ser cualquiera, siempre y cuando la diversión obtenida sea la mayor posible) .",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 13769
  },
  {
    "title": "Espada mágica",
    "url": "https://omegaup.com/arena/problem/Espada-magica",
    "history": "Estás jugando un videojuego en el mundo mágico de Magialandia. Quieres comparte una espada muy poderosa, pero es muy cara. Por fortuna en este mundo hay muchas misiones donde te recompensan con dinero. Como te urge tener esa espada, quieres hacer la mínima cantidad de misiones y así comprarla lo más pronto posible. Determina cuantas misiones como mínimo tendrás que completar para juntar suficiente dinero para tu espada mágica.",
    "input": "En la primer línea un entero 2≤ n ≤ 1e6, la cantidad de misiones disponibles. En la segunda línea hay n números 1 ≤ a_ i ≤ 1e6 la cantidad de oro que da la i- ésima misión. En la tercer línea un entero 1 ≤ q ≤ 1e5 la cantidad de casos de prueba. En las siguientes q líneas hay un entero 1≤ m ≤ 1e12 el precio de la espada en cada caso de prueba.",
    "output": "q enteros cada uno en una línea distinta. Cada entero es la mínima cantidad de misiones que deben ser completadas para obtener suficiente oro para comprar la espada en el caso de prueba correspondiente. En caso de que sea imposible juntar suficiente oro aun completando todas las misiones, imprimir \" - 1\" sin comillas.",
    "note": "",
    "topics": [
      "greedy",
      "binary search"
    ],
    "id": 13542
  },
  {
    "title": "Día lluvioso",
    "url": "https://omegaup.com/arena/problem/Dia-lluvioso",
    "history": "El Sr. Bigotes estaba de regreso a casa cuando de repente, comenzó a llover, atrapado en la lluvia solicita tu ayuda. El se encuentra en una banqueta b en la posición b_ 0, delante de él se encuentran algunos charcos de agua, representados con un 1 y zonas secas, representadas con un 0. Como el Sr. Bigotes es un gato y no le gusta mojarse las patitas evitará a toda costa los charcos de agua, él decide moverse a saltos, pudiendo saltar a lo más l casillas. Ayúdalo a llegar a su casa que se encuentra en la posición b_ n+ 1 dando el menor número de saltos posibles.",
    "input": "Un entero n que es el largo de la acera, seguido de n números, los cuales pueden ser 0 o 1.",
    "output": "Si el Sr. Bigotes puede llegar sin mojarse a su casa, imprimir < kbd> Victoria aplastante! < / kbd> , y después en otra línea < kbd> Saltos: < / kbd> seguido del número de saltos totales que dio, en caso de no haber llegado a casa sin mojarse, deberás imprimir < kbd> Sr. Bigotes nooo! < / kbd> .",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 13262
  },
  {
    "title": "Yu-Gi-Oh!",
    "url": "https://omegaup.com/arena/problem/Yu-Gi-Oh",
    "history": "Jorge se encontraba jugando Yu- Gi- Oh! con sus n cartas cuando de pronto adquirió un poder que le permitía ver el nivel de cada carta en su pila de cartas ( deck) . Las cartas están numeradas de 1 a n desde el fondo hasta la cima de la pila. El deck está representado por un arreglo con las puntuaciones p_ i ( 1 ≤ i ≤ n) de cada carta. La carta con puntuación p_ 1 está en el fondo y la carta con puntuación p_ n está en la cima. Jorge está a punto de revolver su deck, por lo que quiere utilizar este poder para maximizar la fuerza de su deck y vencer a Santy, su malvado oponente. La fuerza del deck se define como: ∑_ i= 1^ n n^ n - i· p_ i Jorge revuelve su deck de la siguiente manera: - Elige un entero k ( 0 < k) . - Toma las primeras k cartas de la cima de su deck y las pone, en el orden en el que están, en la cima de una segunda pila que va a ser su deck revuelto. - Repite el proceso hasta que no queden cartas en su deck original. Por ejemplo, si el deck es 1 2 3 4 5, puede revolverlo de la siguiente manera: - k = 1: se toma la primer carta de la cima del deck original y se ponen en la cima del segundo deck. - Original: 1 2 3 4- Segundo: 5- k = 3: se toman las primeras 3 cartas de la cima del deck original y se ponen en la cima del segundo deck. - Original: 1- Segundo: 5 2 3 4- k = 1: se toma la primer carta de la cima del deck original y se ponen en la cima del segundo deck. - Original: - Segundo: 5 2 3 4 1Jorge sabe que eres un buen programador y quiere ganar a toda costa, por lo que te ha pedido que le ayudes a revolver su deck y calcules la fuerza obtenida. # ProblemaDado un arreglo con las puntuaciones p_ i de las n cartas del deck de Jorge ( desde el fondo hasta la cima) , revuelve el deck y calcula la fuerza obtenida. El puntaje obtenido para cada caso será mayor si tu respuesta se acerca a la fuerza máxima posible, o menor si se aleja de la fuerza máxima posible. Si imprimes la máxima fuerza posible, obtendrás todos los puntos.",
    "input": "En la primera línea un entero n, la cantidad de cartas del deck de Jorge. En la segunda línea, n enteros p_ i, las puntuaciones de cada carta empezando por el fondo y terminando en la cima del deck.",
    "output": "Una línea con un entero indicando la fuerza calculada, módulo 10^ 9 + 7.",
    "note": "",
    "topics": [
      "implementation",
      "number theory",
      "sortings",
      "math",
      "greedy"
    ],
    "id": 13002
  },
  {
    "title": "Wena jugadora",
    "url": "https://omegaup.com/arena/problem/Wena-jugadora",
    "history": "Wen adora jugar videojuegos y últimamente está obsesionada con uno en específico. Su historia la cautivó tanto que quiere terminarlo lo antes posible, pero tiene dos inconvenientes; Primero, según su mamá, no es sano que juegue tantas horas y segundo, ella tiene una extraña fobia a los números compuestos. Así que decidió que no jugará más de 10 horas por día y tampoco jugará alguna cantidad compuesta de horas. Un número compuesto, es cualquier número que se puede representar como la multiplicación de dos números, donde ninguno de los dos es 1, por ejemplo 21 = 3 x 7, 25 = 5 x 5. Por otro lado, 11 no es un número compuesto porque no hay dos números donde ninguno sea 1, que al multiplicarse el resultado sea 11. Ayuda a Wen a saber la mínima cantidad de días que necesita para terminar su videojuego.",
    "input": "La primera línea contendrá un entero 1≤ t ≤ 100, el número de casos de prueba. Después t líneas con un entero 1≤ n ≤ 1e7, el número de horas que restan del videojuego.",
    "output": "t líneas distintas con la cantidad mínima de días que son necesarios para terminar su videojuego, en cada caso.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 12926
  },
  {
    "title": "Explorando un nuevo mundo",
    "url": "https://omegaup.com/arena/problem/Explorando-un-nuevo-mundo",
    "history": "# HistoriaUna enfermedad mortal amenaza la vida de la tierra. Esta enfermedad convierte a los humanos en murcielagos. La grandes naciones se han unido para encontrar una cura a esto. Los grandes cientificos se dieron cuenta que la cura jamás será hallada en la tierra, así que decidieron explorar nuevas tierras. La OMI ( Organización Mundial Interespacial) mando una nave con un gran número de pasajeros para explorar cierto planeta. Las grandes mentes decidieron dividir a los tripulantes en grupos. El problema es que unas personas tienen menos experiencia que los otros. Cierto tripulante cuenta con una inexperiencia e_ i, esto significa que debe estar en un grupo con * * por lo menos* * e_ i personas. # ProblemaLos cientificos quieren explorar rapido el planeta; por lo cuál, les conviene tener bastantes grupos. Ayudar a los cientificos a saber cuál es la cantidad máxima de grupos que pueden obtener. * * Nota: * * No es necesario que todas las personas estén en un grupo. Pueden haber personas que se queden en la nave.",
    "input": "Se te dará un número N que indica la cantidad de personas que hay en la nave. Seguido se te dará una lista de N números e_ i que indica el nivel de * * inexperiencia* * de cada tripulante",
    "output": "Un único número representado la cantidad máxima de grupos que se pueden hacer. # Ejemplos| | input52 3 1 2 2| | output2| | descriptionPodemos dejar a la persona con inexperiencia 3 en la navey los grupos serían 1, 2 y 2, 2. Los grupos estan bienformados porque en cada grupo no hay un persona que tenga menospersonas que la experiencia de los integrantes. Además se puedever que es el mayor número de grupos que se pueden hacer. | | input42 2 1 1| | output3| | end# Limites* * Para un 10",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 12705
  },
  {
    "title": "¿Le brindé un buen servicio?",
    "url": "https://omegaup.com/arena/problem/Le-brinde-un-buen-servicio-hoy",
    "history": "Melanie consiguió un nuevo trabajo como cajera en un banco. Ella está muy emocionada porque así tendrá dinero para invitar a Adriana a un lujoso restaurante. Sin embargo, Melanie es pésima en su trabajo lo cual preocupa a Alonso, su supervisor, quién a pesar de que odia a Adriana y quisiera ver que Melanie sea despedida, debe mejorar la situación o será él quién sea despedido. Alonso no es tonto, así que le pide a cada cliente que diga qué trámite realizará para así poder decirle cuánto tiempo demorará su trámite. Con esta información crea una lista con el tiempo que demorará cada cliente en sus trámites, la cual puede servir a Melanie para mejorar las cosas. Alonso le da la lista a Melanie y le dice que la despedirá si no optimiza el funcionamiento de la cola. Melanie se da cuenta que las personas se * * molestan* * si el tiempo que esperan en la cola supera el tiempo que demorarán en sus trámites. Melanie está desesperada por lo que te pide ayuda para que cambies de posición a las personas en la fila de tal forma que la cantidad de personas * * molestas* * sea mínima. * * Importante: A pesar de que un cliente esté molesto Melanie debe atenderlo* *",
    "input": "- La primera linea contiene un número entero n, la cantidad de personas en la fila. - La segunda línea son n números que representan el tiempo que demorará cada persona en hacer su trámite.",
    "output": "En una única linea imprime el máximo número de personas * * no molestas* * que se puede lograr. | | input530 4 3 7 8| | output4| | end| | input105 1 1 1 1 1 1 1 1 1| | output3| | end# Limites- 2 ≤ n ≤ 10^ 5* * NOTA: * * En el primer ejemplo, si ordenamos a los clientes de la siguiente forma: [ 3 4 8 7 30] , todos los clientes en la fila no estarían molestos excepto el cliente con tiempo de trámite 7 ( el 4to en la fila) , por lo que la respuesta es 4.",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 12680
  },
  {
    "title": "Comunicación Confusa",
    "url": "https://omegaup.com/arena/problem/epis-comunicacion-confusa",
    "history": "Tu mejor amigo Adam compró recientemente una Raspberry Pi y algunos equipos, incluido un sensor de temperatura inalámbrico y un receptor de 433MHz para recibir las señales que envían los sensores. Adam planea usar la Raspberry Pi como pantalla interior para su sensor meteorológico. Como es muy bueno con la electrónica, rápidamente logró que el receptor recibiera las señales del sensor. Sin embargo, cuando miró los bytes enviados por el sensor, estos no parecian tener sentido. Después de algunas horas buscando en muchos sitios web, encontró un documento que explica que su sensor meteorológico codifica los datos que envía para evitar que se utilicen junto con productos de otros fabricantes. Afortunadamente, el documento también describe cómo el sensor codifica su comunicación. El documento establece que el sensor aplica la expresión x ∧ ( x < < 1) a cada byte enviado. El operador ∧ es XOR^ 1 de bit a bit, por ejemplo, 10110000 ∧ 01100100 = 11010100. El operador < < es un desplazamiento a la izquierda ( no circular) de un valor de byte^ 2, por ejemplo, 10111001 < < 1 = 01110010. Para que la Raspberry Pi de Adam interprete correctamente los bytes enviados por el sensor meteorológico, es necesario descifrar la transmisión. Sin embargo, Adam no es bueno programando ( en realidad es un programador bastante malo) . Entonces te pidió que lo ayudaras y, como buen amigo, siempre estás feliz de complacerlo. ¿Puedes ayudar a Adam implementando el algoritmo de decodificación?",
    "input": "La entrada consta de: - Una línea con un número entero n ( 1≤ n ≤ 10^ 5) que representa el número de bytes en el mensaje enviado por el sensor meteorológico; - Una línea con n números enteros b_ 1, . . . , b_ n ( 0 ≤ b_ i ≤ 255 para todo i) , que representan los valores de bytes del mensaje.",
    "output": "Una linea con n valores de bytes ( en formato decimal) , con el mensaje decodificado.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 12530
  },
  {
    "title": "Teselas",
    "url": "https://omegaup.com/arena/problem/epis-teselas",
    "history": "Los sitios web de mapas como Bing Maps y Google Maps a menudo almacenan sus mapas como muchos archivos de imágenes diferentes, llamadas teselas. El nivel de zoom más bajo ( nivel 0) consiste en un sola tesela con una imagen de bajo detalle de todo el mapa, el nivel de zoom 1 consta de cuatro teselas, cada uno con una versión ligeramente más detallada de una cuarta parte del mapa, y en general, el nivel de zoom n contiene 4n teselas diferentes que contienen cada uno una parte del mapa. Una forma de identificar una tesela es mediante una clave cuádruple. Una clave cuadruple es una cadena de dígitos que identifica de forma única una tesela en un cierto nivel de zoom. El primer dígito especifica en cuál de los cuatro cuadrantes del mapa completo se encuentra la tesela: 0 para el cuadrante superior izquierdo, 1 para el cuadrante superior derecho, 2 para el cuadrante inferior izquierdo y 3 para el cuadrante inferior derecho. Los dígitos siguientes especifican en qué subcuadrante del cuadrante actual se encuentra la tesela. Las claves cuádruples para los niveles de zoom 1 a 3 se muestran en la siguiente figura. ! [ imagen1] [ 1] Otra forma de identificar un mosaico es dar el nivel de zoom y las coordenadas x y y, donde ( 0, 0) es la esquina superior izquierda. Las coordenadas de los mosaicos del nivel de zoom 3 se muestran en la siguiente figura. ! [ imagen2] [ 2] Dada la clave cuádruple de una tesela, genere el nivel de zoom y las coordenadas x y y de esa tesela.",
    "input": "La entrada consta de: - Una línea con una cadena s ( 1 ≤ tamaño( s) ≤ 30) , la clave cuádruple de una tesela del mapa. - La cadena s consta únicamente de los dígitos \" 0\" , \" 1\" , \" 2\" y \" 3\" .",
    "output": "Genere tres números enteros, el nivel de zoom y las coordenadas x y y del mosaico. # # Ejemplo 1| | input3| | output1 1 1| | end# # Ejemplo 2| | input130| | output3 6 2| | end",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 12529
  },
  {
    "title": "Jurados",
    "url": "https://omegaup.com/arena/problem/epis-jurados",
    "history": "Los organizadores del XXVII CONEIMERA 2021 de la UNA- PUNO han decidido que quieren mejorar la calificación automática de las presentaciones para el concurso, por lo que ahora utilizan dos sistemas: Jurado A y Jurado B. Ambos sistemas evalúan cada envío y los resultados de la calificación se comparan para asegurarse de que los sistemas estén de acuerdo. Sin embargo, algo salió mal al establecer la conexión entre los sistemas, y ahora el jurado solo conoce todos los resultados de ambos sistemas, ¡pero no qué resultado pertenece a qué envio! Por lo tanto, se le pide que los ayude a determinar cuántos resultados podrían haber sido consistentes.",
    "input": "La entrada consta de: - Una línea con un número entero n ( 1≤ n ≤ 10^ 5) , que representa el número de envios; - n líneas, cada una con el resultado de la evaluación del Jurado A, en orden arbitrario; - n líneas, cada una con el resultado de la evaluación del Jurado B, en orden arbitrario. Cada resultado es una cadena de entre 5 y 15 caracteres ( inclusive) que consta de letras minúsculas.",
    "output": "Muestre una línea con el número máximo de resultados de evaluación que podrían haber sido los mismos para ambos sistemas.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 12528
  },
  {
    "title": "El Cumpleaños",
    "url": "https://omegaup.com/arena/problem/epis-cumple-1",
    "history": "Es el cumpleaños de tu amigo y tú y otras personas decidieron comprarle una copia de StarCraft II, porque ¿quién no querría tenerlo? Se acordo dividir los costos de la manera más justa posible. Dado que algunos tienen más dinero disponible que otros, también se acordó que nadie tiene que pagar más de lo que puede pagar. Cada contribución será un múltiplo de 1 centavo, es decir, nadie puede pagar fracciones de centavo. Todo el mundo anota la cantidad máxima que puede aportar. Teniendo en cuenta estas cantidades máximas de todos, se debe compartir el costo del presente de la manera más justa posible. Eso significa que minimiza la mayor distancia de las contribuciones al 1/ n- ésimo del costo total. En caso de empate, minimice la segunda distancia más grande y así sucesivamente. Dado que la unidad más pequeña de contribución es 1 centavo, puede haber más de una posible división del costo. En ese caso, las personas con un monto máximo superior pagan más. Si todavía hay ambigüedad, los que ocupan los primeros lugares en la lista pagan más. Ya que tu compraste el regalo, es tu tarea averiguar cuánto tienen que pagar todos ( incluyéndote a ti) .",
    "input": "En la primera línea se tiene un número entero positivo que representa el número de casos de prueba, como máximo 100. Después de eso, por caso de prueba: - Una línea con dos enteros p y n que representan el precio del presente en centavos ( 1≤ p ≤ 1000000) y el número de personas ( 2≤ n ≤ 1000000) quienes contribuyen en la compra del presente ( incluyendote a ti) . - Una línea con n números enteros a_ i ( 1 ≤ a_ i ≤ 1000000) , donde a_ i es la cantidad máxima, en centavos, que la i- ésima persona de la lista, puede contribuir.",
    "output": "Por cada caso de prueba: - Una linea con n números enteros que representan la cantidad que cada persona debe contribuir de acuerdo al esquema. Si el costo total no se puede dividir de acuerdo a las reglas de arriba, la linea debe contener \" IMPOSSIBLE\" en su lugar.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 12527
  },
  {
    "title": "Sanguchitos exquisitos",
    "url": "https://omegaup.com/arena/problem/Sanguchitos-exquisitos",
    "history": "Marcos es realmente fanático de los * sanguchitos* de miga. Por suerte, este año, va a ser el encargado de prepararlos para la cena de Navidad. Para considerar un sanguchito * exquisito* bajo su criterio, tiene que estar formado de alguna de estas tres formas: - Dos fetas de jamón, y un pan. - Dos fetas de jamón, una feta de queso, y un pan. - Una feta de jamón, una feta de queso, y un pan. Actualmente, Marcos posee n fetas de jamón, m fetas de queso, y k panes; y está realmente preocupado por saber cuál es la máxima cantidad de * sanguchitos exquisitos* que puede preparar para este banquete navideño, ¿Podrías ayudarlo?",
    "input": "La entrada consiste de una única línea con 3 números enteros, n, m, k, la cantidad de fetas de jamón, fetas de queso, y panes respectivamente. 0 < = n, m, k < = 10^ 8",
    "output": "Imprimir un entero indicando el máximo número de * sanguchitos exquisitos* que puede obtener nuestro amigo Marcos.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 12455
  },
  {
    "title": "El problema de la mochila (version continua)",
    "url": "https://omegaup.com/arena/problem/El-problema-de-la-mochila-c",
    "history": "Se cuenta con una colección de N objetos donde cada uno tiene un peso y un valor, y una mochila a la que le caben C unidades de peso. Escribe un programa que calcule la máxima suma de valores que se puede lograr guardando objetos ( o fracciones de ellos) en la mochila sin superar su capacidad de peso.",
    "input": "Dos enteros N y C seguidos de N parejas de enteros P, V que denotan el peso y el valor de cada uno de los N objetos. Puedes suponer que 0 ≤ N, C ≤ 10^ 5 y que 1 ≤ P, V ≤ 500.",
    "output": "Un real que sea la máxima suma de valores que se puede lograr, redondeado a dos puntos decimales.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 11407
  },
  {
    "title": "Circulismo",
    "url": "https://omegaup.com/arena/problem/Circulismo",
    "history": "Te has inscrito a una escuela de arte y la clase del día de hoy es circulismo, donde todo lo que se dibuja sobre el lienzo son círculos. Tu primera tarea de la clase es poder pintar un lienzo de altura H y base B, solo puedes dibujar círculos, pero con el detalle de que cada círculo tiene que tener su centro sobre la línea horizontal que está en medio, el maestro te dio una descripción de una serie de círculos ( su posición y su radio) que son los únicos círculos que puedes dibujar, tienes que pintar cada círculo con un color diferente. Pero la pintura es muy cara por eso quieres comprar la menor cantidad de colores y como tienes que cubrir cada rincón de cuadro con al menos un color, quieres saber cuál es el menor número de colores necesarios para realizar tu primer obra maestra de circulismo. ! [ Ejemplo de entrada] ( circulismo. png)",
    "input": "- Primer línea: contiene 3 números H, B y N, donde H es la altura del cuadro, B es la longitud de la base y N es el número de círculos que tienes permitido dibujar. - Siguientes N líneas: cada línea representa la descripción de cada círculo y contiene dos números X y R, donde X es la posición del centro del círculo y R es el radio del círculo.",
    "output": "Tu programa debe decir cuál es el mínimo número de colores que se necesita para realizar tu pintura o imprimir - 1 si no es posible pintar todo el cuadro.",
    "note": "",
    "topics": [
      "greedy",
      "sortings"
    ],
    "id": 11353
  },
  {
    "title": "Decoraciones",
    "url": "https://omegaup.com/arena/problem/Decoraciones",
    "history": "Tienes r globos rojos, g globos verdes y b globos azules. Para decorar una sola mesa de un banquete necesitas exactamente tres globos. Tres globos pegados a la misma mesa no pueden tener el mismo color. ¿Cuál es el máximo número t de mesas que pueden ser decoradas si sabemos la cantidad de globos de cada color?",
    "input": "Una única línea que contiene tres enteros r, g y b ( 0 ≤ r, g, b ≤ 2 · 10^ 9) - el número de globos rojos, verdes y azules, respectivamente. Los números están separados por exactamente un espacio.",
    "output": "Imprime un único entero t - el número máximo de mesas que pueden ser decoradas de la forma requerida.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 11099
  },
  {
    "title": "Leer libros",
    "url": "https://omegaup.com/arena/problem/Leer-Libros",
    "history": "María está entrenando para la * 1er Copa Centroamericana de Programación* . Tiene H horas antes de que empiece la competición y tiene L libros que quiere estudiar. Ella lee una página cada minuto y quiere saber cuál es el máximo número de libros que puede leer antes de la competición. Ella también sabe que leer libros grandes es más útil, entonces si hay dos grupos con el mismo números de libros, ella prefiere el grupo con el libro más grande que no esté en el otro grupo.",
    "input": "* La primer línea tendrá dos números H y L. * La próxima línea tendrá los L números. Cada número indica el número de páginas de cada uno de los libros. * No hay dos libros con el mismo número de páginas. * 0 H ≤ 10, 000* 0 L ≤ 100, 000* 0 L_ i ≤ 100, 000",
    "output": "El mejor grupo de libros ordenados por número de páginas.",
    "note": "",
    "topics": [
      "two pointers",
      "greedy",
      "sortings"
    ],
    "id": 10813
  },
  {
    "title": "Creando al genio",
    "url": "https://omegaup.com/arena/problem/Creando-al-genio",
    "history": "# HistoriaYa cansado de que todos le ganen, Santiago decidió crear un juego que era más bien una competencia/ experimento en el cuál estaba seguro de que no podía perder ( o por lo menos eso esperaba) . Su honor no le dejaba retar a alguien que ya le había ganado, es por eso que fue a desafiar a Jacobo. El reto consistía en que cada quién iba a entrenar a una persona para resolver problemas de programación. Después de entrenarlos, la persona ( de las que entrenaron) que más resolviera los problemas de un examén ganaba y por tanto, su entrenador le ganaba al otro. Se establecio una lista de M temas ( numerados del 1 al M) que pueden salir en el examén. Se considera que una persona aprende un temas después de que resuelve un problema de dicho tema. Santiago empezo a entrenar a su alumno de forma random. Sin embargo, Jacobo engenio un plan estrategico. Jacobo tomo una lista de N problemas en OmegaUp, cada problema tiene asociado un tema a_ i; pero, igual cada problema tiene un tiempo límite t_ i en el que lo puedes resolver ( después de ese tiempo el problema desaparece) . El tiempo lo medimos en minutos, entonces la persona que entrena Jacobo empieza en el minuto 0, tambien es una persona muy bien entrada entonces puede resolver cualquie problema en 1 minuto. Sin embargo, al ser un humano tiene limitaciones y cansa, después de resolver el primer problema ( sea cual sea el que decidá) tiene que descansar un minutos. Después de resolver el segundo problema debe descansar 2 minutos y así. EN general, después de resolver su k- esimo problema deberá descansar k minutos. Jacobo decidió hacer un programa que le ayude a calcular cuanto es el número máximo de temas que le puede enseñar a su alumnos para que le gane al de Santy. # ProblemaDada una lista de N problemas donde cada problema consiste en una pareja a_ i y t_ i ( tema y tiempo limite) ; decir, cuanta es la cantidad maxima de los M temás que puede aprender dicho alumno con las consideraciones dadas. Hay que tener encuenta que si la persona esta en el tiempo x y el problema tiene como limite el tiempo x aun puede resolver el problema el alumno.",
    "input": "Dos números N y M que representan la cantidad de problemas y cantidad de temas respectivamente. Seguido se darán N parejas de números a_ i y t_ i que representa el tema y el tiempo limite de dicho problema.",
    "output": "Un único entero representando la cantidad máxima de temas que puede aprender el alumno# Ejemplos| | input3 31 13 32 2| | output2| | descriptionPuede resolver el primer problema en el tiempo 0 y lo termina en el tiempo 1 y se debe esperar hasta el tiempo 2 por su descanso; luego resuelve el problema con tema 2 en ese mismo tiempo y lo termina en el minuto 3 se tiene que dar su descanso de 2 minutos y queda en el tiempo 4. Y ya no puede resolver nada más, entonces la cantidad máxima de temas que pudo aprender es de 2. | | input4 51 12 12 84 2| | output3| | end# LímitesPara todos los casos se satiface que- 1 ≤ a_ i ≤ M* * Para un 25",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 10643
  },
  {
    "title": "Y^3 + X^5 = N^7",
    "url": "https://omegaup.com/arena/problem/Y3--X5--N7",
    "history": "# HistoriaUn dia, Sebas estaba leyendo un Tzaloa de la OMM, y se encontro un problema muy dificil: \" Dado un entero N, determina si se cumple la igualdad Y^ 3 + X^ 5 = N^ 7 para algun X, Y entero. \" , cuya solucion no encontro. Tu como buen programador que eres, escribe un codigo que resuelva dicho problema.",
    "input": "Un entero N.",
    "output": "Imprime 1 o - 1 si existen o no dichos enteros respectivamente.",
    "note": "",
    "topics": [
      "strings",
      "brute force",
      "binary search",
      "implementation",
      "graphs",
      "trees",
      "geometry",
      "string suffix structures",
      "sortings",
      "flows",
      "graph matchings",
      "matrices",
      "dfs and similar",
      "constructive algorithms",
      "data structures",
      "combinatorics",
      "math",
      "number theory",
      "games",
      "dp",
      "shortest paths",
      "meet-in-the-middle",
      "greedy"
    ],
    "id": 9724
  },
  {
    "title": "Sumita cuadrada",
    "url": "https://omegaup.com/arena/problem/Sumita-cuadrada",
    "history": "Sebas está en un entrenamiento de matematicas, y le presentaron un problema: \" Demuestra que para toda N existe una suma de N números tal que su suma sea un cuadrado perfecto. \" , Sebas esta muy ocupado para resolver ese problema, y tú como buen programador que eres, te ha pedido que demuestres el problema con \" casitos\" .",
    "input": "Un entero N",
    "output": "Los N números distintos entre sí separados por un espacio y ordenados en orden creciente tal que su suma sea un cuadrado perfecto",
    "note": "",
    "topics": [
      "math",
      "trees",
      "implementation",
      "data structures",
      "meet-in-the-middle",
      "brute force",
      "dfs and similar",
      "matrices",
      "geometry",
      "combinatorics",
      "shortest paths",
      "dp",
      "binary search",
      "strings",
      "flows",
      "constructive algorithms",
      "number theory",
      "graph matchings",
      "greedy",
      "string suffix structures",
      "graphs",
      "sortings",
      "games"
    ],
    "id": 9723
  },
  {
    "title": "¿What is love?",
    "url": "https://omegaup.com/arena/problem/What-is-love",
    "history": "Melanie es una chica enamoradiza, nunca pasa una temporada entera sin tener pareja. Esto significa que sus relaciones no duran mucho, por lo que Melanie a empezado a dudar de si existe el amor. . . ! [ enter image description here] [ 1] Por suerte la nueva pareja de Melanie, Adriana, estudio ciencias de la computación y como un gesto romántico decidió enviarle mensajes románticos a Melanie. Ella los leyó en su smartphone y decidió imprimirlos, sin embargo su impresora esta malograda e imprimió el mensaje sobre una cadena de números. Sin embargo ella es super ecológica así que decide quedarse con las impresiones. Pero hay algunas que no tienen todo el mensaje entero así que te pide ayuda. ¿Puedes decirle a Melanie si el mensaje que le envió Adriana esta en la impresión? De ser así puedes decirle en que posición se encuentra cada letra, del mensaje en la impresión. Imprime las posiciones en orden.",
    "input": "- La primer línea de entrada contendrá un número n, el tamaño de laimpresión. - La segunda línea de entrada contendrá un string s, el mensaje queleyó Melanie. - La tercera linea de entrada contendrá un string w de tamaño n, lo quese imprimió.",
    "output": "Si el mensaje se encuentra en la impresión escribir * * YES* * y acto seguido escribir varios lineas con los índices en los que se encuentra cada letra del mensaje en la impresión. Caso contrario solo escribir * * NO* * | | input12lindal6i23n2d32a3| | outputYES025710| | end| | input8preciosapreciosa| | outputYES01234567| | end| | input27te quiero123t23e23q23u32i32e32r34o23| | outputNO| | end# Limites- 2< = n< = 500- 1< = s, w< = 500> NOTA: En el tercer ejemplo puedes ver que el mensaje original tiene un> espacio y la impresión no lo tiene, por ello la impresión es> incorrecta. Varios de los mensajes de Adriana son frases y otros> solo palabras pero Melanie te dará algunos puntos si le ayudas solo con palabras: > > - 75 puntos por un mensaje que es solo una palabra> - 25 puntos por un mensaje que es una frase# AyudaSi quieres leer frases que contengan espacios en c+ + puedes ver el siguiente [ link. ] ( https: / / repl. it/ repls/ LovelySillyDebugger)",
    "note": "",
    "topics": [
      "combinatorics",
      "strings",
      "greedy",
      "implementation"
    ],
    "id": 9613
  },
  {
    "title": "Gestionando archivos",
    "url": "https://omegaup.com/arena/problem/Gestionando-archivos",
    "history": "Qaqo está acomodando unos expedientes del archivero. Ella sabe que hay exactamente N expedientes y que cada uno está etiquetado con un número entre 1 y N. Ella quiere acomodarlos en un orden específico haciendo únicamente el siguiente movimiento: Qaqo toma el último expediente del archivero y lo mueve a cualquier posición que ella quiera. Quieres ayudar a Qaqo para que no trabaje de más. Tu tarea es decirle a Qaqo cuál es el mínimo número de movimientos que tiene que hacer para acomodar los expedientes.",
    "input": "En la primera línea un entero N, el número de expedientes que hay en el archivero. Las siguientes N líneas describen la configuración inicial del archivero. Para cada una, habrá un entero distinto entre 1 y N, que representa la etiqueta de ese expediente. El primer expediente dado es el que encuentra al principio del archivero. Las siguientes N líneas describen la configuración final deseada. Para cada una, habrá un entero distinto entre 1 y N, que representa la etiqueta de ese expediente. El primer expediente dado es el que encuentra al principio del archivero.",
    "output": "Un solo entero, la cantidad mínima de movimientos para organizar el archivero.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 9181
  },
  {
    "title": "John Freddy y los numeros",
    "url": "https://omegaup.com/arena/problem/John-Freddy-y-los-numeros",
    "history": "John Freddy es un estudiante que le gusta jugar mucho al fútbol, pero por estar jugando se le olvido hacer la tarea, por esa te pide el favor que le ayudes. La tarea consiste en dado un arreglo de N números, quieres saber cuanto es el máximo producto que se puede hacer escogiendo dos números del arreglo",
    "input": "Un número N seguido de N enteros, * * a< sub> 0< / sub> , a< sub> 1< / sub> , . . . , a< sub> n- 1< / sub> . * *",
    "output": "El máximo producto que se puede hacer escogiendo dos números del arreglo",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 8640
  },
  {
    "title": "Alumnos de Lions",
    "url": "https://omegaup.com/arena/problem/Alumnos-de-Lions",
    "history": "Te han asignado como presidente de la generación, y tus superiores quieren que hagas una encuesta y que determines qué tan saludables están todos los alumnos. Para hacer esta tarea, has monitoreado a los demás alumnos y podrás hacer un modelo matemático de la salud respecto a dos variables: comida y tiempo en el gimnasio. Tienes una lista de * * N* * alumnos y sabes que hay cuatro comidas en la cafetería en orden ascendente de salud: - Pizza ( la menos saludable) - Tacos- Torta- Ensalada ( la más saludable) También sabes que la comida tiene más impacto en la salud que el tiempo en el gimnasio, así que decides ordenar los alumnos primero por comida y luego por tiempo en el gimnasio.",
    "input": "Un entero * * N* * , el número de alumnos en la generación, seguido por * * N* * líneas. En cada una de las siguientes líneas, estará el nombre del alumno ( una sola cuerda) , el nombre de su comida preferida ( una sola cuerda) y finalmente un entero que representa el tiempo en el gimnasio en horas * * H* * .",
    "output": "* * N* * líneas, cada uno con el nombre de cada alumno. El más saludable debe ir primero y el menos saludable debe ir al final.",
    "note": "",
    "topics": [
      "implementation",
      "strings",
      "greedy"
    ],
    "id": 8616
  },
  {
    "title": "Agustín y sus meditaciones",
    "url": "https://omegaup.com/arena/problem/Agustin-y-sus-meditaciones",
    "history": "El pequeño Agustín no esta a gustín : ( Ayer llegó al palacio real, muy cansado de haber jugado toda la mañana, solo para encontrarse con la mala noticia de que su amigo Osman había refundido una nota en la que él, Agustín, había trabajado durante casi año y medio. La nota llevaba una sola palabra producto de las duras meditaciones que había llevado durante toda su vida ( cinco años tiene Agustín) . Así que apenas se enteró lo primero que hizo fue buscar por todo el palacio recolectando todas las notas que encontraba. Hoy por la mañana llegó Osman al palacio, a lo que Agustín le preguntó por la nota, él le respondió que había estado jugando un juego muy divertido con una nota que se había encontrado, sus palabras exactas fueron: > Supongamos que tenemos una palabra; digamos ”palabra”, luego llegamos y escogemos dos letras del abecedario; digamos ' a' y ' b' , entonces lo que hacemos es llegar y cambiar en la palabra las letras ' a' por letras ' b' y las letras ' b' por letras ' a' , entonces \" palabra\" quedaría \" pblbarb\" ¿No es asombroso? > E incluso lo podemos hacer con letras que no están en la palabra, digamos ' z' y ' l' , quedaría \" pbzbarb\" > Y mira, si lo hacemos con dos letras que no están en la palabra, digamos ' x' y ' y' , quedaría \" pbzbarb\" ¡Las posibilidades son infinitas! Agustín se fue muy enojado a su cuarto y no ha salido de allí desde el medio día, no quiere hablar con nadie ni ha recibido nada de comida. Si bien Agustín se sabe la palabra que él había escrito, él aún quiere hallar la nota, y está intentando descifrar cuál de las notas que él recolectó es la nota donde él originalmente escribió su palabra. Él ya descartó todas aquellas donde el tamaño de la palabra de Agustín ( llamemosla S) y la palabra escrita en la nota ( llamemosla Q) son diferentes. Entonces él te va a dar las dos palabras y tú tienes que ayudarlo diciéndole si se puede llegar desde la palabra que él escribió a la palabra escrita en la nota haciendo el juego de Osman cuantas veces sean necesarias ( No tenemos seguridad de cuantas veces hizo Osman el juego) . Ayúdalo por favor, él aún tiene cinco años y se le hacen muy difíciles estos trabajos : (",
    "input": "Un cadena de carácteres S; la palabra que escribió Agustín, y una cadena de carácteres Q que consisten de solamente letras minúsculas del alfabeto inglés. | S| = | Q| ( | S| se refiere al tamaño de la cadena de carácteres S) .",
    "output": "Imprime “Si“ si se puede llegar de la palabra S a la palabra Q haciendo el juego de Osman; imprime “No“ si no se puede.",
    "note": "",
    "topics": [
      "strings",
      "implementation",
      "greedy"
    ],
    "id": 8591
  },
  {
    "title": "Subiendo la bomba por la colina",
    "url": "https://omegaup.com/arena/problem/Subiendo-la-bomba-por-la-colina",
    "history": "Hay N robots en una colina y una bomba en la base de la misma: tu objetivo es usar los robots para subir la bomba lo más posible sobre la colina. Cada robot cuenta con una altura inicial H, una cantidad de energía E y puede bajar la colina sin gastar energía pero gasta una unidad de energía para subir una unidad de altura. Cuando un robot alcanza la bomba, éste puede cargarla y llevársela ( el robot gasta la misma cantidad de energía subiendo con o sin la bomba) ; el robot puede soltar la bomba en cualquier momento o bien, soltarla hasta que se acabe su energía y ya no pueda avanzar más. Si fuera posible, otro robot puede ir a recoger la bomba en la posición en la que quedó para seguir subiéndola. Los robots pueden programarse en cualquier orden. Escribe un programa que determine la altura máxima que puede alcanzar la bomba si se usan los robots de manera óptima.",
    "input": "Un entero N seguido de N parejas de enteros H, E que determinan la altura y energía de cada robot. Puedes suponer que 0 ≤ N ≤ 10^ 5, 0 ≤ H ≤ 10^ 9 y 0 ≤ E ≤ 10^ 6.",
    "output": "Un entero positivo que sea la altura máxima que puede alcanzar la bomba.",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 8526
  },
  {
    "title": "Matriz Binaria",
    "url": "https://omegaup.com/arena/problem/Matriz-Binaria",
    "history": "Se te da una matriz booleana ( sus entradas son todas ceros o unos) de N renglones y M columnas. Puedes realizar la siguiente operación: * Elegir un renglón o una columna y cambiar el estado de cada elemento. Si el elemento es 0 entonces se cambia a 1, y si el elemento es 1 entonces se cambia a 0. Se te permite realizar un número ilimitado de operaciones. Al final, se interpreta cada renglón como la representación binaria de un número, donde la primera columna se asocia con el bit más signicativo. Tu tarea es maximizar la suma de todos los N números.",
    "input": "La primera línea contiene dos enteros N y M, el tamaño de la matriz. Las siguientes N líneas contienen M números, representando la matriz.",
    "output": "La máxima suma que se puede obtener.",
    "note": "",
    "topics": [
      "greedy",
      "matrices",
      "math"
    ],
    "id": 8247
  },
  {
    "title": "Cena mejorado",
    "url": "https://omegaup.com/arena/problem/Cena-2",
    "history": "Los alumnos de Fernanda son muy necios acerca de sus compañeros de comida. Ellos se han organizado en dos grupos alimenticios( convenientemente numerados 1 y 2) que insisten en comer juntos, con el grupo 1 al inicio de la fila y el grupo 2 al final de la misma. El problema comienza cuando ellas se forman para entrar al área de alimentación. Cada alumnosiilleva con el una pequeña tarjeta en la cual está grabadoDi( 1< = Di< = 2) Di( 1< = Di< = 2) indicando su pertenencia a un grupo alimenticio. Todo el conjunto deN( 1< = N< = 30, 000) N( 1< = N< = 30, 000) alumnos se ha alineado para la comida pero es fácil para cualquiera ver, que ellos no están agrupadas según sus tarjetas de grupo alimenticio. El trabajo de la maestra Fernanda es muy complicado para ella. Ella recorre la línea de alumnos cambiando su asignación de grupo alimenticio tachando el número antiguo y escribiendo uno nuevo. Haciendo eso, ella crea grupos de alumnos como 1112222 o 1111122 en los que los grupos alimenticios de los alumnos están ordenados ascendentemente. En pocas ocasiones, ella podría cambiar las tarjetas de tal manera que solamente quede un grupo de alumnos ( por ejemplo, 1111111 o 2222222) . Fernanda está cansada y por eso, Cyntia y Fátima se ofrecieron a ayudarle: ¿cuál es el número mínimo absoluto de tarjetas que ella debe cambiar para crear un grupo apropiado de socios alimentarios? Debes únicamente cambiar los números de las tarjetas y no reorganizar a los alumnos en la fila.",
    "input": "Línea 1: Un solo entero: NLíneas 2. . N+ 1: La línea i+ 1 describe la preferencia alimentaria del alumno i con un solo entero: DiDi",
    "output": "Línea 1: Un solo entero que es el número mínimo de tarjetas que la maestra Fernanda la diosa suprema debe cambiar para asignar los alumnos a los grupos alimentarios como se ha descrito.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 7875
  },
  {
    "title": "Juego con piedras",
    "url": "https://omegaup.com/arena/problem/Juego-con-piedras",
    "history": "Eric y Matías están jugando con una pila de N piedras. En su turno, cada uno de ellos debe sacar entre 1 y K piedras de la pila. El que saque la última piedra será el ganador. Se sabe que ambos son muy inteligentes y por lo tanto siempre juegan de forma óptima. Además siempre empieza jugando Eric. ¿Quién será el ganador?",
    "input": "La entrada consiste de una única línea con dos enteros N ( 1< = N< = 10^ 9) y K ( 1< = K< = 10^ 9) , que indican respectivamente la cantidad inicial de piedras en la pila y el número máximo de piedras que se puede sacar en un turno.",
    "output": "Imprimir el nombre del ganador.",
    "note": "",
    "topics": [
      "games",
      "greedy",
      "implementation"
    ],
    "id": 7287
  },
  {
    "title": "Mataron a Kenny",
    "url": "https://omegaup.com/arena/problem/Mataron-a-Kenny",
    "history": "KENNY quiere saber el mayor de N números, para hacerlo mas interesante el quiere sumarle el numeromas pequeño y multiplicarlo por N, como KENNY esta muerto quiere que hagas un programa que realicé estos cálculos por el. ! [ enter image description here] [ 1] < / center>",
    "input": "En la primera linea un entero N que indica la cantidad de números a leer en la segunda linea separados por un espacio.",
    "output": "Un entero L que representa la suma del mayor con el menor y su multiplicación por N",
    "note": "",
    "topics": [
      "greedy",
      "math",
      "sortings"
    ],
    "id": 6845
  },
  {
    "title": "Monedas volteadas en intervalos",
    "url": "https://omegaup.com/arena/problem/Monedas-volteadas-en-intervalos",
    "history": "Cuentas con un fila infinita de monedas donde todas muestran sol inicialmente. Escribe un programa que calcule la menor cantidad de monedas que necesitas voltear para que exista al menos un águila en cada uno de los M intervalos que se te darán.",
    "input": "Un entero M seguido de M parejas de enteros I, J correspondientes a intervalos cerrados. Puedes suponer que 0 ≤ M ≤ 100, 000 y que 1 ≤ I ≤ J ≤ 1, 000, 000.",
    "output": "Un entero que sea la menor cantidad de monedas que necesitas voltear.",
    "note": "",
    "topics": [
      "greedy",
      "sortings",
      "implementation"
    ],
    "id": 6758
  },
  {
    "title": "Voltea monedas consecutivas",
    "url": "https://omegaup.com/arena/problem/Voltea-monedas-consecutivas",
    "history": "Cuentas con un fila de N monedas, donde algunas de ellas muestran sol y otras muestran aguila, y puedes realizar una operación que voltea un grupo de M monedas consecutivas. Escribe un programa que calcule la menor cantidad de veces que necesitas realizar la operación para que todas las monedas muestren sol.",
    "input": "Dos enteros N y M seguido de N enteros que corresponden con el estado de las monedas ( un 1 denota sol y un 0 denota águila) . Puedes suponer que 1 ≤ M ≤ N ≤ 1000.",
    "output": "Un entero que sea la menor cantidad de veces que necesitas realizar la operación o - 1 si es imposible voltear las monedas.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 6632
  },
  {
    "title": "Alumina",
    "url": "https://omegaup.com/arena/problem/Alumina",
    "history": "Todas las ciudades de Alumina están localizadas sobre una línea enumerada. Por lo tanto, cada ciudad tiene asociada un número de acuerdo a su posición en la línea. No hay dos ciudades en un mismo punto. Los habitantes de Alumina adoran enviarse cartas entre ellos. Cada persona puede enviar una carta solo a habitantes de otra ciudad ( Ya que si viven en la misma ciudad, entonces es fácil entregarla) . Soñará extraño, pero es cierto. . . el costo de enviar una carta es equivalente a la distancia entre las ciudades del destinatario y el remitente. Para cada ciudad debes calcular dos valores min_ i y max_ i, donde min_ i es el mínimo costo de enviar una carta desde la i- ésima ciudad a cualquier otra ciudad, y max_ i es el máximo costo de enviar una carta desde la i- ésima ciudad a cualquier otra.",
    "input": "La primera línea de la entrada contendrá un entero n ( 2≤ n ≤ 10^ 5) - el número de ciudades en Alumina. La segunda línea contendrá la secuencia de n enteros distintos x_ 1, x_ 2, x_ 3, . . . , x_ n ( - 10^ 9≤ x_ i≤ 10^ 9) , donde x_ i es la posición de la i- ésima ciudad. Todas las x_ i' s son distintas y están dadas en orden * * ascendiente* * .",
    "output": "Imprimé n líneas, donde la i- ésima línea contiene dos enteros min_ i, max_ i, separados por un espacio.",
    "note": "",
    "topics": [
      "implementation",
      "greedy"
    ],
    "id": 6624
  },
  {
    "title": "Creación de concursos de programación",
    "url": "https://omegaup.com/arena/problem/Creacion-de-concursos-de-program",
    "history": "Eres el encargado de organizar una serie de concursos de programación y cada concurso consta de exactamente cuatro problemas. En cada concurso deseas poner problemas con niveles de dificultad P_ 1, P_ 2, P_ 3, P_ 4 tales que 1 ≤ P_ 1 < P_ 2 < P_ 3 < P_ 4 ≤ 100 y que P_ i+ 1 - P_ i≤ 10. Cuentas ya con una lista ordenada de N problemas y deseas organizar la serie de concursos de este año de modo que los problemas de tu lista aparezcan en el mismo orden. Sin embargo, es posible que sea necesario inventar e insertar problemas nuevos en la lista que todos los concursos organizados cumplan las restricciones. Una vez finalizada la lista, los primeros cuatro problemas formarán el primer concurso, los siguientes cuatro problemas formarán el siguiente concurso y así sucesivamente. Escribe un programa que determine cuál es el número mínimo de problemas nuevos que necesitas insertar en la lista para organizar la serie de concursos.",
    "input": "La entrada consiste de varios casos de prueba, los cuales deben procesarse hasta el fin de archivo. Cada caso de prueba consiste de un entero N seguido una secuencia de N enteros que denotan las dificultades de los N problemas de tu lista original. Puedes suponer que 1 ≤ N ≤ 100, 000 y que las dificultades de los problemas están en el rango de 1 a 100.",
    "output": "Para cada caso de prueba, un entero que sea la mínima cantidad de problemas nuevos que necesitas insertar en la lista.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 6601
  },
  {
    "title": "Grafo Tramposo",
    "url": "https://omegaup.com/arena/problem/Grafo-Tramposo",
    "history": "Randy y Briaares son muy buenos amigos. El problema es que, por lo general, a Briaares le encanta molestar a Randy. Es por ello que Briaares decidió construir un grafo lleno de trampas, un * * Grafo Tramposo* * . Una vez que Briaares terminó de elaborar el Grafo Tramposo, le gritó a Randy: * \" ¡Hey, Randy, ven a ver mi grandioso grafo! * solo para después poder patearlo dentro del grafo. Un Grafo Tramposo es un grafo no dirigido con n vértices y m aristas. Cada arista k tiene asignado un rango de enteros l_ k y r_ k ( l_ k≤ r_ k) . Para poder salir del Grafo Tramposo, Randy debe escoger inicialmente ( es decir, antes de empezar a moverse) algún entero ( llamémosle x) , entonces Randy deberá moverse de alguna manera desde el vértice con el número 1 al vértice con el número n. Además, Randy puede pasar a través de una arista k sólo si l_ k≤ x≤ r_ k. Para hacer el escape más fácil, Briaares definió la * * lealtad* * de un camino que va desde el 1er vértice hasta el n- ésimo como el número de enteros x tales que, si Randy escoge algunos de ellos, puede pasar por el camino completo. Ayuda a Randy a encontrar el camino con la máxima lealtad y así poder salir del Grafo Tramposo tan rápido como sea posible.",
    "input": "La primera línea contiene dos enteros n y m ( 2≤ n≤ 10^ 3, 0≤ m≤ 3· 10^ 3) . Las siguientes m líneas describen las aristas. Cada línea contiene cuatro enteros a_ k, b_ k, l_ k y r_ k ( 1≤ a_ k, b_ k≤ n, 1≤ l_ k≤ r_ k≤ 10^ 6) . Los números significan que en el Grafo Tramposo, la k- ésima arista conecta los vértices a_ k y b_ k, y esta arista corresponde al rango de enteros desde l_ k a r_ k. Note que el grafo dado puede contener ciclos y múltiples aristas entre un mismo par de nodos.",
    "output": "En una sola línea imprime un entero - la máxima lealtad de entre todos los caminos que van del primer vértice al n- ésimo. Si dicho camino no existe, o la máxima lealtad es 0, imprime en una sola línea \" Oh, vamos! \" , sin comillas.",
    "note": "",
    "topics": [
      "graphs",
      "binary search",
      "greedy",
      "shortest paths"
    ],
    "id": 6213
  },
  {
    "title": "El escape de los ratones",
    "url": "https://omegaup.com/arena/problem/El-escape-de-los-ratones",
    "history": "Había una vez una casa infestada de ratones, todos idénticos entre sí. Un gato escuchó hablar de ella y decidió vivir ahí, atrapando a los ratones uno tras otro. Un día, los ratones no pudieron soportarlo más y todos corrieron al mismo tiempo hacia sus madrigueras para esconderse y permanecer ahí. Escribe un programa que, dadas las posiciones de los ratones así como las posiciones y capacidades de las madrigueras, calcule la cantidad mínima de segundos que se requiere para que todos los ratones logren esconderse.",
    "input": "Un entero N seguido de N enteros que denotan las posiciones de los ratones. Posteriormente un entero M seguido de M parejas de enteros que denotan la posición y la capacidad de cada una de las madrigueras. Puedes suponer que 1 ≤ N, M ≤ 1000, que todas las posiciones ( ratones y madrigueras) son distintas y están en el rango de 0 a 1000000, que las capacidades de las madrigueras están en el rango de 1 a 5 y que los ratones corren a una velocidad de una posición por segundo.",
    "output": "Un entero que sea la cantidad mínima de segundos requerida para que los ratones logren esconderse o el entero - 1 si no existe solución.",
    "note": "",
    "topics": [
      "binary search",
      "greedy"
    ],
    "id": 5333
  },
  {
    "title": "Exploración",
    "url": "https://omegaup.com/arena/problem/Exploracion",
    "history": "Bessie está viajando en un camino lleno de marcas interesantes. Sipensamos en este camino como una línea numérica, Bessie comienza en el“origen” ( x = 0) , y hay N ( 1 < = N < = 50, 000) marcas ubicadas en lospuntos X_ 1. . . X_ N ( - 10, 000 < = X_ i < = 10, 000) . Bessie quiere visitartantas marcas como sea posible antes del atardecer, lo cual ocurre en T( 1 < = T < = 1, 000, 000, 000) minutos. Luego ella parará donde sea que esté ydescansará. Le toma a Bessie 1 minuto desplazarse 1 unidad dedistancia. Bessie visitará las marcas en un orden determinado, como las marcas máscerca al origen son más importantes, ella siempre visitará las marcas novisitadas que estén más cerca al origen. Nunca habrá 2 marcas a la mismadistancia del origenAyude a Bessie a determinar el número máximo de marcas que ella puedevisitar antes de que termine el día.",
    "input": "* Línea 1: Dos enteros separados por espacio: T y N. * Líneas 2. . . N+ 1: La línea i+ 1 contiene X_ i, la ubicación de la marcai- ésima.",
    "output": "* Línea 1: El número máximo de marcas que Bessie puede visitar.",
    "note": "",
    "topics": [
      "implementation",
      "greedy"
    ],
    "id": 4785
  },
  {
    "title": "Horarios empalmados",
    "url": "https://omegaup.com/arena/problem/Horarios-empalmados",
    "history": "En la feria de ciencias de este año se organizaron muchos eventos en diferentes puntos de tu escuela, pero desafortunadamente no podrás asistir a todos los eventos debido a que algunos horarios están empalmados. Tu consuelo será el asistir a la mayor cantidad posible de eventos distintos completos. Dada la lista de tiempos de inicio y fin de cada evento, escribe un programa que calcule a cuántos eventos puedes asistir.",
    "input": "Un entero N seguido de N parejas de enteros T_ i, F_ i que denotan los tiempos de inicio y de fin del i- ésimo evento. Puedes suponer que 1 ≤ N ≤ 100, 000 y que 0 ≤ T_ i < F_ i ≤ 1, 000, 000 para 1 ≤ i ≤ N.",
    "output": "Un entero que denota la mayor cantidad de eventos a los cuales es posible asistir.",
    "note": "",
    "topics": [
      "greedy",
      "sortings"
    ],
    "id": 4747
  },
  {
    "title": "Comprador de Bloques",
    "url": "https://omegaup.com/arena/problem/Comprador-de-Bloques",
    "history": "¡Por fin son vacaciones : D! te has puesto a limpiar tu cuarto y te encontraste con una caja de bloques ensamblables, y decidiste separarlos por colores formando una torre de cada color diferente una al lado de la otra, formando un “muro”, como la configuración de los colores te gustó tanto no quieres cambiar el orden de las torres. Además de tus bloques encontraste un viejo poster de tu banda favorita y lo quieres pegar un tu “muro” de bloques, solo que hay un problema, el poster no pegara bien a menos que donde lo pongas este completamente cubierto por bloques y además sus lados sean paralelos a los ejes X y Y. Como no quieres que tu poster se caiga quieres encontrar el lugar adecuado en donde colocarlo, sin embargo, no siempre será posible encontrar un lugar para pegar el póster. Como además te encontraste una vieja alcancía con dinero, te has propuesto comprar bloques de colores para poder pegar tu poster, pero como te gusta la organización, los bloques los compraras de la siguiente forma: 1) Busca la menor altura entre las torres de bloques. 2) Para cada torre con esa altura compraras suficientes bloques para igualar a la segunda menor altura de las torres. Cada bloque de la torre i costara i pesos, las torres están indexadas en 1. 3) Si después de realizar tus compras, no lograste pegar tu poster, tendrás que ir a comprar más bloques.",
    "input": "Primera línea N H B, representando el número de torres de bloques, la altura del poster, y el ancho del poster, respectivamente. Segunda línea N números representando la altura H_ i de cada torre de bloques.",
    "output": "Una línea. El mínimo de dinero que tienes que gastar de tu alcancía para poder pegar tu poster. Se garantiza que siempre habrá solución.",
    "note": "",
    "topics": [
      "greedy",
      "binary search",
      "implementation"
    ],
    "id": 4197
  },
  {
    "title": "Las Cartas del Dr. Lira (Adaptacion)",
    "url": "https://omegaup.com/arena/problem/Cartas-Lira",
    "history": "Dr. Lira tiene N cartas acomodadas en una secuencia. Él numeró las cartas de izquierda a derecha con números de 0 a N- 1. Cada carta está coloreada negra de un lado y blanco del otro. Algunas de las cartas ( posiblemente ninguna o todas) estarán acomodadas con el lado negro hacia arriba y otras con el blanco. Para activar su arsenal de armas, Dr. Lira necesita voltear algunas cartas tal que queden acomodadas de forma alternada: cada par de cartas consecutivas deben tener colores diferentes. Para no cansarse, Dr. Lira ha contratado tus servicios para que encuentres cuál es el mínimo número de cartas que tienes que voltear para que todas las cartas queden alternadas.",
    "input": "Tendrás como entrada un entero 3≤N≤50 que indica el número de cartas de Dr. Lira. En la siguiente línea encontrarás la configuración actual de las cartas, cada una representada por un numero 1 o 0: si el caracter en la i- ésima posición es 1, quiere decir que la carta está actualmente mostrando su lado negro, si es 0, quiere decir que está mostrando su lado blanco.",
    "output": "Cuenta e imprime un entero representando el mínimo número de cartas que necesitas voltear para obtener la configuración que alterne las cartas.",
    "note": "",
    "topics": [
      "implementation",
      "greedy"
    ],
    "id": 4059
  },
  {
    "title": "El baile de las langostas",
    "url": "https://omegaup.com/arena/problem/El-baile-de-las-langostas",
    "history": "La falsa tortuga y el grifo le preguntaron a Alicia si conocía el baile de langostas. Cuando Alicia les respondió que no, la tortuga dio un suspiro de desaprobación y dijo \" ¡no tienes idea de lo hermoso que es! \" El grifo comenzó a describir el baile: \" todos los animales presentes ( focas, tortugas y demás) intentan formar F filas de C animales cada una, ¡pero no se vale que haya animales repetidos en la misma fila! \" . El grifo terminó el relato: \" y cuando lo hayan logrado, ¡cada animal agarra una langosta y la avienta hacia el mar lo más lejos posible! \" . \" ¡¡Lo más posible! ! \" gritó emocionada la falsa tortuga. Alicia rápidamente se dio cuenta que lo más complicado del baile era formar a los animales de la manera correcta. Dada una descripción de los animales presentes, ayuda a Alicia a encontrar una formación que cumpla los requisitos del baile.",
    "input": "Los enteros F y C seguidos de F * C enteros que identifican las especies de los animales a formar. Puedes suponer que 1 le; F, C le; F * C le; 100000, que las especies de animales están representadas por enteros en el rango de 1 a 100 y que siempre es posible formar a los animales.",
    "output": "Una matriz de F × C enteros que denoten una manera correcta de formar a los animales.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 3887
  },
  {
    "title": "Candidato independiente",
    "url": "https://omegaup.com/arena/problem/candidato_independiente",
    "history": "Éste es un año electoral y las candidaturas independientes han sido autorizadas. Para ganar terreno, Engel, candidato independiente, ha decidido eficientar sus asistencias a los diferentes eventos ( conferencias, cenas, desayunos, presentaciones, visitas, etc. ) Engel desea acudir a tantos eventos como sea posible. No hay tanto problema entre semana porque sólo hay dos o tres eventos en la tarde, pero los sábados su agenda está saturada. Por lo general los eventos empiezan a las 8 am ( desayuno incluido) y pueden terminarse hasta media noche ( para no molestar a los vecinos) . Naturalmente Engel quiere asistir al máximo número de eventos posibles. Cada evento tiene una hora de inicio y otra de fin, todas las horas exactas. Están listadas con el formato de 24 horas. Por ejemplo un evento podrá empezar a las 10 am ( 10) y finalizar a las 2 pm ( 14) . El primer evento puede empezar a las 8 am ( 8) y el último evento finalizar a media noche ( 24) . A fin de no ser descortés, Engel se queda en cada evento al menos media hora y se debe de considerar que el traslado entre los eventos es instantáneo. Si no hay eventos que atender en algunas horas del día, simplemente se va a la casa de campaña a descansar.",
    "input": "Cada caso prueba contiene un entero p ( ≤ 100) que indica los eventos que se tienen considerados para ese día. En las siguientes p líneas, cada una con el formato s, e, ambos enteros donde 8 ≤ s ≤ e ≤ 24, se indica la hora s de inicio del evento y el fin a la hora e. Se debe de tomar en cuenta que puede haber muchos eventos con la misma hora de inicio y fin",
    "output": "Indique el valor n con el máximo número de eventos que Engel puede atender# Ejemplos| | input314 1514 1514 15| | output2| | input812 1313 1412 139 109 1012 1312 149 11| | output7| | end",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 3646
  },
  {
    "title": "Greedy Artisan",
    "url": "https://omegaup.com/arena/problem/Greedy-Artisan",
    "history": "On their way to the next World Finals, Mr. Ed and his pals are visiting the beautiful city of Moscow. One of their favorite tourism activities is buying souvenirs to bring back home, so they are looking for matryoshkas in a big artisan market close to the Red Square. < center> ! [ Matryoshkas] ( matryoshkas. jpg) < / center> In the market, there is a very greedy and clever artisan that sells custom sets of matryoshkas. This artisan has n different matryoshkas in stock, each one having a unique identifier i ( 1 ≤ i ≤ n) , a size s_ i and a base price p_ i. As the artisan is really clever, he offers a special deal to his clients: Assume someone wants to buy the custom set T = i_ 1, i_ 2, . . . , i_ m of m matryoshkas. Let us call i_ max to the identifier of the matryoshka with the maximum size and, in case there are multiple matryoshkas with maximum size, the maximum price in T, then the price one has to pay to buy T is price( T) = ∑_ j = 1^ m s_ i_ j/ s_ i_ max× p_ i_ max Mr. Ed wants to exploit the artisan’s deal buying exactly k matryoshkas, regardless which are the sizes of each matryoshka. Please determine the minimum number of money he needs to expend.",
    "input": "The input will contain several test cases. The first line of each test case contains 2 space- separated integers n and k, representing the number of matryoshkas the artisan has in stock and the number of matryoshkas Mr. Ed wants to buy ( 1 ≤ n ≤ 100, 000 and 1 ≤ k ≤ n) . There will follow n lines. The i- th line contains 2 integers s_ i and p_ i, representing the size and the base price of the i- th matryoshka ( 1 ≤ s_ i, p_ i ≤ 10^ 6) . There may be matryoshkas with the same s_ i and p_ i. The last test case is followed by a single line containing 2 zeroes.",
    "output": "For each case, print a single line with a real number with 6 digits after the decimal point representing the minimum price Mr. Ed has to pay to buy k matryoshkas ( see format below) . # Example| | input3 210 54 46 30 0| | outputCase # 1: 5. 000000| | end",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 3025
  },
  {
    "title": "IOI 2011 - Rice Hub",
    "url": "https://omegaup.com/arena/problem/RiceHub",
    "history": "En las afueras de la ciudad se encuentra un famoso camino llamado Camino de Arroz, a lo largo de este camino hay R campos de arroz, cada uno de ellos se encuentra en una coordenada entera entre 1 y L inclusivo. Dichos campos de arroz serán dados en un orden no decreciente, formalmente para 0 < = i < = R, donde X[ i] representa la coordenada del campo i, puedes asumir que 1 < = X[ 0] < = X[ 1] < = . . . < = X[ R- 1] < = L. Nota que * puede haber más de un campo de arroz en una misma coordenada* . Se planea construir un Almacén de arroz para guardar la mayor cantidad de arroz que se pueda y al igual que los campos de arroz, el Almacén de Arroz debe encontrarse en una coordenada entera entre 1 y L inclusivo, no importa si en dicha coordenada se encuentran uno o más campos de arroz. Cada campo de arroz produce exactamente la cantidad necesaria para llenar un camión, para transportar el arroz al almacén, es necesario contratar un camionero, el cual cobra un Baht por transportar un camión lleno de arroz una unidad de distancia. En otras palabras, el costo de transportar el arroz de un campo hasta el almacén es igual a la diferencia entre sus coordenadas. Desafortunadamente el presupuesto está limitado y no se quiere gastar más de B Bahts en el transporte. Tu tarea consiste en situar el almacén de arroz para almacenar la mayor cantidad de arroz que se pueda.",
    "input": "Tu programa leerá la entrada con el siguiente formato: * Línea 1: R, L, y B. * Líneas 2 a R + 1: La localización de los campos de arroz, es decir, la línea i + 2, contiene X[ i] para 0 < = i < = R.",
    "output": "Tu programa debe encontrar una localización óptima para el almacén e imprimir el número máximo de camiones de arroz que pueden ser transportados al almacén sin exceder el presupuesto.",
    "note": "",
    "topics": [
      "greedy",
      "binary search"
    ],
    "id": 2894
  },
  {
    "title": "IOI 2000 - Estacionamiento",
    "url": "https://omegaup.com/arena/problem/IOI-2000---Estacionamiento",
    "history": "< center> ! [ Logo IOI 2000] ( logo00. jpg) < / center> ——————- # EstacionamientoUn estacionamiento cercano a la Gran Muralla tiene una larga fila de lugares para estacionarse. Actualmente la fila se encuentra completamente ocupada por automóviles. Cada automóvil es de un determinado tipo, y varios automóviles pueden ser del mismo tipo. Los tipos de automóviles son identificados con un valor entero. Algunos trabajadores han decidido ordenar los automóviles estacionados en la fila por su tipo, en orden ascendente de izquierda a derecha utilizando el siguiente procedimiento: En lo que llamaremos una ronda, cada uno de los trabajadores toma un auto y lo saca del lugar en el que estaba estacionado, liberando así algunos espacios del estacionamiento, luego, cada uno de los trabajadores estaciona el auto que tomó en alguno de los lugares que se liberaron durante la misma ronda. Puede darse el caso de que algunos trabajadores no muevan ningún automóvil durante una ronda. Supón que N es el número de automóviles en la fila y W es el número de trabajadores. Escribe un programa que, dados los tipos de automóviles estacionados en la fila y el número de trabajadores, encuentre dicha forma de ordenar los automóviles y el número de rondas necesarias sea a lo más ⌈N/ W - 1⌉, es decir N/ W - 1 redondeado al entero más cercano que sea mayor o igual a este número. El mínimo número de rondas necesarias para ordenar los automóviles, nunca será mayor a ⌈N/ W - 1⌉. Considera el siguiente ejemplo. Hay 10 autos estacionados, de los tipos 1, 2, 3, y 4 con 4 trabajadores. El acomodo inicial de los automóviles identificados por su tipo, de izquierda a derecha es: 2 3 3 4 4 2 1 1 3 1El mínimo numero de rondas necesarias es tres, y las rondas se pueden llevar a cabo de tal manera que el acomodo de los automóviles después de cada ronda sea: * 2 1 1 4 4 2 3 3 3 1 \u0096 después de la ronda 1, * 2 1 1 2 4 3 3 3 4 1 \u0096 después de la ronda 2, y* 1 1 1 2 2 3 3 3 4 4 \u0096 después de la ronda 3.",
    "input": "La primera línea contendrá tres enteros. El primer entero es el número de automóvles N, 2 ≤ N ≤ 20000. El segundo entero es la cantidad de tipos de automóviles M, 2 ≤ M ≤ 50. Los tipos de automóviles estarán identificados por enteros de 1 a M. Hay al menos un auto de cada tipo. El tercer entero es el número de trabajadores W, 2 ≤ W ≤ M. La segunda línea estará conformada por N enteros, donde el i- ésimo entero es el tipo del i- ésimo automóvil en la fila, de izquierda a derecha.",
    "output": "La primera línea de la salida contendrá un entero R, que es el número de rondas en la solución. Las siguientes R líneas describen cada una de las rondas de la 1 a la R. En cada linea, el primer entero es el número de autos C, que son movidos durante esa ronda. Después vendrán 2C enteros, identificando las posiciones en la fila de los automóviles, utilizando los enteros de 1 a N. Los primeros dos describen cómo se movió uno de los autos: El primer entero es la posición del auto antes del inicio de la ronda, y el segundo entero indica la posición del auto después de dicha ronda. Los siguientes dos enteros indican como se movió otro automóvil, y así sucesivamente. Pueden existir diferentes soluciones para estas R líneas, pero tu programa sólo debe imprimir una de ellas.",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 2272
  },
  {
    "title": "IOI 1996 - Procesamiento de Trabajos",
    "url": "https://omegaup.com/arena/problem/Procesamiento-de-Trabajos",
    "history": "< center> ! [ Logo IOI 1996] ( logo96. jpg) < / center> —————–# Procesamiento de TrabajosUna fábrica está manejando una línea de producción. Dicha línea permite ingresar * trabajos* en bruto por el contenedor de entrada, realizar un par de operaciones a los * trabajos* y presentar el resultado final en un contenedor de salida. Hay dos operaciones que deben realizarse para transformar cada * trabajo* en el producto deseado, primero debe realizarse la operación A y después la operación B. Existen un total de a y b máquinas capaces de realizar la operación A y B respectivamente. La figura de abajo ilustra una posible configuración de la línea de producción de la fábrica, funciona de la siguiente manera: Los * trabajos* en bruto son colocados en el contenedor de entrada. Una máquina tipo A toma un * trabajo* del contenedor de entrada, ejecuta la operación A en ese * trabajo* y finalmente lo coloca en el contenedor intermedio. Una maquina tipo B toma un * trabajo* del contenedor intermedio, ejecuta la operación B en el * trabajo* y coloca el resultado en el contenedor de salida. Todas las máquinas pueden trabajar de manera paralela e independientemente una de las otras, sin embargo, las máquinas tienen distinto rendimiento, de manera que a cada máquina le toma un determinado tiempo procesar un * trabajo* . < center> ! [ Línea de Producción] ( produccion. png) < / center> Dados N * trabajos* en bruto ( disponibles desde el tiempo 0) y el tiempo de procesamiento de cada una de las máquinas, se quiere saber cual será el mínimo tiempo necesario para realizar únicamente la operación A en todos los * trabajos* , y también, para realizar ambas operaciones en todos los * trabajos* .",
    "input": "La primer línea de entrada contendrá un entero n, el número de * trabajos* por procesar. En la siguiente línea se encontrará un único entero a, el número de máquinas del tipo A. A continuación habrán a enteros A_ i, representando el tiempo de procesamiento de la i- ésima máquina del tipo A. La entrada seguirá con un entero b, el número de máquinas del tipo B. La siguiente línea contendrá b enteros B_ i, cada uno representando el tiempo de procesamiento de la i- ésima máquina del tipo B.",
    "output": "Imprime a la salida dos líneas con un entero cada una: el tiempo mínimo requerido para realizar únicamente la operación A y en la siguiente el tiempo mínimo para realizar ambas operaciones. | | input521 133 1 4| | output35| | end# Límites* 1 ≤ a, b ≤ 100, 000* 1 ≤ N ≤ 1, 000, 000* 1 ≤ A_ i, B_ i ≤ 1, 000",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 2242
  },
  {
    "title": "IOI 2008 - Impresora de Tipos",
    "url": "https://omegaup.com/arena/problem/Impresora-Tipos",
    "history": "< center> ! [ Logo IOI 2008] ( logo08. jpg) < / center> —————–# Impresora de TiposNecesitas imprimir N palabras en una impresora de tipos móviles. Las impresoras de tipos móviles son esas viejas impresoras en las que se necesita colocar pequeñas piezas de metal ( cada una con una sola letra) de manera que se formen palabras. Una pieza de papel es entonces presionada contra las piezas para imprimir la palabra. La impresora con la que cuentas permite realizar cualquiera de las siguientes operaciones: * Agregar una letra al final de la palabra colocada en la impresora. * Quitar la última letra del final de la palabra que está actualmente en la impresora. Solo es posible realizar esta operación si existe al menos una pieza metálica colocada en la impresora. * Imprimir la palabra que se encuentre actualmente en la impresora. Inicialmente la impresora está vacia; no contiene ninguna pieza de metal. Al final de la impresión, es posible dejar algunas letras en la impresora. Además, puedes imprimir las palabras en el orden que tu quieras. Como cada operación cuesta tiempo, quieres minimizar el número total de operaciones que realizas. Dadas las N palabras que deseas imprimir, encuentra el mínimo número de operaciones necesarias para imprimir todas las palabras en cualquier orden e imprime cualquier secuencia mínima para lograrlo.",
    "input": "Tu programa debe leer de entrada estándar la siguiente información: * La primer línea contiene un entero N, el número de palabras que quieres imprimir. * Cada una de las siguientes N líneas contiene una palabra. Cada palabra consiste en únicamente letras minúsculas de la a a la z y tiene una longitud entre 1 y 20 caracteres. Todas las palabras serán distintas.",
    "output": "Tu programa debe escribir en salida estándar la siguiente información: * La primer línea debe contener un entero M, el mínimo número de operaciones requeridas. * Cada una de las siguientes M debe contener un caracter. Los caracteres describen la secuencia de operaciones realizadas. Cada operación se describe a continuación: * Agregar una letra está representado por el caracter de la misma letra agregada. * Imprimir la palabra actual está representado por el caracter ` ' P' ` ( mayúscula) . * Quitar la última letra está representado por el caracter ` ' - ' ` ( menos) . | | input3printthepoem| | output20theP—poemP—rintP| | end# Límites# Subtarea 1 [ 40 puntos] 1 ≤ N ≤ 18# Subtarea 2 [ 60 puntos] 1 ≤ N ≤ 25, 000",
    "note": "",
    "topics": [
      "string suffix structures",
      "data structures",
      "strings",
      "greedy"
    ],
    "id": 2121
  },
  {
    "title": "Help Cupid",
    "url": "https://omegaup.com/arena/problem/Help-Cupid",
    "history": "Cupid’s job is getting harder, so he is adopting new technologies to help himwith his difficult task of matching people into happy couples. He appointed thebest programmers in his staff to a new project called Advanced Couples Matching( ACM) . For this project, the programmers need to produce an algorithm thattakes a set of an even number of N lonely persons and matches them into N/ 2couples, such that each person is in exactly one couple. Sadly, the data available about each person is limited. In this modern world, using gender, ethnicity, age or nationality as criteria to form couples is nota sensible option, so the programmers can only use data about the internetconnection of each candidate. They decided to focus this stage on time zones. People living in closer time zones are more likely to find time to interactwith each other. Thus, the programmers decided to create couples so as tominimize the _ total time difference_ . Each time zone is identified by an integer between - 11 and 12, inclusive, representing its difference in hours from a particular time zone calledCoordinated Universal Time ( or UTC) . The time difference of two people livingin time zones represented by integers i and j is the minimum between | i −j| and 24 - | i - j| . Given a partition of a set of an even number N ofcandidates into N/ 2 couples, its total time difference is the sum of the timedifference of each couple. You are asked to write a program that receives as input the time zones of a setof N candidates. The output of the program must be the minimum total timedifference among all possible partitions of the set into couples.",
    "input": "The first line contains an even integer N ( 2 ≤ N ≤ 1000) representingthe number of candidates to be coupled. The second line contains N integersT_ 1, T_ 2, . . . , T_ N ( - 11 ≤ T_ i ≤ 12 for i = 1, 2, . . . , N) indicating the time zones of the candidates.",
    "output": "Output a line with an integer representing the minimum total time differenceamong all possible partitions of the set of candidates into couples. # Examples| | input6- 3 - 10 - 5 11 4 4| | output5| | input2- 6 6| | output12| | input80 0 0 0 0 0 0 0| | output0| | end",
    "note": "",
    "topics": [
      "sortings",
      "greedy"
    ],
    "id": 2065
  },
  {
    "title": "Jardinera",
    "url": "https://omegaup.com/arena/problem/A-Jardinera",
    "history": "A Natalia le piden que debe regar una jardinera en un espacio unidimensional, de un experimento muy importante en el cual el objetivo es obtener el mayor número de islas, veamos el siguiente ejemplo; tenemos una jardinera con 4 valores positivos 5, 6, 2 y 4 cada valor representa la altura de la tierra. Para considerar una isla debe tener altura > 0. ! [ Ejemplo de una jardinera] ( jardin. jpg) En donde al momento de regar el agua tendríamos lo siguiente: Para una altura del agua con valor de cero, obtenemos una isla ( toda la jardinera) Para una altura del agua con valor de 1. 5, obtenemos una islaPara una altura del agua con valor de 2. 5, obtenemos dos islasPara una altura del agua con valor de 4. 5, obtenemos sólo una isla ya que todo la demás tierra queda abajo del agua. Para una altura del agua de 6. 5 obtenemos cero islas ya que todo queda cubierto por el agua. ProblemaConstruye un programa que ayude a Natalia saber cual es la mayor cantidad de islas que ella puede obtener.",
    "input": "Tu programa deberá leer de la entrada estandard lo siguiente, en la primera línea el número “N” donde N< = 1, 000, 000, indicando la cantidad de valores consecutivos de tierra que tiene la jardinera. Las siguientes “N” líneas contendrá cada una un valor entero que representa la secuencia de alturas de la tierra ( a0, a1, a2, . . aN) . todos estos valores son mayor o igual a cero y menores que 1, 073, 741, 824. # Ejemplos| | input45624| | output2| | input75613298| | output3| | end",
    "output": "",
    "note": "",
    "topics": [
      "implementation",
      "greedy"
    ],
    "id": 2004
  },
  {
    "title": "IOI 1996 - Ordenando una Secuencia de Tres Valores",
    "url": "https://omegaup.com/arena/problem/Ordenando-Sec-Tres-Val",
    "history": "< center> ! [ Logo IOI 1996] [ 1] < / center> —————–# Ordenando una Secuencia de Tres ValoresOrdenar es una de las tareas más frecuentes en la computación. Considera el siguiente problema especial de ordenamiento, donde los elementos a ordenar solo tienen tres valores diferentes. Esta situación se presenta, por ejemplo, cuando se quiere ordenar los medallistas de una competencia de acuerdo al valor de su medalla, esto es, los medallistas de oro van primero, seguidos de los medallistas de plata y finalmente vienen los ganadores de medalla de bronce. En esta tarea los posibles valores de una secuencia son los enteros 1, 2 y 3. Se requiere ordenar de menor a mayor. Para ordenar la secuencia es necesario realizar operaciones de intercambio. Una operación de intercambio se define como, dados dos números p y q, intercambiar los elementos de la secuencia S_ p y S_ q. Dada una secuencia de n valores ( 1 ≤ n ≤ 200, 000) , calcula el mínimo número de operaciones de intercambio necesarias para ordenarla. Para hacer esta tarea un poco más difícil, también es necesario que imprimas una serie válida de operaciones de intercambio para lograr el ordenamiento. Cualquier serie de operaciones que ordene la secuencia será considerada correcta.",
    "input": "La primer línea de entrada contendrá un entero n. La siguiente línea contendrá n enteros. El i- ésimo entero representa el valor de S_ i.",
    "output": "Imprime en la primer línea k, el mínimo número de operaciones necesarias para ordenar la secuencia. En la siguientes k líneas imprime dos enteros p_ i y q_ i ( 1 ≤ p_ i, q_ i ≤ n) . La i- ésima línea representa los índices p_ i y q_ i que se intercambiarán en la i- ésima operación. | | input92 2 1 3 3 3 2 3 1| | output43 27 59 44 1| | end[ 1] : f796bd3baeef40024a6f5c2a745104dea0340acc. jpeg",
    "note": "",
    "topics": [
      "greedy",
      "implementation"
    ],
    "id": 1757
  },
  {
    "title": "Chocolate",
    "url": "https://omegaup.com/arena/problem/chocolate",
    "history": "Supongamos que tenemos una barra de chocolate de * m* x * n* piezas cuadradas de 1x1( es una suposición, por lo tanto no puedes comertela) y debes partirla en cuadrados de 1 x 1. Las partes del chocolate pueden ser cortadas a través de cortes horizontales y/ o verticales como se muestra en la figura. Un corte( ya sea horizontal o vertical) de un pedazo del chocolate siempre divide ese pedazo en dos pedazos mas pequeños. Como todo cuesta en esta vida, cada corte que realizes en el chocolate también tendrá un costo, dicho costo se puede expresar como un número entero positivo. Este costo no depende del tamaño del pedazo que se corte, sino que depende de la recta horizontal o vertical por la cual se esté cortando. Denotaremos los costos de cortar por cada recta vertical como * x* < sub> 1< / sub> , * x* < sub> 2< / sub> , * x* < sub> 3< / sub> , . . . , * x* < sub> * m- 1* < / sub> y los costos de cortar por cada recta horizontal como * y* < sub> 1< / sub> , * y* < sub> 2< / sub> , * y* < sub> 3< / sub> , . . . , * y* < sub> * n- 1* < / sub> . El costo de cortar la barra entera es la suma de los costos de todos los cortes requeridos. ! [ ] ( choc. jpg) Por ejemplo, si cortamos el chocolate a lo largo de las rectas horizontales y después cada pedazo obtenido lo cortamos a lo largo de las rectas verticales, el costo total por cortar la barra será * y* < sub> 1< / sub> + * y* < sub> 2< / sub> + * y* < sub> 3< / sub> + 4( * x* < sub> 1< / sub> + * x* < sub> 2< / sub> + * x* < sub> 3< / sub> + * x* < sub> 4< / sub> + * x* < sub> 5< / sub> ) . # ProblemaEscribe un programa que dado el tamaño de la barra de chocolate, determine el costo mínimo para cortarla en cuadrados de 1x1.",
    "input": "Línea 1: Dos enteros positivos * m* y * n* separados por un espacioSiguientes * m* - 1 líneas: Los valores de * x< sub> 1< / sub> , x< sub> 2< / sub> , x< sub> 3< / sub> , . . . , x* < sub> * m- 1* < / sub> Siguientes * n* - 1 líneas: Los valores de * y< sub> 1< / sub> , y< sub> 2< / sub> , y< sub> 3< / sub> , . . . , y* < sub> * n- 1* < / sub> * * Ejemplo: * * 6 421314412",
    "output": "Línea 1: Un solo número entero: el costo mínimo de cortar todo el chocolate en cuadrados de 1x1* * Ejemplo: * * 42# Límites* 2 ≤ * m* * * n* ≤ 1000* Ninguno de los costos superará a 1000",
    "note": "",
    "topics": [
      "greedy",
      "number theory"
    ],
    "id": 1435
  },
  {
    "title": "IOI 1996 - Red de Escuelas",
    "url": "https://omegaup.com/arena/problem/Red-de-Escuelas",
    "history": "< center> ! [ Logo IOI 1996] [ 1] < / center> —————–# Red de EscuelasAlgunas escuelas están conectadas en una gran red de computadoras con el propósito de compartir software educativo a todas ellas. Se han hecho algunos convenios entre las escuelas dentro de la red: cada escuela mantiene una lista de contactos con la que distribuye software. Nota que si la escuela x tiene a la escuela y en su lista de contactos, no es necesario que la escuela y tenga a x en su lista. * * * Subtarea a* * * : Encuentra el mínimo número de escuelas a las que le tienes que entregar un software para que dicho software sea distribuido a todas las escuelas dentro de la red. * * * Subtarea b* * * : Se quiere asegurar que, entregando un solo software a cualquier escuela en la red, sea posible distribuirlo a todas las otras escuelas. Calcula el mínimo número de extensiones que se tienen que hacer para garantizarlo. Una extensión se define como agregar un nuevo miembro en la lista de contactos de una escuela.",
    "input": "La primera línea de entrada contendrá un entero n: el número de escuelas en la red ( 1 ≤ n ≤ 10^ 6) . Las escuelas están numeradas del 1 al n. Cada una de las siguientes n líneas describe la lista de contactos de la i- ésima escuela. La línea número i contendrá los números de los contactos de la escuela i. La lista siempre termina con un número 0. Se asegura que en el número total de contactos en todas las listas no excede 10^ 6.",
    "output": "Dos líneas con un entero cada una, la respuesta a la subtarea a y b respectivamente. | | input52 4 3 04 5 0001 0| | output12| | end[ 1] : f796bd3baeef40024a6f5c2a745104dea0340acc. jpeg",
    "note": "",
    "topics": [
      "greedy",
      "graphs"
    ],
    "id": 1364
  },
  {
    "title": "Permutación Hermosa",
    "url": "https://omegaup.com/arena/problem/Permutacion-Hermosa",
    "history": "A Loro le encantan las permutaciones. Una permutación de longitud n es una secuencia de n números enteros positivos distintos, ninguno mayor que n. Asumiremos que el valor de mcd( a, b) es el máximo común divisor de a y b. Para Loro, el elemento p_ i de la permutación p_ 1, p_ 2, . . . , p_ n es bueno si mcd( i, p_ i) > 1. Loro considera una permutación hermosa, si tiene exactamente k elementos buenos. Desafortunadamente Loro no conoce ninguna permutación hermosa. Ayúdalo a encontrar al menos una de ellas.",
    "input": "La linea de entrada contiene dos enteros n y k.",
    "output": "En una sola linea imprime cualquier permutación hermosa ó - 1, si no existe ninguna.",
    "note": "",
    "topics": [
      "implementation",
      "dfs and similar",
      "math",
      "greedy"
    ],
    "id": 1327
  },
  {
    "title": "Elevator Code",
    "url": "https://omegaup.com/arena/problem/Elevator-Code",
    "history": "# Elevator CodeYou’re playing a really cool video game about an special ferret agent called * Pwnie* . This little friend is trying to gain access to the secret labs of an evil corporation, but you’re stuck on a level where you have to enter a secret code in the panel of an elevator. You actually remember some details about the code, but you have played this game for many hours and its hard to make some memory. The elevator panel shows an arithmetical expression consisting only in number signs ( “# ”) , and add/ subtract operators ( “+ ”/ “- ”) . You know that each number sign must be replaced with a single digit. After a few minutes doing nothing, you remembered the digits you must use in the elevator panel, but you don’t remember the correct order. Before trying like crazy all possible orders, you look for a hint on a video game magazine, there you find a very useful hint: “In order to get the correct code, the result of the expression must be the maximum among all possible results”. Given the expression in the elevator panel and the digits you must use in the code, can you say what is the maximum result that the expression can get? After that, it will be easier to guess the code.",
    "input": "The first line of input contains an integer T ( 1 ≤ T ≤ 100) , the number of test cases. Each of the following T cases starts with an string E, the expression on the elevator panel. The length of the expression will not exceed 500 characters. There will be at most seven consecutive “# ”. On the next line of the case there will be a string D, the digits that you remember the code must use. The length of the string D will be exactly the same as the number of “# ” characters in E. You can safely assume an operator will not be placed after another operator or at the end of the expression.",
    "output": "For each test case in the input, print the maximum result you can get from the expression and the digits given. The maximum result of the expression will fit in a 32- bit signed integer. # Example| | input2# # + # # 1234# # - # # - # # # 3333333| | output73- 333| | end",
    "note": "",
    "topics": [
      "greedy"
    ],
    "id": 1270
  },
  {
    "title": "Cubote",
    "url": "https://omegaup.com/arena/problem/Cubote",
    "history": "Dado un cubo como el que se muestra a continuacion, cada uno con un numero positivo en cada cara. ! [ Entrada] ( 1. jpg) Te dan N^ 3 de esos cubos con los que haces un cubote de N × N × N. El cual pondras en una mesa de tal suerte que solo se ven 5 caras. # ProblemaDados los valores de las caras cual es la suma minima que puede haber en las caras exteriores.",
    "input": "Recibiras un numero N, seguido de 6 numeros, donde el primer número representa el número en la cara A del cubo, el segundo el valor de la cara B, y asi sucesivamente.",
    "output": "Un numero que representa la suma minima de las 5 caras visibles del cubo.",
    "note": "",
    "topics": [
      "greedy",
      "implementation"
    ],
    "id": 777
  },
  {
    "title": "Las cartas de Dr. Lira",
    "url": "https://omegaup.com/arena/problem/CartasDrLira",
    "history": "Dr. Lira has N cards in a row on a table, numbered from left to right from 0 to N- 1. Every card is black on one side and white on the other. The cards on the table may have either side facing up. To activate his weapons arsenal, Dr. Lira needs the cards to have alternating colors, that is, every pair of consecutive cards needs to have different colors face up. Since he' s lazy, Dr. Lira has hired you to find what' s the minimum number of cards he needs to flip so they have alternating colors.",
    "input": "In the first line an integer, N ( 3 ≤ N ≤ 50) , indicating the number of cards Dr. Lira owns. In the second line, a string representing the configuration of the cards. If the i- th character is B, the i- th card has the black side facing up. Similarly, if the i- th character is W, the i- th card has the white side facing up.",
    "output": "The minimum amount of cards that need to be flipped so the cards on the table have alternating colors. # Sample| | input4BBBW| | output1| | descriptionFlipping the second card: ` BWBW` | | input5WBWBW| | output0| | descriptionThere' s no need to flip anything. | | input9WWWWWWWWW| | output4| | descriptionFlipping 4 cards: ` WBWBWBWBW` | | end",
    "note": "",
    "topics": [
      "trees",
      "graphs",
      "implementation",
      "strings",
      "greedy"
    ],
    "id": 237
  },
  {
    "title": "Árboles",
    "url": "https://omegaup.com/arena/problem/OIEG2013SSD",
    "history": "Hace mucho tiempo, el rey Dengklek plantó N árboles, numerados del 0 al N- 1, a lo largo del camino principal del Reino de los Patos. Al pasar el tiempo, los árboles crecieron. Ahora, la altura del i- ésimo árbol es H_ i unidades. El rey Dengklek cree que el camino se vería mejor si las alturas de los árboles fueran estrictamente crecientes. Mas específicamente, en la configuración deseada, la altura del i- ésimo árbol debe ser estrictamente mas pequeña que la altura del ( i+ 1) - ésimo árbol, para todos los posibles valores de i. Para lograrlo, el rey Dengklek usará sus poderes mágicos. Si relaiza un hechizo de nivel X, puede aumentar o disminuir la altura de cada árbol en a lo mas X unidades. El rey no puede disminuir la altura de ningún arbol a menos de 1 unidad. Además la nueva altura del árbol debe seguir siedo un número entero de unidades. Calcula el mínimo entero no negativo X tal que el rey Dengklek puede conseguir su objetivo mediante un hechizo de nivel X.",
    "input": "En la primera linea el número N de árboles. En la segunda linea, una lista de N números separados por espacios que representan las alturas de los árboles.",
    "output": "En la primera linea, el mínimo entero no negativo X tal que el rey Dengklek puede conseguir su objetivo mediante un hechizo de nivel X.",
    "note": "",
    "topics": [
      "greedy",
      "binary search"
    ],
    "id": 194
  },
  {
    "title": "Metro",
    "url": "https://omegaup.com/arena/problem/metro",
    "history": "En el mushroom kingdom desean crear una red de líneas de tren subterráneo que conecte todo el reino. El mushroom kingdom cuenta con 3< = n< = 30000 estaciones numeradas de 1 a n, las cuales deben conectarse con vías. Para ello, se han realizado estudios que permitieron calcular cuál sería el costo 1< = c< = 1000 de conectar la estación i con la estación j ( 1< = i, j< = n, i distinto de j) para 2< = m< = 200000 pares de estaciones i, j. Como se quiere hacer un uso eficiente de los recursos, te han encomendado la creación de un programa que determine cuál es el costo mínimo de unir todas las estaciones, es decir, cuál es el menor costo posible para construir vías que permitan llegar desde cualquier estación a cualquier otra. Debes tomar en cuenta las siguientes consideraciones: 1. Siempre será posible conectar todas las estaciones con los pares i, j dados en la entrada. 2. Si el par i, j aparece en la entrada, no aparecerá el par j, i ni habrá repeticiones.",
    "input": "La primera línea de la entrada tendrá 2 enteros n y m, el número de estaciones y el número de posibles tramos a construir. Las siguientes m líneas contendrán la descripción de un posible tramo con 3 enteros i, j y c, donde i y j son las estaciones a conectarse y c es el costo que tendría su construcción.",
    "output": "Un único número, el menor costo resultante de conectar todas las estaciones. # Ejemplos| | input4 51 2 12 3 12 4 13 4 24 1 2| | output3| | descriptionLas vías construidas serían las que conectan los pares ( 1, 2) , ( 2, 3) y ( 2, 4) , que suman un costo de 3| | input6 82 5 63 6 33 1 406 4 21 4 12 6 72 1 202 4 20| | output19| | descriptionLas vías construidas serían las que conectan los pares ( 2, 5) , ( 3, 6) , ( 6, 4) , ( 1, 4) y ( 2, 6) que suman un costo de 19| | end# Límites* 3< = n< = 30000* 2< = m< = 200000",
    "note": "",
    "topics": [
      "graphs",
      "greedy",
      "dsu",
      "sortings"
    ],
    "id": 169
  }
]