[
  {
    "title": "Algoritmo Euclides con restas",
    "url": "https://omegaup.com/arena/problem/Algoritmo-Euclides-con-restas",
    "history": "Para calcular el máximo común divisor de dos números enteros se puede aplicar el algoritmo de Euclides, consiste en ir restando el número más pequeño del número más grande hasta que queden dos números iguales, que serán el máximo común divisor de los dos números. ———-",
    "input": "Dos números enteros positivos menores que un millón, uno en cada renglón. ———-",
    "output": "Un número entero que es el máximo común divisor de los dos números proporcionados. ———- # Ejemplos| | input4860| | output12| | description60 - 48 = 1248 - 12 = 3636 - 12 = 2424 - 12 = 1212 - 12 = 0 fin de algoritmoEl M. C. D. es 12| | input412184| | output4| | description| | input98734| | output1| | description| | end———- # Límites0 ≤ ( n_ 1, n_ 2 ) ≤ 999999",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 16328
  },
  {
    "title": "Area cuadrado",
    "url": "https://omegaup.com/arena/problem/Area-cuadrado-diagonal",
    "history": "Se te dará la diagonal de un cuadrado, tu tarea será sacar el área Del cuadrado.",
    "input": "Un entero que indica el tamaño de la diagonal.",
    "output": "El área del cuadrado indicada en * * cm2* * .",
    "note": "",
    "topics": [
      "number theory",
      "math"
    ],
    "id": 15947
  },
  {
    "title": "Primos hasta N",
    "url": "https://omegaup.com/arena/problem/Primos-hasta-N",
    "history": "Tu profesor de matemáticas, te a dejado de tarea investigar los números primos hasta * * N* * como eres muy flojo. Decidiste hacer un código que lo haga por ti.",
    "input": "Un único entero * * N* * .",
    "output": "La cantidad de números primos hasta * * N* * .",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15946
  },
  {
    "title": "Pirámide de tareas",
    "url": "https://omegaup.com/arena/problem/Piramide-de-tareas",
    "history": "Jorge va a empezar a hacer sus tareas, pero las tiene apiladas en forma de pirámide, por lo que no puede hacerlas en cualquier orden. Para que Jorge pueda completar todas sus tareas, tiene que empezar por la que está en la cima de la pirámide y cuando termine esa tarea, puede continuar con cualquiera de las dos tareas que han quedado descubiertas, y así sucesivamente. Cada vez que se completa una tarea, siempre quedan dos nuevas tareas descubiertas para el siguiente minuto ( a menos que haya llegado a la base de la pirámide) . Al principio, la pirámide se encuentra de esta manera, ya que solo la tarea de la cima está disponible para hacer: ! [ Pirámide de tareas inicio] [ 2] Las tareas en verde son las que Jorge ya completó, las tareas en naranja son las tareas que Jorge ya tiene disponibles para hacer y las tareas en rojo son las tareas inaccesibles para Jorge. La pirámide de tareas en algún momento puede verse así: ! [ Pirámide de tareas] [ 1] Afortunadamente o desafortunadamente ( según sea el caso) Jorge puede hacer máximo p tareas en un minuto y la pirámide está conformada por h niveles. Ayuda a Jorge a calcular la mínima cantidad de minutos que necesita para completar todas sus tareas.",
    "input": "Dos enteros h y p separados por un espacio.",
    "output": "Un entero indicando la cantidad mínima de minutos que necesita Jorge para terminar todas sus tareas.",
    "note": "",
    "topics": [
      "trees",
      "graphs",
      "number theory",
      "implementation"
    ],
    "id": 15743
  },
  {
    "title": "Banderas del orgullo LGBTQ+",
    "url": "https://omegaup.com/arena/problem/Banderas-del-orgullo-LGBTQ",
    "history": "< center> ! [ ] ( fig. jpg) < / center> Los organizadores del desfile del orgullo LGBTQ+ necesitan imprimir banderas para distribuirlas entre los asistentes al desfile. Para esto, cuentan con una máquina con dos componentes configurables: ( 1) Un rodillo giratorio con los C colores de la bandera y ( 2) una banda circular que se puede configurar para colocar M mantas. Al activar la máquina, ésta imprime una franja del color 1 sobre la manta número 1 y luego tanto el rodillo como la banda avanzan imprimiendo una franja del siguiente color sobre la siguiente manta. Tanto el rodillo como la banda avanzan simultáneamente. Cuando el rodillo alcanza el color C, regresa al color 1 y cuando la banda alcanza la manta número M, regresa a la manta número 1. Este proceso se repite exactamente C × M veces. Por ejemplo, supongamos que el número de colores es C= 2 y configuramos la banda para M= 3 mantas. En cada movimiento, el rodillo alternará los dos colores. En el primer ciclo de la banda, las mantas tendrán los colores 1, 2, 1. Luego, el rodillo comenzará con el color 2 sobre la banda 1, así que al final del siguiente ciclo, cada manta tendrá una franja de cada uno de los dos colores. Si la máquina no se configura correctamente, es posible que las mantas no contengan todos los colores. Por ejemplo, en el caso anterior, si en lugar de configurar la banda para 3 mantas la configuramos para 4 mantas, entonces, al final del primer ciclo las mantas tendrán los colores 1, 2, 1, 2, y luego el rodillo regresará al color 1 sobre la manta 1, volviendo a imprimir el mismo color en cada manta. Los organizadores del desfile necesitan imprimir al menos N banderas, cada una con todos los C colores. Ayuda a los organizadores a encontrar el mínimo número de mantas M con las que deben configurar la máquina para asegurar que cada manta tendrá todos los C colores de la bandera del orgullo LGBTQ+ .",
    "input": "En la primera línea, dos enteros C, N separados por un espacio, indicando el número de colores de la bandera y el mínimo número de banderas que necesitamos imprimir.",
    "output": "En la primera línea, el mínimo número M, donde M > = N de mantas con las que debemos configurar la máquina para obtener al menos N banderas todas con los C colores.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15476
  },
  {
    "title": "Calculando Función",
    "url": "https://omegaup.com/arena/problem/calcfunction",
    "history": "Para cada entero positivo n definamos una función f: f( n) = - 1+ 2- 3. . + ( - 1) ^ nnTu trabajo será calcular f( n) para un entero n.",
    "input": "Una sola línea que contiene el entero positivo n.",
    "output": "Imprime f( n) en una sola línea. | | input4| | output2| | descriptionf( 4) = - 1+ 2- 3+ 4= 2| | input5| | output- 3| | descriptionf( 5) = - 1+ 2- 3+ 4- 5= - 3| | end# Límites* 1≤ n ≤ 10^ 15",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 15456
  },
  {
    "title": "Canicas aleatorias",
    "url": "https://omegaup.com/arena/problem/Canicas-aleatorias",
    "history": "Canicas aleatorias es un juego de mesa para dos jugadores que consiste en un tablero circular con N casillas numeradas del 1 al N y C canicas. Antes de iniciar el juego, los jugadores eligen un número k al azar y colocan las canicas, también al azar, sobre las casillas del tablero ( cada casilla puede tener cero o más canicas) . Luego el juego comienza: el primer jugador elige una casilla inicial A y recolecta todas las canicas de esa casilla, luego avanza k casillas en el sentido de las manecillas del reloj y recolecta todas las canicas de esa casilla y así sucesivamente hasta que regrese a su casilla original A. Luego es el turno del segundo jugador y procede de la misma manera eligiendo una casilla inicial B. El juego termina cuando ya no hay más canicas en el tablero. Al final del juego, gana el jugador que tenga la mayor cantidad de canicas. < center> ! [ ] ( img1. jpg) < / center> En la figura se muestra un ejemplo de un tablero de N= 14 casillas y F= 19 canicas. Suponiendo que el número elegido fue k= 4, el primer jugador puede ganar el juego eligiendo, por ejemplo, A= 7 ya que de esa manera visitará las casillas 7, 11, 1, 5, 9, 13, 3, 7, en ese orden, recolectando 10 canicas. Lo mejor que el segundo jugador puede hacer es recolectar las otras 9 canicas eligiendo por ejemplo B= 14, de esa manera visitará las casillas 14, 4, 8, 12, 2, 6, 10, 14. Suponiendo que cada jugador intenta maximizar la cantidad de canicas que puede recolectar ¿cuántas canicas obtendrá cada jugador?",
    "input": "En la primera línea tres enteros positivos N, C y k que indican el número de casillas del tablero, el número de canicas y el número casillas que los jugadores avanzan en cada movimiento, respectivamente. En la segunda línea, C enteros positivos c_ i que indican el número de casilla en la que se encuentra cada canica.",
    "output": "En la primera línea, dos enteros positivos T_ 1, T_ 2 separados por un espacio indicando el total de canicas que obtendrá el primer jugador y el segundo jugador respectivamente, suponiendo que ambos juegan de manera óptima.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15205
  },
  {
    "title": "Entre Conjuntos",
    "url": "https://omegaup.com/arena/problem/Entre-Conjuntos",
    "history": "Dadas dos listas A y B de n y m enteros positivos respectivamente, tu tarea consiste en determinar cuántos enteros positivos k existen tales que: 1. Todos los números de la lista A son factores de k. 2. k es un factor de todos los elementos de la lista B.",
    "input": "- En la primera línea, dos enteros positivos n y m separados por un espacio, que representan la cantidad de elementos de A y B, respectivamente. - En las siguientes n líneas, un elemento de A en cada línea. - En las siguientes m líneas, un elemento de B en cada línea.",
    "output": "Un único entero postivo k que denota la cantidad de enteros que cumplen las condiciones.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15160
  },
  {
    "title": "Multiplos 5 y 7",
    "url": "https://omegaup.com/arena/problem/Multiplos-5-y-7",
    "history": "A Santy le encantan los juegos de cartas, en especial se encuentra viciado a las cartas de Pokémon. Sorprendentemente encontró alguien igual de friki que el a quien le gustan estas cartas. Los pokemones favoritos de Santy son los de tipo fuego y a su amigo le gustan los tipo fantasma. Curiosamente las cartas del tipo fuego son aquellas numeradas con múltiplos del 5; es decir, la 5, 10, 15, . . . y las cartas del tipo fantasma son las numeradas con múltiplos de 7 como 7, 14, 21, . . . . Claramente existen cartas con más de un tipo, por ejemplo, la carta 70 es de tipo fuego y fantasma al mismo tiempo. Actualmente en el juego existe K cartas numeradas del 1 hasta el K. Santy y su amigo se preparan para un torneo de parejas. En el torneo solo se usa un mazo de cartas para ambos jugadores y no se permiten cartas repetidas. Ellos quieren crear un mazo lleno de sus cartas favoritas; ayúdalos a saber cuántas cartas tendrá el mazo final. # ProblemaSe te dará el número de cartas que existen en el juego actualmente, K. Deberás imprimir el tamaño del mazo de las cartas favoritas de Santy y su amigo teniendo en cuenta que a Santy le gustan las cartas que son múltiplos de 5 y a su amigo aquellas que son múltiplos de 7.",
    "input": "Un entero k que representa el número de cartas que existen en el juego.",
    "output": "La cantidad de cartas que tendrá el mazo compuesto de las cartas favoritas de ambos.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15084
  },
  {
    "title": "Helados de agua y de leche",
    "url": "https://omegaup.com/arena/problem/Helados-de-agua-y-de-leche",
    "history": "A Maria Antonieta le encantan los helados. Este domingo, su papá le dió un billete de N pesos para gastar y le dijo: “Chilindrinita, ” - así le dice de cariño su papá - “ cómprate lo que quieras y me traes el cambio. ” Ella salió corriendo a la heladería más cercana, donde venden dos tipos de helados: de agua y de leche. Los de agua cuestan A pesos y los de leche cuestan B pesos. Ahora, la ingeniosa María Antonieta se pregunta si existirá alguna manera de gastarse absolutamente todo su dinero en helados.",
    "input": "En la primera línea, tres números N, A y B separados por espacio que indican el valor del billete de María Antonieta y el precio de los helados de agua y de leche, respectivamente.",
    "output": "En la primera línea, la palabra “SI” si es posible gastar todos los N pesos en helados, y la palabra “NO” si no es posible.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15069
  },
  {
    "title": "Minimo Común Divisor",
    "url": "https://omegaup.com/arena/problem/Minimo-Comun-Divisor",
    "history": "El < b> mínimo< / b> común divisor de dos números A, B es el < b> menor< / b> entero positivo que divide a ambos. Escribe un programa que dados dos enteros positivos A, B, imprima su < b> mínimo< / b> común divisor.",
    "input": "En la primera línea, dos enteros positivos A, B, separados por espacio.",
    "output": "En la primera línea, el < b> mínimo< / b> común divisor de A y B.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15067
  },
  {
    "title": "Muchas piñatas",
    "url": "https://omegaup.com/arena/problem/Muchas-pinatas",
    "history": "La mamá de Federico ( “Kiko”, para sus amigos) le organizó una fiesta de cumpleaños con muchas piñatas ( ¡el número de piñatas es igual al número de niños en la fiesta! ) , cada una de las cuales se rompe al darle exactamente G golpes. Durante la fiesta, a Federico se le ocurrió formar una fila para turnarse a pegarle a las piñatas ( el primer niño de la fila ocupa la posición 1, el segundo la posición 2, y así sucesivamente) . En cada turno, cada niño le puede pegar a la piñata una sola vez y luego se vuelve a formar al final de la fila. Todos los N niños quieren ser quien rompa la piñata porque entonces estarán ubicados en la mejor posición para recoger los dulces. Al ver la posición K de Kiko en la fila, su mamá se preocupó: ¿habrá suficientes piñatas para que \" su Tesoro\" rompa al menos una?",
    "input": "En la primera línea, tres enteros separados por espacio: el número N de niños en la fiesta ( igual al número de piñatas) , la cantidad G de golpes que requiere cada piñata para romperse y la posición K de Kiko en la fila.",
    "output": "En la primera línea, la palabra “SI” si Kiko romperá al menos una piñata y la palabra “NO” si Kiko no romperá ninguna piñata.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15066
  },
  {
    "title": "Carretera recta",
    "url": "https://omegaup.com/arena/problem/Carretera-recta",
    "history": "El gobierno de Plaquetaque quiere construir una carretera que conecte sus muchas ciudades. Las ciudades están representadas como puntos con valores x y y. Esta carretera será perfecta, por lo cual no tendrá ni una sola imperfección, ¡Como por ejemplo tener curvas! Así es, la carretera será completamente recta, desde su comienzo hasta el fin. Esto por supuesto implica que muy probablemente no será posible conectar todas las ciudades con la misma carretera. Ayuda a los ingenieros a saber cual se la máxima cantidad de ciudades que pueden ser conectadas con esta nueva carretera.",
    "input": "En la primer línea un entero 2 ≤ n ≤ 1000 la cantidad de ciudades en Plaquetaque. Las siguientes n líneas contienen cada una un par de enteros - 100 ≤ x_ i, y_ i ≤ 100 las coordenadas de la i- ésima ciudad. Está garantizado que en cada punto solo puede existir una sola ciudad, es decir, cada par dado será único.",
    "output": "Imprime un solo entero, la máxima cantidad de ciudades que es posible conectar con una carretera recta.",
    "note": "",
    "topics": [
      "geometry",
      "number theory"
    ],
    "id": 14759
  },
  {
    "title": "Mismos Divisores",
    "url": "https://omegaup.com/arena/problem/Mismos-Divisores",
    "history": "Dado un tablero de 1× n, Edit desea escribir en cada una de las casillas un número entre 1 y n ( inclusive) , de modo que se satisfagan las siguientes condiciones: - Cada número mayor igual a 1 y menor igual a n debe aparecer exactamente 1 vez en el tablero. - Para cada posición 1 ≤ k ≤ n, el número escrito en la k- ésima casilla y k deben tener la misma cantidad de divisores positivos. Formalmente, si los números escritos en el tablero son x_ 1, x_ 2, . . . , x_ n en ese orden, entonces para cada 1 ≤ k ≤ n, el número de divisores positivos de x_ k y el número de divisores positivos de k es el mismo. Pablo, por su lado, ha decidido escribir m números en algunas de las casillas, sin necesariamente respetar las reglas indicadas anteriormente a fin de complicar la tarea. En este problema, recibirá en la primera línea los valores de n y m y luego m líneas, cada una con 2 enteros i, j indicando que Pablo escribió el número j en la posición i. Está garantizado que no hay 2 de las m líneas representando la entrada de Pablo con el mismo valor de i, pero sí es posible que haya 2 líneas con el mismo valor de j. Su objetivo es determinar de cuántas maneras Edit puede escribir los números en las casillas vacías ( dejadas por Pablo) de modo que se satisfagan las 2 condiciones que deseaba inicialmente. Debido a que la respuesta puede ser un número muy grande, retorne el residuo de la respuesta al efectuar la división por 10^ 9 + 7 ( es decir, el residuo módulo 10^ 9 + 7) .",
    "input": "La primera línea de entrada contiene 2 enteros n y m, denotando la longitud del tablero y la cantidad de casillas ya rellenadas. Luego, siguen m líneas, la t- ésima contiene 2 enteros i_ t, j_ t separados por un espacio, denotando que el tablero tiene escrito el número j_ t en la casilla i_ t. Está garantizado que no hay 2 valores iguales de i_ t, pero sí es posible tener dos valores iguales de j_ t.",
    "output": "La cantidad de maneras diferentes de escribir números en las casillas restantes de modo que se satisfagan las condiciones mencionadas arriba, módulo 10^ 9+ 7.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14660
  },
  {
    "title": "Online Mashing International",
    "url": "https://omegaup.com/arena/problem/Online-Mashing-International",
    "history": "Ludwig es el encargado de organizar las fases de eliminación del torneo de Smash Bros más grande del año, Online Mashing International ( OMI) . Los organizadores le pidieron que haga las eliminaciones de la siguiente manera: 1. De las personas que sigan en el torneo, escoge a 2^ n personas de forma aleatoria y has un sub- torneo. Un sub- torneo es una llave de eliminación donde 2^ n- 1 personas son eliminadas y una persona puede seguir jugando. 2. Repite el proceso hasta que solo quede un jugador, el ganador del torneo. Ayuda a Ludwig a encontrar la menor cantidad de sub- torneos que tiene que hacer para poder declarar al ganador del OMI.",
    "input": "N, la cantidad de jugadores inscritos al torneo.",
    "output": "La menor cantidad de sub- torneos que tiene que hacer para poder declarar al ganador del OMI.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14652
  },
  {
    "title": "ANIEI 2021 - B",
    "url": "https://omegaup.com/arena/problem/ANIEI-2021---B",
    "history": "El profesor Moralov tiene una obsesión por los números primeros ( los números naturales mayores que 1 que no tienen divisores propios mayores que 1) . Además, como es profesor de computación y de programación, también está acostumbrado a trabajar con nímeros binarios. Como el profesor piensa que encontrar números primos en un intervalo es fácil y fastidioso, se le ha ocurrido un nuevo reto. El profesor tiene interés en conocer cuántas cadenas binarias de longitud K tienen una cantidad prima de ceros y una cantidad prima de unos. Por ejemplo, si K = 10 entonces el profesor está interesado en las cadenas con 3 ceros y 7 unos, con 7 ceros y 3 unos, y con 5 ceros y 5 unos. Más aún ( y para volver el reto más interesante) , el profesor Moralov desea calcular la cantidad total de estas cadenas si K puede estar entre X y Y inclusivo.",
    "input": "La primera línea contiene un entero Q que es el número de casos de prueba. Las siguientes Q líneas contienen dos enteros X y Y separados por un espacio.",
    "output": "Para cada caso de prueba, debes imprimir la cantidad total de cadenas que cumplen las propiedades mencionadas. Como dicho valor puede ser muy grande, debes imprimirlo módulo 1000000007.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14234
  },
  {
    "title": "Manteniendo Distancias",
    "url": "https://omegaup.com/arena/problem/Manteniendo-Distancias",
    "history": "The past year has been difficult, with a virus spreading among the population. Fortunately, Alice knows that one of the keys to be healthy is to keep a safe distance from other people. Alice is currently in a closed room, represented in the 2D plane, with width X and height Y. There are N other people inside the room, and we' re given their ( x_ i, y_ i) coordinates. We consider Alice and the N people as points in the 2D plane. Alice' s initial position is ( 0, 0) and she wants to move to the exit at position ( X, Y) . She can move freely in any direction inside the room, but can not step outside the room bounds. Find the maximum distance Alice can keep from other people while moving from ( 0, 0) to ( X, Y) .",
    "input": "The input begins with one line containing two space- separatedintegers, X and Y, where X is the width, and Y is the heightof the room. The second line consists of a single integer N, thenumber of people in the room. Then N lines follow, each of themconsisting of two floating- point numbers x_ i and y_ i, thecoordinates of the i^ th person in the room.",
    "output": "The output consists of a single value d, the maximum safe distance, as a floating- point number. An additive or multiplicative error of 10^ - 5 is tolerated: if d is the answer, any number either within [ d - 10^ - 5; d + 10^ - 5] or within [ ( 1 - 10^ - 5) d ; ( 1 + 10^ - 5) d] is accepted. # # Limits- 1 ≤ X, Y ≤ 1 000 000- 1 ≤ N ≤ 1 000- 0 ≤ x_ i ≤ X- 0 ≤ y_ i ≤ Y# Examples| | input10 1013 3| | output3. 000000| | end| | input10 1017 7| | output3. 000000| | end| | input8 633 13 5. 56. 5 1. 5| | output2. 250000| | end",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14227
  },
  {
    "title": "Missing digit",
    "url": "https://omegaup.com/arena/problem/Missing-digit",
    "history": "El problema consiste en encontrar el dígito faltante entre 1 y n ( 1 ≤ n ≤ 10^ 5)",
    "input": "La entrada consiste de 2 lineas. En la primera linea se dará un número n. En la segunda linea, se darán n- 1 números enteros no repetidos.",
    "output": "El único número entero faltante.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14134
  },
  {
    "title": "Múltiplos Cercanos",
    "url": "https://omegaup.com/arena/problem/Multiplos-Cercanos",
    "history": "A Juan le acaban de enseñar en su clase de Matemáticas que cualquier numero entero N puede ser representado por la multiplicación de otros dos números enteros A y B. Sin embargo él se dio cuenta que no solo hay una manera para representar N como producto de dos numerosPor ejemplo el numero 20= ( 1* 20) , ( 2 * 10) , ( 4 * 5) . Juan sabe que eres buena gente y quiere que le ayudes a saber cual es la manera en la que A * B = N tal que A = ̸ B y A, B> 1 y que a su vez estos dos números sean lo mas cercano posibles entre si.",
    "input": "Un numero entero N",
    "output": "Dos números A y B separados por un espacio * * mostrando primero el más pequeño* * . En caso de no cumplir las condiciones mostrar un - 1",
    "note": "",
    "topics": [
      "implementation",
      "number theory",
      "*special"
    ],
    "id": 13971
  },
  {
    "title": "Irreducible",
    "url": "https://omegaup.com/arena/problem/Irreducible",
    "history": "* * Antonio* * realiza su tarea de matemáticas, que consiste en simplificación de fracciones, por ejemplo: 16/ 64 = 1/ 4 * * Antonio* * no recuerda el procedimiento para realizar dichos ejercicios, sin embargo de su clase de álgebra recuerda que es posible realizar las siguientes cancelaciones de factores en común: a̸· b/ c ·a̸ = b/ c * * Antonio* * confía en que es posible usar un método similar, pero ahora con dígitos similares en las fracciones, por ejemplo para reducir 26/ 65, * * Antonio* * cancelará * * todos* * los pares dígitos que se se encuentren tanto en en el numerador, como en el denominador: 26̸/ 6̸ 5 = 2/ 5 Nota 1: * * Antonio* * solo puede ir reduciendo de par en par de dígitos, por ejemplo para reducir 545/ 654, se tiene: 54̸5̸/ 65̸4̸ = 5/ 6 Nota 2: * * Antonio* * puede elegir dichos dígitos en cualquier orden, por ejemplo: 5̸4̸ 5 / 65̸4̸ = 5/ 6 Nota 3: * * Antonio* * no puede eliminar todos los dígitos del numerador o denominador, ya que esto definitivamente producirá un resultado erróneo, por lo tanto, * * Antonio* * no podría simplificar más, fracciones como las siguientes: 2/ 22 , 1/ 12 Ya que eres buen amigo de * * Antonio* * , decides revisar sus resultados y hacerle notar en caso de que haya cometido errores.",
    "input": "La primer línea contiene un entero T, el número de fracciones a reducir ( simplificar) , a continuación T líneas con dos enteros N, D separados por un espacio, los cuáles indican los valores del numerador y denominador respectivamente. * * Nota 4* * : Se garantiza que N y D no forman una fracción irreducible desde un principio.",
    "output": "T líneas, cada una de ellas contendrá el resultado correcto de la simplificación y una palabra ( SI o NO) indicando si * * Antonio* * obtendrá el mismo resultado utilizando su método.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 13805
  },
  {
    "title": "Números felinos",
    "url": "https://omegaup.com/arena/problem/Numeros-felinos",
    "history": "# HistoriaPusito, el gato de Naty, compró un nuevo teléfono con un nuevo número. Pusito ama estar sucio y los * * números felinos* * . ———- ! [ enter image description here] [ 1] ———- Pusito define a los * * números felinos* * como aquellos de N dígitos tales que al dividirlo en NK segmentos de K dígitos consecutivos, el i- ésimo segmento * * NO* * empieza con el dígito B_ i y ese mismo segmento, al convertirlo en un número entero, es divisible entre el número A_ i. Para esto, Naty le ha dado a Pusito dos arreglos A y B de NK números. Pusito es un pensador destacado, así que se puso a pensar cuántos * * números felinos* * puede formar y te ha pedido ayuda porque son demasiados. # ProblemaDados los enteros N, K y los arreglos A y B, determinar cuántos posibles * * números felinos* * puede formar Pusito.",
    "input": "En la primera línea, los enteros N y K separados por un espacio. En la segunda línea el arreglo A, NK números separados por un espacio. En la tercera línea el arreglo B, NK números separados por un espacio.",
    "output": "Imprime la cantidad de * * números felinos* * módulo 10^ 9 + 7 que Pusito puede formar.",
    "note": "",
    "topics": [
      "math",
      "number theory"
    ],
    "id": 13665
  },
  {
    "title": "Pociones sospechosas",
    "url": "https://omegaup.com/arena/problem/Pociones-sospechosas",
    "history": "Estás jugando un videojuego en el mundo mágico de Magialandia. Has decidido embarcarte en múltiples misiones para así conseguir oro. Para ayudarte a cumplirlas, has comprado varias pociones en una tienda sospechosa en un callejón. Pensándolo bien, decides consultar con un alquimista con experiencia. Usando un hechizo ha descubierto la potencia de cada poción. La potencia es un número entero el cual se obtiene multiplicando la potencia individual de los ingredientes usados en la creación de la poción. Todo ingrediente tiene una potencia mínima de 2. Sabiendo esto, él te advierte que muchas veces le agregan preservadores cancerígenos a las pociones. Como las botellas no tienen etiqueta con una lista de ingredientes, la única forma en la que puedes saber si no contienen ingredientes extra es revisando la potencia. Por ejemplo, una poción con potencia 4 puede haber sido creada por dos ingredientes de potencia 2 cada uno. Pero una poción con potencia 3 solo pudo haber sido creada con un solo ingrediente de potencia 3.",
    "input": "En la primer línea un entero 1≤ n ≤ 1e6, la cantidad de pociones que compraste. En la segunda línea hay n números 2 ≤ a_ i ≤ 1e5 la potencia de la i- ésima poción.",
    "output": "Por cada poción imprimir \" Seguro\" si la poción solo pudo ser creada por un solo ingrediente o \" Inseguro\" si es posible que la poción haya sido creada por 2 o más ingredientes.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 13546
  },
  {
    "title": "Invertir un número",
    "url": "https://omegaup.com/arena/problem/Invertir-numero",
    "history": "Elabora un programa que permita invertir un número de T dígitos, con T> = 2| | input5689| | output9865| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "math",
      "number theory"
    ],
    "id": 13175
  },
  {
    "title": "Concurso de multiplicar",
    "url": "https://omegaup.com/arena/problem/Concurso-de-multiplicar",
    "history": "< br/ > Hoy es el día del galardonado concurso de multiplicación! El concursante del día de hoy es el audaz Hidalgo, lleva preparándose todo el mes para este día, y como buen competidor ya conoce todas las reglas ytemáticas del concurso, sin embargo aun así serán repetidas para los nuevos espectadores! En la pantalla se van a mostrar K números, y se quieren agarrar algunos para multiplicar, bastante sorprendente! Pero al multiplicar números es muy fácil conseguir un número muy grande, o un número muy pequeño, por lo que el reto es tratarde que al multiplicar los números elegidos den exactamente N. Ayuda a Hidalgo a saber si puede formar exactamente N al multiplicar algún conjunto de números de la lista presentada. No es necesario usar todos los números, en la lista de números pueden haber repetidos lo cual hace posible agarrar cierto número de copias mientras estén disponibles, si un número solo aparece una vez no se puede agarrar más de una vez.",
    "input": "< br/ > Dos enteros N, y K, que indica el número que se quiere formar, y cuantos números hay en la lista. < br/ > Seguido habrán K números, que representan la lista de números mostrada en pantalla.",
    "output": "< br/ > Una sola palabra \" SI\" si es posible formar exactamente el número, o \" NO\" si no es posible.",
    "note": "",
    "topics": [
      "dp",
      "number theory"
    ],
    "id": 13172
  },
  {
    "title": "Yu-Gi-Oh!",
    "url": "https://omegaup.com/arena/problem/Yu-Gi-Oh",
    "history": "Jorge se encontraba jugando Yu- Gi- Oh! con sus n cartas cuando de pronto adquirió un poder que le permitía ver el nivel de cada carta en su pila de cartas ( deck) . Las cartas están numeradas de 1 a n desde el fondo hasta la cima de la pila. El deck está representado por un arreglo con las puntuaciones p_ i ( 1 ≤ i ≤ n) de cada carta. La carta con puntuación p_ 1 está en el fondo y la carta con puntuación p_ n está en la cima. Jorge está a punto de revolver su deck, por lo que quiere utilizar este poder para maximizar la fuerza de su deck y vencer a Santy, su malvado oponente. La fuerza del deck se define como: ∑_ i= 1^ n n^ n - i· p_ i Jorge revuelve su deck de la siguiente manera: - Elige un entero k ( 0 < k) . - Toma las primeras k cartas de la cima de su deck y las pone, en el orden en el que están, en la cima de una segunda pila que va a ser su deck revuelto. - Repite el proceso hasta que no queden cartas en su deck original. Por ejemplo, si el deck es 1 2 3 4 5, puede revolverlo de la siguiente manera: - k = 1: se toma la primer carta de la cima del deck original y se ponen en la cima del segundo deck. - Original: 1 2 3 4- Segundo: 5- k = 3: se toman las primeras 3 cartas de la cima del deck original y se ponen en la cima del segundo deck. - Original: 1- Segundo: 5 2 3 4- k = 1: se toma la primer carta de la cima del deck original y se ponen en la cima del segundo deck. - Original: - Segundo: 5 2 3 4 1Jorge sabe que eres un buen programador y quiere ganar a toda costa, por lo que te ha pedido que le ayudes a revolver su deck y calcules la fuerza obtenida. # ProblemaDado un arreglo con las puntuaciones p_ i de las n cartas del deck de Jorge ( desde el fondo hasta la cima) , revuelve el deck y calcula la fuerza obtenida. El puntaje obtenido para cada caso será mayor si tu respuesta se acerca a la fuerza máxima posible, o menor si se aleja de la fuerza máxima posible. Si imprimes la máxima fuerza posible, obtendrás todos los puntos.",
    "input": "En la primera línea un entero n, la cantidad de cartas del deck de Jorge. En la segunda línea, n enteros p_ i, las puntuaciones de cada carta empezando por el fondo y terminando en la cima del deck.",
    "output": "Una línea con un entero indicando la fuerza calculada, módulo 10^ 9 + 7.",
    "note": "",
    "topics": [
      "sortings",
      "implementation",
      "number theory",
      "math",
      "greedy"
    ],
    "id": 13002
  },
  {
    "title": "El problema fácil de Jorge",
    "url": "https://omegaup.com/arena/problem/El-problema-facil-de-Jorge",
    "history": "A Jorge se le acabaron los problemas para los concursos de los sábados, así que decidió buscar en lo más profundo de \" inserte nombre de lugar\" y encontró k problemas. Jorge quiere saber para cuántos concursos le alcanza de tal manera que todos los concursos tengan la misma cantidad entera de problemas y que todos los concursos tengan al menos un problema. # ProblemaDado el entero k, decir de cuántas maneras Jorge podrá asignar la misma cantidad de problemas a los concursos y cuántos problemas tendrá cada concurso de cada configuración.",
    "input": "Un entero k, la cantidad de problemas.",
    "output": "En la primera línea un entero c indicando la cantidad de configuraciones. En la segunda línea c enteros separados por un espacio indicando la cantidad de problemas de cada configuración ( en cualquier orden) .",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 12796
  },
  {
    "title": "Collatz",
    "url": "https://omegaup.com/arena/problem/CollatzFacil2",
    "history": "# La conjetura de CollatzLa conjetura de Collatz consiste en lo siguiente: · Inicia con cualquier entero positivo. · Si es par, divídelo entre 2; si es impar multiplícalo por 3 y agréguele 1. · Obtén enteros sucesivamente repitiendo el proceso. Al final se obtendrá el número 1, independientemente del número entero inicial. Por ejemplo, cuando el entero inicial es 40, la secuencia será: 40 20 10 5 16 8 4 2 1",
    "input": "Un número entero, n.",
    "output": "Secuencia de números correspondiente a la conjetura de Collatz.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12782
  },
  {
    "title": "Sumatoria números enteros",
    "url": "https://omegaup.com/arena/problem/sumatoria-numeros-enteros",
    "history": "# La suma de los primeros n números enteros positivosTienes que elaborar un programa que permita ingresar un número entero positivo n y luego realizar la suma de todos los números comprendidos entre 1 y n. Por ejemplo, cuando el número es 5 , la sumatoria es 1+ 2+ 3+ 4+ 5 = 15",
    "input": "Un número entero, n.",
    "output": "LA sumatoria los los primeros n números enteros positivos.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12778
  },
  {
    "title": "Funciones extrañas",
    "url": "https://omegaup.com/arena/problem/Funciones-extranas",
    "history": "Definamos una función f( x) ( x es un entero positivo) como lo siguiente: escribe todos los dígitos en la representación decimal de x al revés, luego elimina todos los ceros a la izquierda. Por ejemplo, f( 123) = 321, f( 120) = 21, f( 1000000) = 1, f( 111) = 111. Definamos otra función g( x) = xf( f( x) ) ( x es un entero positivo también) . # ProblemaDado un entero positivo n, calcular la cantidad de valores diferentes de g( x) para todos los valores de x tal que 1 ≤ x ≤ n.",
    "input": "Un entero positivo n.",
    "output": "La cantidad de valores diferentes de g( x) si x está en el intervalo [ 1, n] .",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12598
  },
  {
    "title": "Dame pan",
    "url": "https://omegaup.com/arena/problem/Dame-pan",
    "history": "Un panadero ha contratado a Jorge y Elías para que trabajen en su panadería. El panadero les ha encargado que consigan K panes para vender, pero el panadero no tiene dónde colocar sus panes, así que a Elías también le pide que consiga M muebles y a Jorge que construya N espacios en cada mueble. El panadero quiere repartir en partes iguales ( todos deben tener la misma cantidad de panes) los panes en los espacios de cada mueble sin que le sobren ( si sobran se lo quedan Jorge y Elías sin pagar) . El panadero solo acepta los M muebles si puede repartir en partes iguales los panes en los muebles de tal manera que haya al menos 1 pan en cada mueble y que no le sobren panes. El panadero solo acepta los N espacios de cada mueble si puede repartir en partes iguales los panes en los espacios de un mueble de tal manera que haya al menos 1 pan en cada espacio y que no le sobren panes. Elías y Jorge han encontrado un fallo en las condiciones del panadero y verificaron que pueden comerse unos panes gratis.",
    "input": "Dos enteros x y y que representan un intervalo de valores [ x, y] .",
    "output": "En la primera línea los valores para M, N y K ( en ese orden) dentro del intervalo [ x, y] que Jorge y Elías deben elegir para poder comer algunos panecitos gratis. En otra línea la cantidad de panes que comerán Jorge y Elías. Imprime solo un \" - 1\" ( sin las comillas) en caso de que no sea posible.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12592
  },
  {
    "title": "Bloques de LEKO",
    "url": "https://omegaup.com/arena/problem/Bloques-de-LEKO",
    "history": "Elías se aburrió de jugar LOL y decidió comprar bloques de LEKO para construir cosas. Por el frío solo se le ocurrió construir columnas de bloques y las acomodó una tras otra, en fila. Empezó construyendo una columna de 1 bloque, la siguiente ( la de atras) la construyó con 2 bloques, el tercero con 3 bloques, en general, construye una columna con un bloque más que la anterior. Elías sabe pagó por cada bloque 1 MXN, pero no recuerda cuánto pagó en total, ayúdale diciéndole cuánto pagó por todos los bloques en total si construyó N columnas y no le sobraron bloques.",
    "input": "Un entero N, la cantidad de columnas que construyó Elías.",
    "output": "La cantidad de dinero que Elías pagó por los bloques.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12585
  },
  {
    "title": "Watermelon",
    "url": "https://omegaup.com/arena/problem/Watermel",
    "history": "> ! [ Small] [ 1] < kbd> Se actualizarón casos a las 11: 30 AM ( Agosto 10, 2020) < / kbd> > # Descripción> Un caluroso día de verano, Pete y su amigo Billy decidieron comprar una sandía. Eligieron la más grande y madura ( en su opinión) . Después se pesó la sandía y la balanza mostró w kilos. Se apresuraron a casa, muriendo de sed, y decidieron dividir la sandia, sin embargo, enfrentaron un problema difícil. > Pete y Billy son grandes admiradores de los números pares, por eso quieren dividir la sandía de tal manera que cada una de las dos partes pese un número par de kilos, al mismo tiempo no es obligatorio que las partes sean iguales. Los niños están extremadamente cansados ​​y quieren comenzar su comida lo antes posible, por eso debes ayudarlos y averiguar si pueden dividir la sandía de la manera que quieran. Por supuesto, cada uno de ellos debería obtener una parte de peso positivo. —–> # Entrada> La primera ( y única) línea de entrada contiene el número entero w ( 1 ≤ w ≤ 100 ) - el peso de la sandía comprada por los niños. > # Salida> Escriba< kbd> SI< / kbd> , si los niños pueden dividir la sandía en dos partes, cada una de ellas con un * * número par de kilos* * ; y < kbd> NO< / kbd> en el caso contrario. ———# Ejemplo: | | input8| | outputSI| | end———> # Nota: > Por ejemplo, los niños pueden dividir la sandía en dos partes de 2 y 6 kilos respectivamente. ( Otra variante - dos partes de 4 y 4 kilos) .",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "implementation",
      "number theory",
      "math"
    ],
    "id": 11611
  },
  {
    "title": "Collatz y sus amigos",
    "url": "https://omegaup.com/arena/problem/Collatz-y-sus-amigos",
    "history": "Juaritos es un vendedor de manzanas y de la nada llega un mago y este le dice: \" Te voy a hechizar tu puesto de manzanas. Si un cliente llega y ve que tienes un número par de manzanas, este se llevará la mitad. Sin embargo, si este ve que tienes un número impar de manzanas, mágicamente aparecerán el triple de las manzanas más uno. Juaritos preocupado quiere saber cuántos clientes van a llegar hasta que se quede con una manzana. # ProblemaEscribe un programa que reciba como entrada el número de manzanas de Juaritos y que regrese el número de clientes que tuvo hasta que se quedó con una sola.",
    "input": "Un solo entero con el número de manzanas.",
    "output": "Un solo entero con el número de clientes que pasaron.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 11588
  },
  {
    "title": "Sumatoria Básica",
    "url": "https://omegaup.com/arena/problem/Sumatoria-Basica",
    "history": "Dado un numero N imprimir la sumatoria de los numeros del 1 hasta el N. ∑_ i= 1^ N",
    "input": "Un numero entero N.",
    "output": "La suma de los numeros de 1 al N. donde x es la posición donde vas a dejar a tu nave estacionada.",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "number theory"
    ],
    "id": 11352
  },
  {
    "title": "Raiz cubica",
    "url": "https://omegaup.com/arena/problem/Raiz-cubica",
    "history": "# HistoryQuiero un programa que me saque la raiz cubica.",
    "input": "Un numero entero N.",
    "output": "La raiz cubica de N. ( Primeros 10 digitos)",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 11286
  },
  {
    "title": "Superposicion de particulas",
    "url": "https://omegaup.com/arena/problem/Superposicion-de-particulas",
    "history": "< br/ > En el año 3020, la científica Grecia estaba estudiando las propiedades cuánticas de partículas. Dominando el conocimiento de la superposición de estados logró un método para separar los estados de una partícula en cantidades iguales. Sin embargo esta cantidad tiene que tener una cantidad par de estados a su vez para que estos se reasignen como estados y anti- estados logrando mantener un balance. < br/ > Por ejemplo, una partícula con 24 estados de superposición se pueden dividir en 2 grupos de 12 estados, 4 grupos de 6, 3 grupos de 8, 6 grupos de 4, 2 grupos de 12 y un grupo de 24. Sin embargo no se podría dividir en 8 grupos de 3 o en 24 grupos de 1. < br/ > Sin embargo Grecia no sabe exactamente de cuantas formas puede dividir los estados de una partícula, por lo que te está pidiendo ayuda para poder saber rápidamente de cuántas formas diferentes puedes dividir los estados. < br/ >",
    "input": "Un entero N que indica la cantidad de estados de superposición de la partícula.",
    "output": "< br/ > La cantidad de maneras en las que puedes dividir los N estados creando cantidades pares iguales.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 11247
  },
  {
    "title": "Nuevo Poder",
    "url": "https://omegaup.com/arena/problem/Nuevo-Poder",
    "history": "Después de todas las coas que ha pasado nuestro grna super heroe Elías, este a aprendido un nuevo super poder. Es poder actua de forma muy extraña. Primero que nada digamos que hay una cantidad infinita de villanos y esto a su vez estan numerados ( 1, 2, 3, . . . ) . En cierto día, el poder de Elías tiene un parametro de costo k de energía; esto es, que si quiere derrotar al villano i, entonces necesita k * S( i) de energía para derrotarlo. En donde, S( i) es el número de digitos que tiene i; ejemplo, S( 100) = S( 331) = 3. Para un día Elías igual cuenta con un maximo de energía que puede gastar ( W) . Y además a él le gustaría derrotar a una secuencia continua de villanos empezando con el m. Es decir, quiere derrotar a los villanos m, m+ 1, m+ 2, . . . . Ayudale a saber cuanto es el número máximo de villanos que puede derrotar en dicho día. # ProblemaDado los valores k, w, m. Decir cuantos villanos continuos ( m, m+ 1, m+ 2) puede derrotar elías como maximo con la energía maxima dada ( w) y coste con parametro k.",
    "input": "Tres enteros w, m , k descritos anteriormente.",
    "output": "Un unico número representando la cantidad de villanos que elías puede derrotar.",
    "note": "",
    "topics": [
      "number theory",
      "binary search"
    ],
    "id": 11089
  },
  {
    "title": "Tesla y las Constantes Enigmáticas",
    "url": "https://omegaup.com/arena/problem/ConstantesEnigmaticas",
    "history": "> # Descripción> > Hace mucho tiempo Nikola Tesla se encontraba analizando las> propiedades de los numeros 3, 6 y 9. De entre todas ellas> encontro una que le permitia saber si un numero extremadamente> * * grande* * era divisible por 9 de manera relativamente rapida ( Puede que alguien mas ya hubiese descubierto dicha propiedad antes, pero ese> no es el punto de este problema) . Ahora tu como programador quieres> seguir los pasos de Tesla y diseñar un programa que te permita hacer> lo enunciado arriba. > ———- > # Problema> > Tienes la simple y sencilla labor de indicar si un numero n> es divisible por 9, de ser así deberás mostrar la frase> ` Divisibilidad¡, en caso contrario deberás mostrar ` No es multiplo. ` > > Decimos que un numero A es divisible por B, si A mod B = 0. > > “Si supieras la magnificencia de los números> 3, 6, y 9 tendrias la llave del universo. \" > > - Nikola Tesla. ( ? ———- > # Entrada> > En la primera y única linea solo habra un entero n ( 1≤ n ≤ 10^ 38) - el número cuyo valor se quiere evaluar. > > Hint: En C+ + los limites de n no * \" entran\" * siquiera < br> en un < kbd> unsigned long long< / kbd> . < br> > # Salida> > La frase correspondiente dependiendo de el valor que posea n. ———- # Ejemplos: | | input123381| | outputDivisibilidad! | | input277777788888899| | outputNo es multiplo. | | input1184| | outputNo es multiplo. | | end———- > # Consideraciones : > - Cada caracter en la salida cuenta ( Eso incluye el ` . ` y el ` ¡) . > - El evaluador distingue entre mayúsculas y minúsculas. >",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "strings",
      "math",
      "number theory"
    ],
    "id": 10851
  },
  {
    "title": "Tarea 3 Curso Robot C ULAM",
    "url": "https://omegaup.com/arena/problem/Tarea-3-Curso-Robot-C-ULAM",
    "history": "La siguiente se llama conjetura de ULAM en honor del matematico S. UlamComience con cualquier entero positivo N. Si es par, dividalo entre 2; si es impar, multipliquelo por 3 y agreguele 1. Obtenga enteros sucesivamente repitiendo el procesoAl final, obtendra el número 1, independientemente del entero inicial, Por ejemplo, cuando el entero inicial es 12, la secuencia será: 12, 6, 3, 10, 5, 16, 8, 4, 2, 1. # NotaUsar en el programa los ciclos usados en clase, y condicionales.",
    "input": "Una línea con el entero N.",
    "output": "Los números de la serie ULAM separados por un espacio. | | input12| | output12 6 3 10 5 16 8 4 2 1| | end",
    "note": "",
    "topics": [
      "math",
      "brute force",
      "implementation",
      "number theory"
    ],
    "id": 10749
  },
  {
    "title": "Debajo del Mar",
    "url": "https://omegaup.com/arena/problem/Debajo-del-Mar",
    "history": "Rigoberto y Filiberto son medusas * Turritopsis nutricula* ( las cuales son biológicamente inmortales) . Además, son primos y desde que nacieron han sido muy unidos y saben todo el uno sobre el otro. Esta semana aprendieron que son los números primos. Pronto se convirtió en una obsesión de ellos leer y estudiar estos números. Ahora ellos se preguntan, si a día de hoy Rigoberto tiene r años de edad y Filiberto f años, ¿Cuál es la cantidad mínima de años tendrán que pasar para que sus edades sean números primos al mismo tiempo? Ésta especie de medusa logra su \" inmortalidad\" revirtiendo su edad una vez que alcanza la madurez. Lo que quiere decir que nuestro par de criaturas tienen un límite de años, y en lugar de cumplirlos, su edad se reinicia a 0. Por ejemplo Humberto es otra medusa cuya edad es de 9 años y su límite de edad es de 10, y cuando sea su cumpleaños, tendrá 0, no 10 años de edad.",
    "input": "La primera línea contiene dos enteros 0 ≤ r, f 1e7 sus edades actuales respectivas. La segunda línea contiene dos enteros r n ≤ 1e7 y f m ≤ 1e7 los límites de edades de cada medusa.",
    "output": "Imprime 1 entero, cuántos años tendrán que pasar para que las edades de las dos medusas sean números primos al mismo tiempo. Está garantizado que para todos los casos, es posible encontrar el entero deseado.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 10742
  },
  {
    "title": "Posicion Fibonacci",
    "url": "https://omegaup.com/arena/problem/Posicion-Fibonacci",
    "history": "Como ya sabemos la sucesión de fibonacci esta compuesta por los números: 1, 1, 2, 3, 5, 8, 13, 21, 34. . . Sabiendo esto tu tarea es dado un numero * * * N* * * debes encontrar la posición que ocupa en la sucesión de fibonacci.",
    "input": "Un numero * * N* * solamente",
    "output": "Un único entero que indique en que posición se encuentra el numero en la sucesión. Si el numero no se encuentra en la sucesión imprimir un * * - 1* *",
    "note": "",
    "topics": [
      "dp",
      "math",
      "implementation",
      "number theory",
      "binary search"
    ],
    "id": 10727
  },
  {
    "title": "Factores de Dos en Coeficientes Binomiales",
    "url": "https://omegaup.com/arena/problem/Factores-de-Dos-en-Coeficientes",
    "history": "Definamos g( n, m) como el entero k más grande tal que 2^ k divide a nm. Por ejemplo, 125 = 792 = 2^ 3 · 3^ 2 ·11, entonces g( 12, 5) = 3. Luego, definamos F( n) = max [ g( n, m) : 0 ≤ m ≤ n ] . Luego, F( 10) = 3 y F( 100) = 6. Ahora, define S( N) = ∑_ n= 1^ NF( n) . Escribe un programa que, dado un número entero positivo N, encuentre la sumatoria S( N) .",
    "input": "Una sola línea con un entero N.",
    "output": "Una sola línea con el resultado a la sumatoria S( N) .",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 10653
  },
  {
    "title": "¡Hazme caso!",
    "url": "https://omegaup.com/arena/problem/Hazme-caso",
    "history": "Melanie esta destellante de alegría debido a que su nueva pareja, Adriana, ha sido su relación más duradera. Pero. . . Adriana parece estar más atenta a algoritmos y programación que Melanie se ha empezado a sentirse celosa de ello. Todo llego a su límite en su última cita; Adriana le dijo que tenía mucha tarea de Redes y Comunicación por lo cual estaría ocupada pero Melanie podía esperar en la sala. Melanie explotó de rabia y le dijo que si no le prestaba más atención ya no le traería comida. . . Lo que puso muy preocupada a Adriana, Melanie era quien evita que ella muera de hambre. Por suerte Adriana le propuso a Melanie que si llegaba al final de una función, ella se pondría melosa con Melanie, quién frunció el seño pues no entendía nada de funciones, pero acepto de todos modos. La función, Adriana la definió como: f( x) = si x es par = > f( x) = x/ 2; si x es impar = > f( x) = ( 3* x) + 1Se considera como el final de la función si es que el resultado es 1. Adriana le da un ejemplo a Melanie, con x = 3f( 3) = 10 - > f( 10) = 5 - > f( 5) = 16 - > f( 16) = 8 - > f( 8) = 4 - > f( 4) = 2 - > f( 2) = 1Adriana le pide que escriba todos los números hasta llegar a 1. Melanie le pide un tiempo para procesar la información y te llama a ti para que le ayudes.",
    "input": "- La primer línea de entrada contendrá un número n, el primer número de la función.",
    "output": "Imprimir todos lo números, separados por espacios y en orden de aparición, que se generen al aplicar la función hasta llegar al final. | | input3| | output10 5 16 8 4 2 1| | end| | input21| | output64 32 16 8 4 2 1| | end| | input65| | output196 98 49 148 74 37 112 56 28 14 7 22 11 34 17 52 26 13 40 20 10 5 16 8 4 2 1| | end# Limites- 2< = n< = 1e18> NOTA: Melanie después de pensarlo un poco razona y le recrimina a Adriana - * * La función siempre llegará a 1 ¿verdad? , no será que es una de esas funciones que llega a un punto en que empieza a repetirse, es decir entra en bucle* * - a lo que Adriana le responde - * * Realmente no lo puedo asegurar para todos lo números, pero te lo puedo asegurar para todos lo números menores a 1e18* * : > - Si pasas la mitad de las pruebas tendrás 25 puntos. > - Si pasas todas las pruebas obtendrás 100 puntos.",
    "note": "",
    "topics": [
      "combinatorics",
      "number theory",
      "implementation"
    ],
    "id": 10613
  },
  {
    "title": "Reducción númerica",
    "url": "https://omegaup.com/arena/problem/Buscando-Cuadrados",
    "history": "# ProblemaEn este problema debes indicar la cantidad mínima de dígitos que deben eliminarse a partir de un entero n para volverlo un cuadrado perfecto, siempre tomando en cuenta que no se puede eliminar un dígito si al numero resultante le quedan ceros a la izquierda. ( Por ejemplo, eliminar el digito “1” del numero 104 no seria valido) . ———-",
    "input": "En la primera y única linea, un número entero n ( 1 ⩽ n ⩽ 10^ 9) - el numero cuyos digitos queremos eliminar. Se garantiza que al comienzo n jamas tendrá ceros a la izquierda.",
    "output": "Un unico entero - la cantidad mínima de dígitos que deben eliminarse a partir de n para obtener un numero que cumpla con las condiciones especificadas anteriormente. En caso de no ser posible obtener dicho número, se debe imprimir < kbd> - 1< / kbd> . ———- # Ejemplo: | | input86541| | output2| | description( 8 6 5 4 1) → 841 y 29^ 2= 841. | | end———- # NotaEn el primer y unico caso de ejemplo, podemos eliminar los digitos “6” y “5” para obtener el numero 841 y debido a que este es el cuadrado perfecto de 29, la respuesta sería 2. Toma en cuenta que tambien podríamos eliminar todos los digitos a excepción del “1” para obtener un cuadrado perfecto, sin embargo, esta no seria la manera mas óptima de hacerlo ya que deberíamos eliminar 4 digitos. ———- # Subtasks- Para un 13. 77% de los puntos, todos los digitos en n serán iguales. - Para un 86. 23% de los puntos, no hay consideraciones adicionales. ———- < details> < summary> Reto Adicional< / summary> Con base en los envios de la comunidad, aparentemente existen * * multiples* * soluciones para este problema. ¿Serias capaz de obtener una respuesta cuyo tiempo total sea ⩽ 0. 10s? < / details>",
    "note": "",
    "topics": [
      "number theory",
      "shortest paths",
      "implementation"
    ],
    "id": 10197
  },
  {
    "title": "Y^3 + X^5 = N^7",
    "url": "https://omegaup.com/arena/problem/Y3--X5--N7",
    "history": "# HistoriaUn dia, Sebas estaba leyendo un Tzaloa de la OMM, y se encontro un problema muy dificil: \" Dado un entero N, determina si se cumple la igualdad Y^ 3 + X^ 5 = N^ 7 para algun X, Y entero. \" , cuya solucion no encontro. Tu como buen programador que eres, escribe un codigo que resuelva dicho problema.",
    "input": "Un entero N.",
    "output": "Imprime 1 o - 1 si existen o no dichos enteros respectivamente.",
    "note": "",
    "topics": [
      "meet-in-the-middle",
      "combinatorics",
      "flows",
      "graphs",
      "sortings",
      "math",
      "constructive algorithms",
      "strings",
      "games",
      "greedy",
      "shortest paths",
      "string suffix structures",
      "number theory",
      "dp",
      "geometry",
      "matrices",
      "trees",
      "graph matchings",
      "data structures",
      "implementation",
      "binary search",
      "dfs and similar",
      "brute force"
    ],
    "id": 9724
  },
  {
    "title": "Sumita cuadrada",
    "url": "https://omegaup.com/arena/problem/Sumita-cuadrada",
    "history": "Sebas está en un entrenamiento de matematicas, y le presentaron un problema: \" Demuestra que para toda N existe una suma de N números tal que su suma sea un cuadrado perfecto. \" , Sebas esta muy ocupado para resolver ese problema, y tú como buen programador que eres, te ha pedido que demuestres el problema con \" casitos\" .",
    "input": "Un entero N",
    "output": "Los N números distintos entre sí separados por un espacio y ordenados en orden creciente tal que su suma sea un cuadrado perfecto",
    "note": "",
    "topics": [
      "sortings",
      "flows",
      "data structures",
      "string suffix structures",
      "games",
      "combinatorics",
      "greedy",
      "dp",
      "trees",
      "strings",
      "graphs",
      "brute force",
      "constructive algorithms",
      "math",
      "meet-in-the-middle",
      "geometry",
      "number theory",
      "binary search",
      "graph matchings",
      "matrices",
      "implementation",
      "dfs and similar",
      "shortest paths"
    ],
    "id": 9723
  },
  {
    "title": "Ecuaciones Diofánticas",
    "url": "https://omegaup.com/arena/problem/Ecuaciones-diofanticas",
    "history": "Encontrar enteros x e y que resuelvan la ecuación: Ax+ By= C",
    "input": "La entrada entrada empieza con un entero n, 1≤ n≤ 20, el cual indica la cantidad de ecuaciones que se tienen que resolver. Cada una de las siguientes líneas tendrán tres enteros A, B y C, 1 ≤ A, B, C≤ 10^ 9, correspondientes a la ecuación .",
    "output": "La salida debe tener el mensaje: \" No hay valores\" si la ecuación no tiene solución. En caso de que sí tenga solución, se deberán es escribir los números x e y, con la propiedad de que x es el menor entero no negativo que cumple con la ecuación Ax+ By= C.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9567
  },
  {
    "title": "mcd y MCM",
    "url": "https://omegaup.com/arena/problem/mcd-y-MCM",
    "history": "Dado un conjunto de números obtener el máximo común divisor y el mínimo común múltiplo del conjunto.",
    "input": "La entrada empieza con un entero positivo n, 2≤ n≤ 10. Luego en la siguiente línea habrán n enteros positivos, cada uno de estos números x no será mayor a 10^ 9.",
    "output": "La salida debe tener dos enteros separados por un espacio: el máximo común divisor y el mínimo común múltiplo, respectivamente, de los n números de entrada. Se te garantiza que los resultados no serán mayores a 2× 10^ 9.",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 9566
  },
  {
    "title": "Cantidad de Divisores",
    "url": "https://omegaup.com/arena/problem/Cantidad-de-factores-primos",
    "history": "Dados n números enteros, encontrar la cantidad de divisores de cada uno.",
    "input": "La entrada empieza con un entero positivo n, 1 ≤ n ≤ 10^ 4, la cantidad de casos. Luego le seguirán n enteros positivos x, 1 ≤ x ≤ 10^ 6.",
    "output": "Por cada número de la entrada se debe imprimir la cantidad de divisores del número.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9565
  },
  {
    "title": "¿Es Primo? 2.0",
    "url": "https://omegaup.com/arena/problem/Es-Primo-20",
    "history": "Para cada uno de los números de enteros dados, decir si es primo o no.",
    "input": "La entrada empieza con un entero positivo n, 1 ≤ n ≤ 10^ 6, la cantidad de casos. Luego le seguirán n enteros positivos x, 1 ≤ x ≤ 10^ 6.",
    "output": "La salida debe tener n mensajes: \" Es primo\" o \" No es primo\" , según corresponda.",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 9563
  },
  {
    "title": "K-ésimo Primo",
    "url": "https://omegaup.com/arena/problem/k-esimo-primo",
    "history": "Escribir el primo número k. Recuerda que un número es primo si tiene dos, y exactamente dos, divisores positivos. Los primeros cinco primos son 2, 3, 5, 7 y 11.",
    "input": "La entrada empieza con un entero positivo n, 1 ≤ n ≤ 10, 000, la cantidad de casos del problema. Luego seguirán n enteros, cada uno de ellos no será mayor a 140, 000.",
    "output": "La salida debe tener n números, el k- ésimo primo para cada caso.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9562
  },
  {
    "title": "¿Es Primo?",
    "url": "https://omegaup.com/arena/problem/Es-Primo",
    "history": "Para cada uno de los números de enteros dados, decir si es primo o no.",
    "input": "La entrada empieza con un entero positivo n, 1≤ n≤ 100, la cantidad de casos. Luego le seguirán n enteros positivos x, 1 ≤ x ≤ 10^ 9.",
    "output": "La salida debe tener n mensajes: \" Es primo\" o \" No es primo\" , según corresponda.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9561
  },
  {
    "title": "Yo no quiero estar con mi primo",
    "url": "https://omegaup.com/arena/problem/M07",
    "history": "Mi amigo Rob esta preocupado porque no se quiere sentar con sus primos. Rob jamas ha visto a sus primos, solo sabe que son personas desagradables. Curiosamente, todos en la familia de Rob tienen un tatuaje en la frente con un número escrito. El número que tienen tatuado en la frente es el mínimo común múltiplo de los números que tienen tatuados sus padres y el índice del hijo. ( El hijo que nace primero tiene el índice 1) . Ayuda a Rob a identificar que números tendrán sus primos en la frente para poder evitar sentarse junto a ellos.",
    "input": "La entrada contiene un número N, que es la cantidad de parejas de tíos que tiene Rob. Las siguientes N lineas, contienen 3 números: a, b, c. a es el número que tiene tatuado la mamá en la frente. b es el numero que tiene tatuado el papá en la frente. Y c es la cantidad de hijos que tiene esa pareja.",
    "output": "Una línea con la lista de números diferentes que tienen tatuados los primos de Rob.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9555
  },
  {
    "title": "Globos para ICPC",
    "url": "https://omegaup.com/arena/problem/Globos-para-ICPC",
    "history": "< br/ > Te llego la noticia de que hay un grupo de competidores de ICPC( Importantes Competencias Para Calaveras) que están organizando su propio concurso, por lo que necesitaran un montón de globos para entregar donde todos los globos están enumerados del 1 al N. Pero el grupo de competidores ICPC ha estado creciendo y ha estado generando grupos como el CAC( Club Avanzado de Calaveras) , el GOC( Gran Organización de Calaveras) . Donde cada grupo pide un número K y se entregaran todos los globos que sean múltiplos K. < br/ > Ayuda al grupo de competidores ICPC a saber cuántos globos les quedaran después de que cada grupo haya pedido su número de globos.",
    "input": "< br/ > Dos números positivos N y M donde N representa el número de globos que se tiene, y M representa el número de grupos que van a pedir globos.",
    "output": "< br/ > El total de globos que quedaron después de que cada grupo pidió los suyos.",
    "note": "Para conjunto de casos agrupados: * 50",
    "topics": [
      "number theory",
      "brute force"
    ],
    "id": 9542
  },
  {
    "title": "La pintura de Picasso",
    "url": "https://omegaup.com/arena/problem/La-pintura-de-Picasso",
    "history": "< br/ > Un día como cualquier otro día, Picasso observaba su lienzo antes de comenzar una pintura, igual que todas sus demás pinturas Picasso eligió las dimensiones de un rectángulo, y dividió el lienzo completamente usando rectángulos de esas dimensiones, es sabido que de este modo le gustaba presentar sus artes cubistas. Si bien Picasso es un artista de imaginación infinita, se ha percatado que el número de formas en las que puede dividir su lienzo es finita, y por lo tanto, en algún punto, habrá hecho todas sus posibles representaciones. Picasso considera que un cuadro es un rectángulo, y también que un rectángulo de 2 x 1 es diferente a un rectángulo de 1 x 2 < br/ > Ayuda a Picasso a saber de cuantas maneras distintas puede dividir su lienzo de N x M .",
    "input": "< br/ > Dos números positivos N y M que indican las dimensiones del lienzo.",
    "output": "< br/ > El número de formas distintas en las que PIcasso puede dividir su lienzo.",
    "note": "* Para conjunto de casos agrupados: * 50",
    "topics": [
      "combinatorics",
      "number theory"
    ],
    "id": 9540
  },
  {
    "title": "M01 Números Primos",
    "url": "https://omegaup.com/arena/problem/M01-Numeros-Primos",
    "history": "< br/ > Fernando es un chico muy interesado en las matemáticas. El dia de hoy el esta estudiando acerca de un tipo especial de números, los números primos. La definición que leyo decia \" Un numero es primo si sus unicos divisores son el 1 y el mismo\" . Lo cual lo dejo pensando, pero le parecio muy fascinante. Por lo que se dio la tarea de dado número N saber si este número era primo o no. Ayuda a Fernando haciendo un programa que reciba un número N determine si es primo o no.",
    "input": "< br/ > Un número positivo N.",
    "output": "< br/ > Imprimir \" Si\" si el número es primo, en caso contrario imprimir un \" No\" , en ambos casos sin comillas.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 9522
  },
  {
    "title": "Cuantos Primos",
    "url": "https://omegaup.com/arena/problem/CuantosPrimos",
    "history": "Isaac es conocido entre sus amigos por se un numerofílico empedernido. Además a Isaac le gusta presumir que no hay acertijo matemático que no pueda descifrar. Su amigo Godofredo, no está de acuerdo con las presunciones de Isaac, así que ha decidido ponerle el siguiente reto. Dada una secuencia de N pares de números enteros, indica cuantos números primos existen en el intervalo definido por cada par. Por ejemplo, si tenemos la siguiente secuencia de 3 pares de números enteros ( 1, 5) , ( 2, 7) y ( 11, 15) , la respuesta correcta del reto sería 3, 4, y 2 pues en el intervalo definido por el primer par existen 3 números primos ( 2, 3 y 5) , en el intervalo definido por el segundo par existen 4 números primos ( 2, 3, 5, y 7) y en el último intervalo existen 2 números primos ( 11 y 13) . Nota que se consideran también los números que definen el intervalo. Ayuda a Isaac a resolver el reto que le ha puesto Godofredo y demostrar así quien es el rey de los acertijos matemáticos. Para esto, escribe un programa que lea un número entero ( N) , seguido por N pares de números enteros. Por cada par, indica la cantidad de números primos que existen en el intervalo definido por este par de números. Por cada par de números a y b, el número leído primero ( a) siempre será menor al segundo número ( b) .",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 9410
  },
  {
    "title": "Sugar Free Bobba",
    "url": "https://omegaup.com/arena/problem/Sugar-Free-Bobba",
    "history": "Zhang Wei es un excelente programador, y pasa varias horas del día practicando para ser el mejor. Por supuesto su bebida favorita para motivarse mientras practica es un Bobba Tea extra grande con leche de almendras, pero Zhang Wei esta un poco preocupado por su salud pues pasa muchas horas del día sentado y sin hacer ejercicio, por lo cual ha decidido reducir su ingesta de azúcar durante el día, y para esto necesita medir las cantidades de azúcar por cada Bobba Tea que ordena a su casa. < img src= \" https: / / i. pinimg. com/ originals/ 87/ 97/ 26/ 879726b93ec1f4c2f64cc2bc52a4d8ec. jpg\" width= \" 200\" / >",
    "input": "En la primera linea un numero t, representando la cantidad de casos. Por cada caso se leerá un número n, con la cantidad de toppings que contendrá el Bobba. Después se darán n lineas con dos numeros a, b describiendo la fracción de azúcar a/ b que representa el topping n_ i del Bobba total. Los toppings también pueden contrarrestar una cantidad de azucar, es decir, aportar una cantidad negativa de azucar.",
    "output": "Por cada Bobba, imprimir la fracción de azúcar total con la forma a+ b/ c. Donde a representa la forma entera y b/ c el resto de la fracción, que es simplificada. Nunca habra una solución negativa y en caso de que a= 0 o b= 0, no deben imprimirse y si ambos son 0, la salida debe ser 0.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9180
  },
  {
    "title": "Pastel de cumpleaños de Pupperino",
    "url": "https://omegaup.com/arena/problem/Pastel-de-cumpleanos-de-Pupperin",
    "history": "Pupperino tiene una fiesta de cumpleaños el siguiente sábado. Debido a que no se puede restringir la cantidad de pasteles que puede comer cada invitado ya que sería grosero, y tampoco se puede repartir un pastel entero a cada invitado, Pupperino ha pedido de tu ayuda para saber la cantidad de pastel que está comiendo cada uno de sus invitados. A Pupperino no le interesa saber la cantidad total de pastel que ha sido consumida durante la fiesta, sino cuánto pastel consume cada uno de sus invitados. Pupperino te pidió que le hicieras un programa que muestre en pantalla la cantidad de pastel que está comiendo cada invitado. Esto es muy importante para Pupperino, ya que desea hacer un estimado de cuánto pastel encargar para su próxima fiesta de cumpleaños. . . y para ir conociendo a sus invitados.",
    "input": "La primera línea corresponde a la cantidad de invitados N en la fiesta de Pupperino. La primera línea de cada N_ i corresponde al número de momentos M en el que el invitado N_ i salió a comer pastel. La primera línea de cada M_ i contiene dos números 0≤a≤b≤1000 separados por un espacio que representan la fracción de pastel a/ b que el invitado N_ i comió en el momento M_ i.",
    "output": "Una fracción con la forma a+ b/ c donde a representa la forma entera del pastel y b/ c el resto del pastel, que es simplificada. En caso de que a= 0 o b= 0 no se debe imprimir nada. Si a= b= 0 la salida debe de ser 0.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9095
  },
  {
    "title": "Jorge y los números primos",
    "url": "https://omegaup.com/arena/problem/Jorge-y-los-numeros-primos",
    "history": "Jorge es un niño que esta aprendiendo a calcular números primos y quiere saber cuantos números primos hay entre sus dos números favoritos# # Problema # # Escribe un programa que le ayude a Jorge a calcular todos los números primos en un rango# # Datos de entrada# # Cantidad T de casos de prueba. Dos valores ( A y B) indicando el rango. donde 0 < A < = B < 10< sup> 6< / sup> .",
    "input": "",
    "output": "cantidad de números primos en el rango.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 9044
  },
  {
    "title": "Generar un vector con los N primeros números primos.",
    "url": "https://omegaup.com/arena/problem/Generar-un-vector-primos",
    "history": "Generar un vector con los N primeros números primos. | | input6| | output2 3 5 7 11 13| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 8889
  },
  {
    "title": "Dígitos de Fibonacci",
    "url": "https://omegaup.com/arena/problem/Digitos-de-Fibonacci",
    "history": "Las series de Fibonacci estan de moda, asi que quisieras saber cual es el índice más pequeño de un número λ que tiene al menos * * M* * dígitos y pertenece a la serie de Fibonacci. Se debe de considerar que la serie empiece a partir del primer uno con índice 1: 1, 1, 2, 3, 5, 8, 13. . . # EntradasUn número * * N* * de casos seguido por N líneas con * * M* * , el mínimo número de digitos. # SalidasEl índice más pequeño donde λ tiene al menos * * M* * dígitos.",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "dp",
      "implementation",
      "number theory"
    ],
    "id": 8629
  },
  {
    "title": "Rango de Bits",
    "url": "https://omegaup.com/arena/problem/Rango-de-Bits",
    "history": "Los bits de tu computadora se están escapando, asi que tu ocupas crear un programa para calcule cuantos bits activados están dentro de un rango de números# EntradasUn número * * N* * , seguido por * * N* * casos. Cada caso tiene dos enteros, un valor mínimo * * A* * ( exclusivo) y un valor máximo * * B* * ( inclusivo) . # SalidasLa suma del número de bits prendidos entre todos los números del rango * * ( A, B] * * , es decir A + 1, A + 2, A + 3 . . . B.",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "data structures",
      "math",
      "implementation",
      "number theory",
      "combinatorics",
      "dp"
    ],
    "id": 8626
  },
  {
    "title": "El camino de Edison (Díficil)",
    "url": "https://omegaup.com/arena/problem/El-camino-de-Edison-Dificil",
    "history": "Todos sabemos que una de las actividades favoritas de nuestro buen amigo Edison es cortar mazorca en su rancho en Ecuador. Como Edison es muy curioso, en una de sus expediciones para cortar lo que aquí llamamos elotes, decidió contar cuántos caminos diferentes podría tomar para llegar desde la esquina superior izquierda hasta la esquina inferior derecha de su rancho ( considerando que su rancho es una cuadrícula de n x m cuadros) . Su buena amiga Blanca, que siempre está intentando hablar de filosofía y cosas raras, siempre le dice que no hay que voltear hacia atrás, siempre hacia adelante. Por lo que Edison decide que solamente va a hacer movimientos hacia la derecha y hacia abajo en su rancho, para así nunca volver al inicio y siempre dirigirse hacia la esquina inferior derecha porque ahí está esperándolo Blanca. Como Blanca ya está desesperada porque Edison se está tardando mucho contando todos los caminos, tu tarea es hacer un programa que dado * * N* * y * * M* * ( las longitudes del rancho de Edison) , calcule cuántos caminos son posibles para recorrer todo el rancho dada la lógica de Edison. ! [ Ejemplo] [ 1]",
    "input": "Dos números enteros * * N* * : 1 ≤ N ≤ 34 y * * M* * : 1 ≤ M ≤ 34 las dimensiones del rancho",
    "output": "La cantidad de caminos posibles para llegar desde la esquina superior izquierda a la esquina inferior derecha.",
    "note": "",
    "topics": [
      "math",
      "constructive algorithms",
      "number theory",
      "dp",
      "combinatorics",
      "implementation",
      "matrices",
      "dfs and similar",
      "data structures"
    ],
    "id": 8588
  },
  {
    "title": "El camino de Edison (Fácil)",
    "url": "https://omegaup.com/arena/problem/El-camino-de-Edison-Facil",
    "history": "Todos sabemos que una de las actividades favoritas de nuestro buen amigo Edison es cortar mazorca en su rancho en Ecuador. Como Edison es muy curioso, en una de sus expediciones para cortar lo que aquí llamamos elotes, decidió contar cuántos caminos diferentes podría tomar para llegar desde la esquina superior izquierda hasta la esquina inferior derecha de su rancho ( considerando que su rancho es una cuadrícula de n x m cuadros) . Su buena amiga Blanca, que siempre está intentando hablar de filosofía y cosas raras, siempre le dice que no hay que voltear hacia atrás, siempre hacia adelante. Por lo que Edison decide que solamente va a hacer movimientos hacia la derecha y hacia abajo en su rancho, para así nunca volver al inicio y siempre dirigirse hacia la esquina inferior derecha porque ahí está esperándolo Blanca. Como Blanca ya está desesperada porque Edison se está tardando mucho contando todos los caminos, tu tarea es hacer un programa que dado * * N* * y * * M* * ( las longitudes del rancho de Edison) , calcule cuántos caminos son posibles para recorrer todo el rancho dada la lógica de Edison. ! [ Ejemplo] [ 1]",
    "input": "Dos números enteros * * N* * : 1 ≤ N ≤ 34 y * * M* * : 1 ≤ M ≤ 34 las dimensiones del rancho",
    "output": "La cantidad de caminos posibles para llegar desde la esquina superior izquierda a la esquina inferior derecha.",
    "note": "",
    "topics": [
      "implementation",
      "math",
      "dp",
      "constructive algorithms",
      "matrices",
      "data structures",
      "dfs and similar",
      "number theory"
    ],
    "id": 8587
  },
  {
    "title": "Llaves Descifrables",
    "url": "https://omegaup.com/arena/problem/Llaves-Descifrables",
    "history": "Habiendo estudiando un poco de criptografía, decides estudiar acerca de llaves RSA y te das cuenta que puedes descifrar una de estas llaves ( las llaves no son nada más que números muy grandes) determinando sus factores primos. Estos números siempre tendrán dos factores primos distintos * * A* * y * * B* * , y si encuentras estos factores podrás descifrar cualquier mensaje hecho con la llave original.",
    "input": "Un número * * N* * que siempre tendrá solo dos factores primos",
    "output": "Los dos factores primos * * A* * y * * B* * , donde * * A* * < * * B* *",
    "note": "",
    "topics": [
      "implementation",
      "number theory",
      "math"
    ],
    "id": 8581
  },
  {
    "title": "Suma",
    "url": "https://omegaup.com/arena/problem/SumaLions",
    "history": "James quiere saber cuantos leds tiene en su caja de electrónicos. Su caja solo tiene dos divisiones y sabe cuantos leds hay en cada una, pero como está muy ocupado organizando torneos de programación, programando robots de soccer, y hackeando Minecraft, necesita tu ayuda para sumar las cantidades y saber cuantos leds tiene.",
    "input": "Dos enteros positivos * * A* * y * * B* * menores o iguales a 1000.",
    "output": "La suma de los dos enteros.",
    "note": "",
    "topics": [
      "number theory",
      "combinatorics"
    ],
    "id": 8577
  },
  {
    "title": "El autor no se molestó en escribir un título",
    "url": "https://omegaup.com/arena/problem/No-se-molesto-en-escribir-uno",
    "history": "Te enfadaste de agregarle historias a tus problemas porque nadie los resuelve. Por eso escribiste un problema con la siguiente redacción: Dado un número w y otro número n, decir si para todos los números enteros p y q distintos mayores a 1 y menores o iguales a n se cumple que: w p ≢w q",
    "input": "Dos números w y n.",
    "output": "Imprimir \" Si\" si existen p y q y \" No\" si no existen.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 8057
  },
  {
    "title": "Solving the equation",
    "url": "https://omegaup.com/arena/problem/Solving-the-equation",
    "history": "Dados dos enteros positivos k y n, y enteros positivos a_ 1, a_ 2, . . . , a_ k, tu tarea es encontrar el número de soluciones no negativas enteras que tiene la siguiente ecuación: ∑_ i= 1^ ka_ i x_ i = nEs decir, tienes que encontrar el número de tuplas distintas ( x_ 1, x_ 2, . . . , x_ k) que satisfagan la ecuación anterior, donde x_ 1, x_ 2, . . . , x_ k ∈N∪ 0. Sin embargo, dicha tarea puede parecer sencilla, por lo que tendrás que resolver el problema anterior para cada n entera tal que 0 ≤ n ≤ N.",
    "input": "* Primera línea: el entero positivo k. * Segunda línea: k enteros positivos a_ 1, a_ 2, . . . , a_ k separados por espacios. * Última línea: el entero positivo N.",
    "output": "Deberás imprimir N+ 1 enteros r_ 0, r_ 1, . . . , r_ N separados por espacios en una sola línea, donde r_ i es el número de soluciones de la ecuación cuando n= i. Como estos números pueden llegar a crecer mucho, imprímelos módulo 998244353.",
    "note": "",
    "topics": [
      "number theory",
      "fft"
    ],
    "id": 7891
  },
  {
    "title": "Contando Primos",
    "url": "https://omegaup.com/arena/problem/Contando-Primos",
    "history": "En tu clase de matemáticas te enseñaron el algoritmo de Euclides ( para calcular el gcd de dos números) , y de tarea te pidieron que para un número N, calculases f( N) , siendo esta función, la cantidad de números menores o iguales a N, cuyo gcd= 1. # ProblemaDado un número N, calcular f( N) .",
    "input": "El entero N.",
    "output": "El resultado de f( N) , la cantidad de números menores o iguales a N, cuyo gcd= 1.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 7878
  },
  {
    "title": "B-I-N-A-R-Y",
    "url": "https://omegaup.com/arena/problem/B-I-N-A-R-Y",
    "history": "Después de su grandiosa aventura los amigos pudieron superar a los policías y a los malvados contrincantes de su cartel. Ahora los super- amigos tenían que encargarse de vender un \" dulce\" llamado * * B. I. N. A. R. Y. * * , al eliminar a su competencia los super- amigos podían vender este dulce tan solicitado al precio que se les pegara la gana. Para su mala suerte las personas en la tierra de los problemas ya sabían cual era el precio estándar de dicho dulce, así que si lo vendían más alto las personas iban a saber que los estaban engañando y eso los iba molestar mucho al punto de hacer una revolución. Sin embargo, para su buena suerte el dulce causa un efecto especial en las personas. Las personas no podían recordar el precio exacto al que compraron el dulce, lo único que recordaban las personas es cuantos \" 1\" tenía el precio en su representación binaria ( base 2. Se explicara más abajo que es esto, por si no lo sabes) . Y también podían recordar el tamaño de la representación binaria del número, para que no pudieras engañarlos tan fácil. Los super- amigos se dieron cuenta que podían vender el dulce en varios precios posibles con esas condiciones pero ellos querían venderlos al público al mayor precio posible. Santy y Joel también tenían * personas reconocidas* que eran como amigos, así que a estas personas le querían vender el dulce al menor precio posible con las condiciones dadas. # Representación binariaTodo número decimal puede ser representado como la suma de * * diferentes* * potencias de 2 ( 2^ n) . Ejemplo: 7 = 2^ 0 + 2^ 1 + 2^ 2 = 1 + 2 + 421 = 2^ 0 + 2^ 2 + 2^ 4 = 1 + 4 + 16Para representar un número en el sistema binario se usa una cadena ( a) de puros \" 0\" y \" 1\" ( tamaño n) . Cada posición ( a_ i , N < i < = 0) representa \" por cuanto se esta multiplicando dicha potencia ( 2^ i) \" . Y se lee de izquierda a derecha. En donde la última posición es 2^ 0. Ejemplo: ( 111) _ 2 = ( 2^ 2) ( 1) + ( 2^ 1) ( 1) + ( 2^ 0) ( 1) = 4 + 2 + 1 = 7( 10101) _ 2 = ( 2^ 4) ( 1) + ( 2^ 3) ( 0) + ( 2^ 2) ( 1) + ( 2^ 1) ( 0) + ( 2^ 0) ( 1) = 16 + 0 + 4 + 0 + 1 = 21( 100101) _ 2 = ( 2^ 5) ( 1) + ( 2^ 4) ( 0) + ( 2^ 3) ( 0) + ( 2^ 2) ( 1) + ( 2^ 1) ( 0) + ( 2^ 0) ( 1) = 32 + 0 + 0 + 4 + 0 + 1 = 37El tamaño de la cadena esta dado por el primer \" 1\" , ya que los ceros que hayan antes no importan. Ejemplo10001, 10101, 10011; Tamaño = 5. 0001001, 0001100; Tamaño = 4. Dato curioso, así se representan los número en una computadora. El sistema que usamos es base 10 ( 10^ n) y nuestras cadenas son con caracteres de \" 0- 9\" . # ProblemaDado un número N ( precio estándar) , decir cual es el mayor y menor número que se puede formar con: - El mismo número de \" 1\" en su representación binaria- El mismo tamaño en la cadena de su representación binaria",
    "input": "N número entero positivo que representa el precio estándar",
    "output": "El mayor y el menor precio al que puedes vender el dulce con las condiciones dichas anterior mente.",
    "note": "",
    "topics": [
      "number theory",
      "divide and conquer",
      "math",
      "implementation"
    ],
    "id": 7872
  },
  {
    "title": "La Super-Arma de la tierra de los problemas",
    "url": "https://omegaup.com/arena/problem/La-Super-Arma",
    "history": "Como bien sabrás este año se lleva acabo el primer encuentro de \" Yucatán vs Quintana Roo\" ( Pobre Campeche ? ? ) . Esta idea lleva puesta mucho tiempo, pero no fue hasta que los super- amigos se juntaron ( Joel y Santy) que se pudo llevar acabo. Lastimosamente como se esta en fase prueba el examen es en linea y no presencial, pero eso no es razón para dar un mal desempeño. Por lo cual los super- amigos decidieron hacer un examen muy bueno; pero al momento de sentarse hacer el examen los super- amigos se dieron cuenta que no tenían ni idea de que problemas poner, ni que tan difíciles debían ser ( más que nada porque son todos unos cracks) . Santy dio la idea de robarse problemas de * CodeForces* ( un clásico) y Joel dio la gran idea de robarse unos exámenes OMM y volverlos problemas OMI. Pero esas ideas eran muy tontas para lograr hacer un super examen, por lo cual decidieron visitar la tierra de los problemas. La tierra de los problemas es un lugar repleto de caos en donde toda aventura se puede hacer como un problema de cualquier olimpiada ( no, no es un alucinógeno que se ingiere, # NoALasDrogas) . Joel y Santy entraron a la tierra de los problemas por primera vez. Al parecer la historia en donde estaban parecía ser que trabajaban en una tal AJC ( Asociación Juvenil de Carteles) . Ellos poseían un arma ( La Super- Arma de la tierra de los problemas) un tanto peculiar, el arma tenia una pantalla donde tu podías ponerle dos número X y Y. Estos números servían para describir el arma de la siguiente manera: X * Y = poderX / Y = camuflajeEl arma tenía que cumplir la condición: Y | X, X ≡ 0 Y, X",
    "input": "A El camuflaje máximo, B El poder mínimo y N el límite de X y Y.",
    "output": "Si existe la pareja X , Y < = N y si no existe \" - 1\"",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 7870
  },
  {
    "title": "Suma de sumas",
    "url": "https://omegaup.com/arena/problem/Suma-de-sumas",
    "history": "Juanito es muy curioso y en su preparación para el TMR de Jalisco está estudiando las matemáticas porque se le había olvidado por completo. Justo en medio de su estudio se topó con un problema un tanto complicado y te quiere pedir ayuda para resolverlo. Resuelva la siguiente serie: ∑_ i= 1^ N ∑_ j= 1^ i i",
    "input": "Un solo entero * * N* * que representa el límite superior de la serie.",
    "output": "Un solo entero * * K* * , la respuesta de la serie.",
    "note": "",
    "topics": [
      "math",
      "number theory",
      "implementation"
    ],
    "id": 7840
  },
  {
    "title": "Buddy y el pollo.",
    "url": "https://omegaup.com/arena/problem/Buddy-y-el-pollo",
    "history": "En un día normal, Buddy el perro iba caminando por la calle, pensando en lo rico que sería comerse un pollo. Al tratar de comunicarle a su dueña su necesidad de comer pollo, se dio cuenta de que no tenía suficientes croquetas para decirle este mensaje ( sí, Buddy y su dueña se entienden con croquetas) . Triste pero no derrotado, Buddy se decidió salir de casa en busca de delicioso pollo frito, rostizado o en salsa verde. Al cabo de unos días, un misterioso pollo de tamaño n apareció en su camino, este fue el mejor día de su vida. Como Buddy es un perro muy compartido, consideró repartirlo entre sus amigos perrunos, y analizó de qué manera podía repartir el pollo en partes iguales sin que sobrara ningún pellejito, hueso o carne. Ayuda a Buddy dándole todas las opciones en las que puede repartir su pollo.",
    "input": "La entrada consiste de una sola línea con n: el tamaño del pollo.",
    "output": "Deberás imprimir en una sola línea una lista con las opciones en las que Buddy puede repartir su pollo en partes iguales. Como Buddy quiere evitar la fatiga, deberás imprimir esta lista en orden ascendente. Si dicha lista no existe entonces deberás dejar una línea en blanco.",
    "note": "",
    "topics": [
      "math",
      "number theory",
      "sortings"
    ],
    "id": 7410
  },
  {
    "title": "Dibujando Montañas",
    "url": "https://omegaup.com/arena/problem/Dibujando-Montanas",
    "history": "Uno de tus mas grandes sueños fue trabajar para la empresa de dibujos animados más grande del mundo, Neydis, y en esta ocasión podrás cumplirlo. Fuiste contratado para dibujar los paisajes que se repiten constantemente en el fondo de las cintas animadas. De manera particular tu trabajo consiste en dibujar montañas que se mostrarán de fondo en la cinta. Pero, como tú de niño notabas que cada cierto tiempo se volvía a repetir el mismo patrón de montañas, decidiste demostrarle a la empresa que existe una gran cantidad de variantes de dibujo de montañas si te dan un lienzo de tamaño N. De esta manera, ya será muy difícil notar cuando se repiten otra vez los patrones de dibujo. * * * Consideraciones de dibujo* * * - El largo del lienzo será de * * dimensión par* * . - Se empieza el dibujo en la coordenada ( 0, 0) . - Tienes dos posibles movimientos para ir dibujando las montañas. El primero es ( 1, 1) ( moverte un cuadro a la derecha y después un cuadro hacia arriba) . El segundo ( 1, - 1) ( moverte un cuadro a la derecha y después un cuadro hacia abajo) . - No puedes descender del eje X, todo se dibuja en un cuadrante. - Se considera como dibujo válido si siguiendo los movimientos descritos se llega a la coordenada ( N, 0) Fascinados por tu propuesta te pidieron un ejemplo, consideremos un lienzo de tamaño 6. ! [ enter image description here] [ 1] Como se puede observar con un lienzo de tamaño 6 podemos dibujar 5 combinaciones distintas de montañas siguiendo las reglas ya descritas.",
    "input": "Un número N par.",
    "output": "Todas las formas en las que podemos dibujar paisajes de montañas en un lienzo de dimensión N. Como la respuesta puede ser muy grande imprimirla en * * módulo 1234567* *",
    "note": "",
    "topics": [
      "number theory",
      "combinatorics"
    ],
    "id": 7170
  },
  {
    "title": "El Hacker Gamma",
    "url": "https://omegaup.com/arena/problem/El-Hacker-Gama",
    "history": "Fuiste contratado para ayudar a la Agencia Nacional de Seguridad Informática ( ANSI) para resolver un enigma. Hace unos meses un hacker de origen desconocido apodado * * * gamma* * * ( como el número misterioso) logró penetrar al sistema, pero increíblemente no robó datos ni modificó nada. Al parecer solo quiere dar un mensaje, enviando el mismo a distintos correos electrónicos. Una parte del contenido versaba lo siguiente: * “Porque encuentras felicidad en pantallas y mensajes, cuando el hombre en sus inicios podía serlo con el simple apreciar de la naturaleza. Tú mismo puedes comprobar que la misma está envuelta de números como en la cola de un camaleón. . . ”* El texto continuaba y más adelante versaba que en pocos días llegaría una nueva carta y en caso de no ser resuelta, lanzaría un ataque fulminante contra los servidores de la agencia. Haciendo vulnerable la red de nuestro país. Uno de nuestros más inteligentes agentes alias * * * Delciuxs* * * encontró un mensaje oculto dentro del primer mensaje. Pero no nos quiso decir. Simplemente a la mañana siguiente se presentó con nosotros y pidió su renuncia. Sin antes darnos unas pistas para la siguiente carta. * Le gustan los números* La razón que versa el primer mensaje fue de oro, la que viene será de plata. * El número de palabras del mensaje es indispensable para encontrar el mensaje oculto. * El mensaje oculto se encuentra dentro de la misma carta. * Tienen 10 días para encontrar el mensaje, suficiente como para encontrar una palabra por día. * Es importante el orden de las palabras, el uno arroja la primera, el dos arroja la segunda, el tres la tercera. . . * El siguiente símbolo es un grandísimo regalo de mi parte. . . ! [ enter image description here] [ 1]",
    "input": "Una linea de texto que contiene el nuevo mensaje del hacker * * gamma* * , este texto no contiene puntos ( * * . * * ) ni comas ( * * , * * ) ni saltos de linea, todas las palabras están en minúsculas. * * * El texto del mensaje que se te dará como input es el que se presenta a continuación: * * * * sabes que si tenemos lo necesario para vivir realmente importara el que avance la tecnología por supuesto que si pero vale la pena gastar tu vida lo que hago y haces para a veces desarrollar entretenimiento mismo que solo convierte a nuestro semejante en un ente menos critico este mi trabajo no consiste en menospreciar dicho esfuerzo puesto que aun en estas actividades de desarrollo de software sigue existiendo esta forma de generar el arte de programar el código tecnológico es un legado correcto gama*",
    "output": "Una única linea que contiene el mensaje oculto, cada palabra en minúsculas y separadas con un espacio. [ 1] : simbolo. png",
    "note": "",
    "topics": [
      "implementation",
      "strings",
      "number theory"
    ],
    "id": 7132
  },
  {
    "title": "Factorial Enorme",
    "url": "https://omegaup.com/arena/problem/Factorial-Enorme",
    "history": "Un número Factorial está definido por: 0! = 1n! = n ×( n- 1) ! Dado un entero n calcula el número de dígitos que contiene n! .",
    "input": "Un entero n.",
    "output": "El número de dígitos que contiene n!",
    "note": "",
    "topics": [
      "implementation",
      "math",
      "number theory"
    ],
    "id": 7106
  },
  {
    "title": "MrK07. TEORIA DE NÚMEROS vs BUBBLESORT PARA TODOS",
    "url": "https://omegaup.com/arena/problem/MrKrista-vs-Teoria-de-Numeros",
    "history": "# DescripcionExiste un viejo dicho que dicta que existe una fórmula y una manera iterativa para solucionar un problema. Hoy el problema dicta de la siguiente manera: \" Debes encontrar el camino más corto para llegar de un número x a un número y, tomando en cuenta que las únicas modificaciones a los números es sumar un número primo, llamémosle a que sea menoro iguala un parámetro n, en resumen: \" n: Sólo puedes utilizar los números primos menores- iguales a n ( nombremoslo \" a\" ) . ( Siempre y cuando a es primo y a< = n) . x: Número inicial. y: Número al cual se desea llegarNOTA: Esto es un concurso de velocidad, por lo tanto, debes escribir la manera mas cortade llegar de x a y. # ProblemaDados tres números: n, x y y, determina lo siguiente: Si se puede llegar del número x al número y con las sumas permitidas: Imprime \" Bubblesort para todos : D\" , seguido de un salto de línea. Tras esto, imprime el número de sumas que realizaste, luego otro salto de líneay por último, los números por los cuales pasaste para llegar de x a y. Si no se puede resolver el problema, imprime la famosa frase de MrKrista: \" Matematicamente tenemos oportunidad Sr Alemova\" .",
    "input": "Tres números: n, x, y.",
    "output": "Las especificaciones anteriormente mencionadas. | | input10 2 8| | outputBubblesort para todos : D22 5 8| | end| | input10 2 3| | outputMatematicamente tenemos oportunidad Sr Alemova| | end# Limites10< = n< = 10000002< = x, y< = 3000000",
    "note": "",
    "topics": [
      "shortest paths",
      "number theory"
    ],
    "id": 6985
  },
  {
    "title": "Torres De Hanoi",
    "url": "https://omegaup.com/arena/problem/TDH",
    "history": "# DescripcionUn dia despertaste muy RecursivoDpsisimoMatematico y decidiste resolver un problema de logica ( rara forma de espertar la tuya) , entonces buscas en los juguetes de la primaria u encuentras 3 torres con N aros, el juego consiste en que debes de mover todos los arosque estan en la torre 1 a la torre 3, en el menor numero de pasos para lograr una puntuacion exelente. # Reglaspara poder resolver este puzzle logico MatematicoDinamicosorecursivisimo constas de las siguientes reglas1) los aros en la torre uno siempre empezaran ordenados de menor a mayor de arriba hacia abajo. 2) para moverlos puedes utilizar la torre 2 que te servira como auxiliar. 3) la pila en la torre final siempre tiene que quedar igual que al principio es decir del aro mas pequeño al mas grande ( de arriba hacia abajo) . 4) no puedes pones un disco mas grande sobre uno mas pequeño, ya que se romperan por ser chinos ademas es trampa, incluso un simeo lo sabe. 5) solo se puede mover un disco a la vez. # Problemarecibiras un numero N donde N es el numero de discosy en donde ( 1 < = N < = 100)",
    "input": "",
    "output": "el numero de pasos minimos que necesitas para mover la pila de discos a la ultima torre# Ejemplo Basicopara mover 3 discos de la torre 1 a la torre 3 necesitamos 7 pasos ya que podemos tomar el disco 1 y moverlo a la torre 3 ( llevando 1 paso) tomar el disco 2 y ponerlo en la torre 2 ( llevando 2 pasos) tomar el disco 1 y ponerlo arriba del disco 2 en la torre 2 ( llevando 3 pasos) , movemos el disco 3 ( el mas grande) y lo ponemor en la torre 3 ( llevando 4 pasos) , movemos el disco 1 de la torre 2 a la torre uno ( llevando 5 pasos) tomamos el disco 2 de la torre 2 y lo ponemos en la torre 3 ( llevando 6 pasos) y por ultimo tomamos el disco 1 y lo ponemos en la torre 3 asi terminandoel puzzle con 7 pasos| | input24| | output16777215| | input16| | output65535| | input1| | output1| | input3| | output7| | end# limitessiempre diviertete : )",
    "note": "",
    "topics": [
      "number theory",
      "dp",
      "math"
    ],
    "id": 6978
  },
  {
    "title": "Rompiendo el sistema RSA",
    "url": "https://omegaup.com/arena/problem/rompiendo-el-sistema-rsa",
    "history": "Eres un ingeniero que trabaja para la defensa de tu país, y están en medio de una guerra con otros países, logras interceptar mensajes de tus enemigos y te das cuenta de que están cifrados de una forma peculiar, y deduces que se trata del algoritmo RSA. Este es un sistema criptográfico de clave pública, y para generar el par de claves se lleva acabo el siguiente algoritmo. Se eligen dos números primos: ( p) y ( q) , normalmente, de más de 1024 bits. El producto de estos dos, llamémosle ( n) , será el módulo de cifra ( n = pq) . Luego, se elige una clave pública ( e) que deberá ser mayor a 1 y menor a el indicador de euler phi de ( n) , tal que así: ( 1 < e < phi( n) ) . El indicador de euler del producto de dos números primos se calcula como ( phi( n) = ( p - 1) * ( q - 1) ) , siendo ( n) el producto de esos dos primos y, ( p) y ( q) los primos. A continuación, se calculará la clave privada ( d) , calculando el inverso multiplicativo modular de ( e) , en phi( n) , entonces ( d = inv( e, phi( n) ) . En aritmética modular, el inverso se define como ( ax = 1 ( mod b) ) , donde en la ecuación anterior: ( a) sería: ( e) , ( b) sería: ( phi( n) ) y ( x) sería el inverso. Ajustando la ecuación a nuestras variables, quedaría como: ( ed = 1 ( mod phi( n) ) ) . Para asegurarnos de que exista el inverso, ( e) y ( phi( n) ) deberán ser coprimos entre sí, es decir, el máximo común divisor entre ( e) y phi( n) deberá ser 1 ( mcd[ e, phi( n) ] = 1) . Para cifrar, se realiza la siguiente ecuación: N^ e = C ( mod n) Siendo ( C) el criptograma resultante y ( N) el número a cifrar. Para descifrar: C^ d = N ( mod n) Siendo ( N) el número original y ( C) el criptograma a descifrar. # ProblemaTu trabajo es tratar de romper las claves criptográficas y descifrar los mensajes que tus enemigos se envían entre sí. Sabes que si lo logras, podrías llegar a descubrir información vital sobre sus próximos movimientos y anticiparte a ellos para darle fin a esta guerra.",
    "input": "* En la primera línea: ( e) , la clave pública. * El la siguiente: ( n) , el módulo de cifra. * En la que sigue: ( l) , el tamaño del criptograma. * El las ultimas ( l) líneas, cada parte del criptograma.",
    "output": "Una línea representando el mensaje descifrado ( N) .",
    "note": "",
    "topics": [
      "number theory",
      "dp",
      "flows",
      "math"
    ],
    "id": 6875
  },
  {
    "title": "Funcion totienica de euler",
    "url": "https://omegaup.com/arena/problem/Funcion-totienica-de-euler",
    "history": "La función totienica de Euler φ( N) es igual al número de primos relativos que tiene N menores a si mismo . Por ejemplo , φ( 4) = 2 , sus primos relativos son 1 y 3. Se te daran P números , para cada uno de los números tienes que imprimir cual es número con la mayor φ( N) para 1≤ N ≤ P . Si más de un número tiene la mayor función totienica deberas imprimir el menor. * * Para este problema φ( 1) = 0* *",
    "input": "P el número de números que se te dara , seguido de P lineas , cada linea con un entero P_ i.",
    "output": "Por cada número caso , devolver el número con la función totienica de euler más grande seguido de un salto de linea.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 6809
  },
  {
    "title": "Potencias y Módulos",
    "url": "https://omegaup.com/arena/problem/potencias-y-modulos",
    "history": "Santiago está en medio de su examen de matemáticas, y de pronto se encuentra con una serie de preguntas que parece que se va a tardar un buen rato. Estas preguntas son del tipo, calcula: x^ y = a( mod z) . # ProblemaSon varias preguntas de ese tipo, por lo que Santiago ha decidido desarrollar un programa que le haga esas operaciones y que lo haga rápido. ¡Ayúdale a Santiago a hacerlo!",
    "input": "Tres números: * x Un número base para la potencia. * y Un exponente no negativo. * z El módulo.",
    "output": "El resultado de ejecutar esa operación.",
    "note": "",
    "topics": [
      "math",
      "number theory"
    ],
    "id": 6777
  },
  {
    "title": "Caminos de Bacho",
    "url": "https://omegaup.com/arena/problem/caminos-de-bacho",
    "history": "Es el primer día de cursos de Marco en bacho 2, y está en el laboratorio de informática. Él está bien agustín programando cuando de pronto quiere ir al baño. . . Él es medio olvidadizo. Por suerte la escuela es chica y es de 1 x M salones. Se sabe que él no se quiere perder en la escuela, así que quiere saber cuántos caminos existen, por lo que se mueve de la siguiente manera: ! [ Camino] ( camino. jpg) El salón de informática está en la esquina inferior izquierda ( punto A) y el baño está en la esquina inferior derecha ( punto B) . # Problema¿Cuántos caminos puede tomar Marco?",
    "input": "Un único valor M.",
    "output": "Los caminos posibles.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 6776
  },
  {
    "title": "Divisores Training Gate",
    "url": "https://omegaup.com/arena/problem/Divisores-Training-Gate",
    "history": "Se dice que un número entero a es divisor de b, si y solo sí existe un sólo número natural d, tal que a* d= b. # ProblemaEn este problema recibirás un número y se requiere saber cuantos divisores tiene este número, y cuales son.",
    "input": "Para cada caso de prueba recibirás N ( 1 < = N < 2^ 31) , los casos terminan cuando N= 0",
    "output": "Para cada caso de prueba debes imprimir en numero de divisores que tiene el numero N, y en la siguiente línea todos sus divisores ordenadosde menor a mayor. # ProtipPuedes calcular la raíz de un número x con la función sqrt( x) ;",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 6599
  },
  {
    "title": "Numero de digitos",
    "url": "https://omegaup.com/arena/problem/Numero-de-digitos",
    "history": "Dados dos enteros positivos a y b determinar el número de dígitos que tiene a^ b.",
    "input": "Dos enteros positivos a, b.",
    "output": "Un entero d que corresponde al número de dígitos de a^ b.",
    "note": "",
    "topics": [
      "number theory",
      "math"
    ],
    "id": 6471
  },
  {
    "title": "MasterMind",
    "url": "https://omegaup.com/arena/problem/MasterMind",
    "history": "Se require tu ayuda para vencer al antiguo rompecabezas MasterMind. La idea del rompecabezas es simple: debes determinar el código, hecho con una secuencia de fichas de colores, que MasterMind eligió. Tú hacesintentos de adivinar y recibes retroalimentación sobre tus intentos, más precisamente, el número de colorescorrectos en lugares correctos, y el número de colores correctos en lugares incorrectos. Por ejemplo, imagina un juego con 9 colores y 4 posiciones. Digamos que el código secreto es \" azul, azul, amarillo, rojo\" . Al inicio tu no sabes cuál es el código y debes adivinar: \" azul, verde, verde, amarillo\" . La información querecibes será que tienes 1 color correcto en el lugar correcto y un color correcto en el lugar incorrecto( la ficha amarilla, que no esta en la posición correcta) . Mira la figura de abajo para entender mejor esta idea. El objetivo del juego es determinar el código secreto, usando la minima cantidad de intentos. ! [ imgg] ( 1. png) Nosotros estamos interesados en una propiedad particular de este rompecabezas. Conociendo un intento ysu retroalimentación, ¿cuántas combinaciones de colores son consistentes con la respuesta? Por ejemplo, imagina un juego con 9 colores y 3 posiciones. Hacemos el intento \" azul, rojo, verde\" y recibes lainformación de 1 color correcto en el lugar correcto y 2 colores correctos en lugares incorrectos. ¿Cuántas combinaciones son consistentes con esto? En otras palabras, ¿cuántos posibles códigos secretos existen queregresen esta retroalimentación? En este caso, hay exactamente 3 códigos secretos que dan esta retroaliemtaciónpara este particular intento: * Azul, verde, rojo* Verde, rojo, azul* Rojo, azul, verdeTu tarea es precisamente descubrir cuál es éste número. Dado un intento y su retroalimentación, tu tareaes escribir cuántos códigos secretos son consistentes con esta información. En este particular problemaestamos solo interesados en juegos con 9 colores, de 2 a 5 posiciones. Para simplificarlo, representaremos loscolores como números, empezando desde el 1 y terminando con 9. El azul será el número 1, el rojo el 2 y así( nota que no importa que color es asignado a cada número; lo importante es que un número diferente representa un color diferente)",
    "input": "La primera línea de la entrada contiene un único entero N, indicando el número de casos ( 1< = N< = 30) . Para las siguientes N líneas, cada una contendrá un caso separado en 3 partes por un espacio. Cada caso comienza con un intento de respuesta válido, en forma de una cadena de dígitos ( recuerda que los colores están codificados con dígitos del 1 al 9) . Cada cadena tendrá de 2 a 5 dígitos. Despúés viene laretroalimentación recibida en forma de 2 números enteros: el primero representa el número de colores correctos en lugares correctos, y el segundorepresenta el número de colores correctos en lugares incorrectos.",
    "output": "Para cada caso deberás imprimir en una línea el número de posibles códigos secretos que dan esa retroalimentación para ese intento en particular. Recuerdaque siempre son 9 colores diferentes y que el tamaño del código secreto debe ser igual al tamaño del intento",
    "note": "",
    "topics": [
      "implementation",
      "constructive algorithms",
      "number theory"
    ],
    "id": 6331
  },
  {
    "title": "Combinaciones",
    "url": "https://omegaup.com/arena/problem/Combinaciones",
    "history": "Calcular el número exacto de formas en que se pueden tomar N cosas, M a la vez puede ser un gran desafío cuando N y/ o M se vuelven muy grandes. Los desafíos son atractivos en los concursos de programación. Por lo tanto, se te pide hacer el siguiente cálculo: Dados* 5 ≤ N ≤ 100* 5 ≤ M ≤ 100* M ≤ NCalcula el valor exacto deC = N! / ( N- M) ! × M! Puedes considerar que el valor final de C cabrá en un entero de 64. Sólo como referencia, ¡el valor exacto de 100! es: 93, 326, 215, 443, 944, 152, 681, 699, 238, 856, 266, 700, 490, 715, 968, 264, 381, 621, nbsp; nbsp; nbsp; nbsp; nbsp; 468, 592, 963, 895, 217, 599, 993, 229, 915, 608, 941, 463, 976, 156, 518, 286, 253, nbsp; nbsp; nbsp; nbsp; nbsp; 697, 920, 827, 223, 758, 251, 185, 210, 916, 864, 000, 000, 000, 000, 000, 000, 000, 000",
    "input": "Recibirás dos números indicando los valores de N y M, respectivamente.",
    "output": "Muestra el valor de C",
    "note": "",
    "topics": [
      "math",
      "combinatorics",
      "number theory",
      "implementation"
    ],
    "id": 6248
  },
  {
    "title": "Fibonaccis rápidos",
    "url": "https://omegaup.com/arena/problem/fast-fibos",
    "history": "Este problema consiste en calcular los números de la serie de Fibonacci, considerando: f( 0) = 0f( 1) = 1f( n) = f( n- 1) + f( n- 2) Sólo que ahora, tendrás que calcularlos muy rápido.",
    "input": "Recibirás un único valor de entrada N ( 0 ≤ N < 1000000)",
    "output": "Para cada valor de N, mostrar f( N) mod 100000009. Esto debido a que de otra forma, los números serán demasiado grandes.",
    "note": "",
    "topics": [
      "matrices",
      "math",
      "number theory"
    ],
    "id": 6246
  },
  {
    "title": "MrK07. La última, larga vida a Krista",
    "url": "https://omegaup.com/arena/problem/Larga-vida-a-Krista",
    "history": "# DescripcionMrKrista se ha convertido en un astronauta del Imperio del Jefe Supremo C+ + . Este mandatario lo ha mandado junto a un grupo l de compañeros a unaimportante misión al planeta Marte, vaya sorpresa se encontró nuestro protagonista, pues encontró vida extraterrestre! Al avisar al jefe C+ + , este dijo: \" El objetivo es sencillo a partir de ahora: Identifique, la naturaleza de estos seres, sin embargo, solo tiene p días para hacer su investigación, pues el cohete está programado para su regreso sin posibilidad de interrumpirlo\" . # ProblemaDado tres números iniciales n, m y k; donde n y m son las dimensiones de el territorio que Krista revisará, se encontrarán k posiciones, todas y cadauna de ellas con dos datos x y y, que remarcan las posiciones de los alienígenas, determina su movimiento tomando en cuenta la siguiente nota enviada porel Mariscal Serpiente: * El estado de los aliens evoluciona a lo largo de unidades de tiempo discretas ( se podría decir que por turnos) . La posición de todos los miembros se tiene en cuenta para calcular el estado de los mismos al turno siguiente. Todas las células se actualizan simultáneamente en cada turno, siguiendo estas reglas: * Un alien nace ( como las papas) con exactamente 3 aliens vecinos presentes ( es decir, al turno siguiente habrá un alien) . * Una alien vivo con 2 ó 3 vecinos vivos sigue vivo, en otro caso muere o permanece muerto ( por \" soledad\" o \" superpoblación\" ) . * * NOTA: Un alien en la casilla x, y puede tener hasta 8 vecinos, en todos los puntos cardinales. Tenga cuidado.",
    "input": "Se darán el la primera línea tres números n, m y k, luego k pares de números, uno por línea, donde se presenta x y y. Luego de los k pares, finitos números 0' s y 1' s, donde un 1 significa que Krista puede pasar al siguiente día, en caso de un 0, Krista debe regresar a casa, y mostrar la últimafoto de como estaban acomodados los aliens.",
    "output": "Un arreglo bidimensinal de n * m, donde se represente con una 0 en caso de no haber aliens o que estos estén muertos, y un 1 en caso de que estén vivos, todo esto, tras pasar los días representados por los unos. | | input10 10 35 55 65 711111110| | output0000000000000000000000000000000000010000000001000000000100000000000000000000000000000000000000000000| | end# Límites3< = n, m< = 1, 000, 0000< = k< = 35000001< = x, y< = 10, 000( 1 ́s ) < = 999, 999\" Éxito, puedes hacerlo! : D\" . \" Auf Wiedersehen. . . \"",
    "note": "",
    "topics": [
      "graph matchings",
      "implementation",
      "number theory",
      "strings",
      "dfs and similar",
      "dp",
      "graphs",
      "constructive algorithms",
      "games"
    ],
    "id": 6198
  },
  {
    "title": "Factorización Prima",
    "url": "https://omegaup.com/arena/problem/Puertas-del-Tiempo",
    "history": "Es el problema clásico de factorización prima de T números, ¡cuidado con los límites! .",
    "input": "Un entero T seguido de T enteros X, Puedes suponer que 1 ≤ T ≤ 100, 2 ≤ X ≤ 2^ 63- 1",
    "output": "La factorización prima de X_ i",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 6193
  },
  {
    "title": "Desarrollos Binomiales",
    "url": "https://omegaup.com/arena/problem/COMI_Binomios",
    "history": "Un binomio es una expresión algebráica compuesta por dos términos distintos, por ejemplo, x+ y es un binomio. Cuando elevamos un binomio a una potencia n, donde n es un entero no negativo, obtenemos diferentes expresiones algebráicas dependiendo del valor de n. Por ejemplo, para n= 1, 2, 3 obtenemos las siguientes expresiones: ( x+ y) ^ 1= x+ y ( x+ y) ^ 2= x^ 2+ 2xy+ y^ 2 ( x+ y) ^ 3= x^ 3+ 3x^ 2y+ 3xy^ 2+ y^ 3 Tu tarea para este problema es, que dado el exponente n, encuentres el desarrollo de ( x+ y) ^ n tomando en cuenta las siguientes consideraciones: - Si el exponente de alguna de las variables es 0, entonces omitimos la variable, de modo que x^ 0y lo escribimos como y. - Si el exponente de alguna de las variables es 1, entonces omitimos el exponente, de modo que x^ 1 lo escribimos como x. - Si el coeficiente del término es 1, entonces lo omitimos, de manera que 1x lo escribimos como x.",
    "input": "Un entero n, el exponente a elevar del binomio x+ y.",
    "output": "La expansión del binomio ( x+ y) ^ n. Los términos deberán imprimirse en una sola línea sin espacios y tomando en cuenta las anteriores consideraciones. Los exponentes se deberán imprimir anteponiendo el carácter ` ^ ` .",
    "note": "",
    "topics": [
      "combinatorics",
      "implementation",
      "number theory"
    ],
    "id": 6121
  },
  {
    "title": "Sumando y reduciendo fracciones",
    "url": "https://omegaup.com/arena/problem/Suma-reduce-fracciones",
    "history": "Para este problema, tendrás que leer parejas de números que representan fracciones. Tu tarea es obtener la suma de todas las fracciones y mostrarlas en forma reducida. Por ejemplo si la entrada es: < code> 2 2 < / code> < code> 3 4 < / code> < code> 4 5 < / code> < code> 4 3 < / code> < code> 3 4< / code> supongamos que se usa el algoritmo común ( sin reducir la fracción) , se obtendría: < code> 2224 / 480< / code> Pero usando las fracciones reducidas se debe llegar a: < code> 139 / 30< / code>",
    "input": "Tu programa procesará parejas de números hasta EOF. Se garantiza que los números son enteros con signo de 32 bits. No hay divisores con valor 0. Y el resultado es una fracción válida. Cuando una fracción es negativa, el signo * * - * * aparece a la izquierda del numerador.",
    "output": "Mostrar la fracción reducida como dos enteros que la representan. Si el número fraccionario es negativo, el signo deberá acompañar al numerador. El numerado y denominador deberán estar separados por el símbolo * * / * * habiendo un espacio entre éstos y el símbolo.",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 6024
  },
  {
    "title": "¿Primo o Compuesto?",
    "url": "https://omegaup.com/arena/problem/Primo-o-Compuesto",
    "history": "Dado un entero N, determina si se trata de un número primo o un número compuesto. * Un número primo es aquel que solo se puede dividir entre sí mismo y entre la unidad. * Un número compuesto es producto potencias de primos, si un número no es primo, entonces es compuesto.",
    "input": "Recibirás el entero N",
    "output": "Debes imprimir PRIMO si el número lo es, en caso contrario imprime COMPUESTO# Ejemplos| | input11| | outputPRIMO| | description| | end| | input24| | outputCOMPUESTO| | description( 2^ 3) * ( 3^ 1) | | end",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "number theory"
    ],
    "id": 5952
  },
  {
    "title": "CB-Intro-Factorial",
    "url": "https://omegaup.com/arena/problem/CB-Intro-Factorial",
    "history": "La función _ factorial de n_ escrito normalmente como n! se define como el producto de todos los números naturales desde 1 hasta n. Es dedirn! = 1 * 2 * 3 * . . . * ( n- 2) * ( n- 1) * nPor definición 0! = 1# TareaEscribe un programa que dado n calcule el valor de n! .",
    "input": "Tu programa deberá leer del teclado un único número entero, n.",
    "output": "Tu programa deberá escribir en la pantalla un único número entero, el valor de n! .",
    "note": "",
    "topics": [
      "implementation",
      "math",
      "number theory"
    ],
    "id": 5721
  },
  {
    "title": "Dividiendo en bases",
    "url": "https://omegaup.com/arena/problem/Dividiendo-en-bases",
    "history": "Dado un numero entero n con k dígitos en base a. Deberás decir si a+ 1 divide a n.",
    "input": "El número k de dígitos que tendrá n. El número a. El número n.",
    "output": "Un solo valor de salida con * * S* * si a+ 1| n ó * * N* * si no lo hace",
    "note": "",
    "topics": [
      "math",
      "number theory"
    ],
    "id": 5594
  },
  {
    "title": "Números odiosos",
    "url": "https://omegaup.com/arena/problem/Numeros-odiosos",
    "history": "Un día en el Instituto Tecnológico de Veracruz, en la biblioteca Barcenas y Lupita encontraron un libro interesante sobre Teoría de Números en el cual venían un secuencia de números odiosos, el cual un número odioso se define como un número tal que la cantidad de 1' s en su representación binaria sea * * Impar* * . < center> ! [ Números Odiosos] ( odious. jpg) < / center> Entonces, ellos te piden ayuda para encontrar el enésimo número Odioso.",
    "input": "La primera linea contiene un número entero T ( 1 < = T < = 10^ 3) que indica la cantidad de casos de prueba, por cada caso de prueba contiene un número N ( 1 < = N < = 10^ 18) que indica el enésimo número odioso.",
    "output": "Por cada caso de prueba imprimir el enésimo número odioso.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 5569
  },
  {
    "title": "Stevie y los números malvados II",
    "url": "https://omegaup.com/arena/problem/Stevie-y-los-numeros-malvados-II",
    "history": "En un día lluvioso, nuestro amigo Stevie, leyendo sus libros de Teoría de Números se encontró con el siguiente enunciado: \" Un número N es llamado Malvado si la suma de su dígitos en binario es Par. \" Le ha dado tanta curiosidad, que ha escrito los primeros 5 números malvados; enlistados a continuación: 0, 3, 5, 6, 9. Y como sabemos, nuestro amigo Stevie es muy curioso y nos ha pedido encontrar la Sumatoria de los números malvados contenidos en el rango [ A, B] , de la siguiente manera: m_ A + m_ A+ 1 + m_ A+ 2 + . . . + m_ BPor ejemplo del rango [ 2, 5] la sumatoria quedaría de la siguiente forma: 3 + 5 + 6 + 9 = 23.",
    "input": "La entrada consiste en varios casos, por cada linea, contiene dos números enteros 1 < = A < = B < = 10^ 9.",
    "output": "Por cada linea imprimir la sumatoria dado el rango A y B.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 5538
  },
  {
    "title": "Stevie y los números malvados I",
    "url": "https://omegaup.com/arena/problem/Stevie-y-los-numeros-malvados-I",
    "history": "En un día lluvioso, nuestro amigo Stevie, leyendo sus libros de Teoría de Números se encontró con el siguiente enunciado: \" Un número N es llamado Malvado si la suma de su dígitos en binario es Par. \" Le ha dado tanta curiosidad, que ha escrito los primeros 5 números malvados; enlistados a continuación: 0, 3, 5, 6, 9. Y como sabemos, nuestro amigo Stevie es muy curioso y nos ha pedido encontrar la Sumatoria de los números malvados contenidos en el rango [ A, B] , de la siguiente manera: m_ A + m_ A+ 1 + m_ A+ 2 + . . . + m_ BPor ejemplo del rango [ 2, 5] la sumatoria quedaría de la siguiente forma: 3 + 5 + 6 + 9 = 23.",
    "input": "La entrada consiste en varios casos, por cada linea, contiene dos números enteros 1 < = A < = B < = 10^ 5.",
    "output": "Por cada linea imprimir la sumatoria dado el rango A y B.",
    "note": "",
    "topics": [
      "games",
      "number theory",
      "math"
    ],
    "id": 5537
  },
  {
    "title": "Randy y los Divisores",
    "url": "https://omegaup.com/arena/problem/Randy-y-los-Divisores",
    "history": "¡Randy está en un grave peligro! Él está al borde de reprobar matemáticas discretas, y eso no puede suceder dado que perdería la beca. Randy quiere que le ayudes a hacer su tarea. La tarea consta de un único problema, que se describe a continuación. Se dice que b es divisible por a, si y solo si ∃ k ∈Z tal que a · k = b. Entonces a recibe el nombre de divisor de b. Por ejemplo, 12 tiene 6 divisores positivos. Los cuales son 1, 2, 3, 4, 6 y 12. Sea D( n) el número de enteros en [ 1, n] que tienen exactamente 4 divisores positivos. Entre 1 y 10 solo los enteros 6, 8, 10 tienen exactamente 4 divisores positivos. De modo que D( 10) = 3. Tu tarea es, dado n, calcular D( n) . ¡Ayuda a Randy a no perder la beca!",
    "input": "La primera y única línea contiene un entero n.",
    "output": "Imprime un solo entero denotando el número de enteros entre 1 y n con exactamente 4 divisores positivos.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 5536
  },
  {
    "title": "Stevie y los números Cuadrados",
    "url": "https://omegaup.com/arena/problem/Stevie-y-los-numeros-Cuadrados",
    "history": "Stevie es un chavo apasionado por la teoría de números, entonces leyendo encontró que un número N puede ser formado como la suma de tres o menos números triangulares. Dado a que el le encanta los números cuadrados, el quiere saber la cantidad mínima de números cuadrados que sumados de un número N.",
    "input": "La primera linea contiene los casos de entrada 1 < = T < = 10^ 4, en las T lineas siguientes contiene un número N ( 1 < = N < = 10^ 5) .",
    "output": "Por cada caso de prueba imprimir, la cantidad mínima de números cuadrados para poder expresar el número dado.",
    "note": "",
    "topics": [
      "divide and conquer",
      "dp",
      "number theory"
    ],
    "id": 5509
  },
  {
    "title": "MrKrista en Dinamarca",
    "url": "https://omegaup.com/arena/problem/MrKrista-en-Dinamarca",
    "history": "# DescripcionMrKrista ha sido descubierto en su fraude económico, sin embargo ha logrado escapar con vida de Alemania, ahora, como un hombre nuevo, empezará en en Dinamarca, como alumno del gran químico Bohr. # ProblemaNielhs Bohr está a punto de aplicar su conocimiento para dejar sellada su fórmula final para determinar la existencia de átomos en un determinado elemento, elcual esta determinado por la formula 2n_ 2, en donde el tiene un determinado numero de átomos de un elemento, y otro m numero de pipetas en donde puede colocarn números de átomos, y desafortunadamente Bohr tiene que transportar sus átomos en pipetas.",
    "input": "Dada n numero de átomos y m número de pipetas, determine hasta cuantos atomos pueden depositarse en cada pipeta para bombardear el elemento deseado. Nota: Si le sobran átomos sin transportar, a Bohr le cobran comisión, por lo tanto desea tranportar tantos átomos como pueda en cada pipeta.",
    "output": "El maximo numero de atomos a transportar por pipeta| | input1830 1170| | output30| | end",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 5274
  },
  {
    "title": "888",
    "url": "https://omegaup.com/arena/problem/888",
    "history": "Directo al grano, tu trabajo es encontrar el N- ésimo número cuyo cubo termina en los dígitos 888.",
    "input": "Primero una linea con un número T la cantidad de casos de prueba. Las siguientes T lineas contienen un entero N.",
    "output": "Para cada linea de entrada, una linea con el N- ésimo número cuyo cubo termina en 888.",
    "note": "",
    "topics": [
      "constructive algorithms",
      "implementation",
      "math",
      "number theory"
    ],
    "id": 5259
  },
  {
    "title": "Último Dígito de Néstor",
    "url": "https://omegaup.com/arena/problem/Ultimo-Digito-de-Nestor",
    "history": "Néstor está haciendo su tarea de matemáticas. Una actividad en la que ha tenido que hacer muchas operaciones en los últimos tres días y está muy cansado. La tarea es que dado dos números A y B quieren encontrar el último dígito de A ^ B. Debes ayudar a Néstor con esta tarea. Se darán dos números: la base A ( 0 ≤ A ≤ 20) y el índice B ( 0 ≤ B ≤ 2147483000) .",
    "input": "La primera línea de la entrada contiene un número 1 ≤ T ≤ 100, el número de casos de prueba. Las líneas T siguen. Para cada caso de prueba, una línea con A y B separados por un espacio.",
    "output": "Para cada caso de prueba debe imprimir una línea con el resultado. | | input23 106 2| | output96| | end",
    "note": "",
    "topics": [
      "number theory",
      "divide and conquer",
      "brute force",
      "math"
    ],
    "id": 5229
  },
  {
    "title": "Divisible 7",
    "url": "https://omegaup.com/arena/problem/Divisible-7",
    "history": "El comité Quinatanarroense se siente bondadoso este año, y en tu primer problema de lenguaje te pedirá que hagas algo muy fácil. Tu tarea consiste en identificar si un numero es divisible entre 7, es decir, si un numero al dividirlo entre 7 nos da algún otro numero entero. Sin embargo eso no es todo, tienes que identificar cuantos números son divisibles entre 7 de entre toda una lista de N números. # ProblemaDada una lista de N números identificar cuántos de ellos son divisibles entre 7 y arrojarlo como resultado.",
    "input": "En la primera línea un numero N que representa la cantidad de números a analizar. En la segunda línea tendrás N números aleatorios sin ningún orden.",
    "output": "Una única línea con un numero que representa la cantidad de números divisibles entre 7.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 5018
  },
  {
    "title": "Juanito y los primos",
    "url": "https://omegaup.com/arena/problem/Juanito-y-los-primos",
    "history": "Como ya varios saben, en Diciembre se celebra el preselectivo para la IOI 201x con x ∈N en Guanajuato. Pero lo que varios preseleccionados no saben, es que el deporte oficial del CIMAT es el ping pong. Por eso, durante el pre del 2017, Juanito se fugó con Briaares para jugar ping pong, pero cada juego, terminaba conpuntuaciones primas. Es decir, quedaban 11- 7, 11- 5, etc. Todos los juegos que quedaban con puntuaciones primas, Briaares era el ganador, y en caso contrario Juanito ganaba. En ping pong, cuando el marcador se iguala en 10, para ganar sube a 11 + λ, donde λ es el número de veces que se ha empatado en puntuación desde el 10- 10. Por lo que, como Juanitoquiere ganar a toda costa, necesita que las puntuaciones sean no primas. Pero el juego se ha alargado demasiado, al nivel de que las veces que ha empatado supera el trillón! El problema ahora, es que Juanito no sabe si las puntuaciones actuales son primos. Por lo que necesita de tu ayuda para saber si su puntuación es un primo. El lo programaría, perocomo se fugo de las clases de Ethan por jugar con el Briaares, ahora tiene que hacer los problemas que Ethan le dejó. # ProblemaDado un entero δ , decir si δ es primo o no.",
    "input": "La entrada consiste en un solo entero que representa la puntuación de Juanito.",
    "output": "Si δ no es primo, imprimir \" no es primo\" , en caso contrario imprimir \" si es primo\" .",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 4800
  },
  {
    "title": "Breviario Fibonacci",
    "url": "https://omegaup.com/arena/problem/Breviario-Fibonacci",
    "history": "Ana Paula está muy interesada en la sucesión de Fibonacci. Ella sabe que el primer término de la sucesión es el 0 y el segundo es el 1. También sabe que a partir de los dos primeros términos, se pueden calcular los siguientes términos usando la recursión F_ n= F_ n- 1+ F_ n- 2, es decir, F_ 0= 0 F_ 1= 1 F_ 2= 1+ 0= 1 F_ 3= 1+ 1= 2 . . . F_ n= F_ n- 1 + F_ n- 2 Aunque este procedimiento es muy fácil, es bastante tedioso, y Ana Paula de ninguna forma quiere ponerse a calcular todos los números de Fibonacci. Tu tarea es hacer un programa que dados tres números: n, m, y k, imprima F_ n, F_ m, y F_ k. # Nota: Para todos los casos se cumple que: 0 ≤ n, m, k ≤ 45",
    "input": "Tres números: n, m, y k, cada uno en una línea distinta.",
    "output": "El número de Fibonacci que corresponde a cada uno de los números leídos",
    "note": "",
    "topics": [
      "number theory",
      "implementation",
      "math"
    ],
    "id": 4630
  },
  {
    "title": "MCD de N números",
    "url": "https://omegaup.com/arena/problem/MCD-de-N-numeros",
    "history": "Deseas conocer el máximo común divisor de N números",
    "input": "Un entero N seguido de N líneas que representan los elementos de la lista.",
    "output": "Un entero que respresenta el máximo conún divisor de todos los números de la lista.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 4606
  },
  {
    "title": "Factorial hasta el 20",
    "url": "https://omegaup.com/arena/problem/Factorial-hasta-el-20",
    "history": "El factorial de un número positivo n está definido recursivamente como n! = n* ( n- 1) ! Con un caso base en el que 0! = 1. Encuentra el factorial de un número.",
    "input": "Un número entero positivo n. 0 ≤ n ≤ 20",
    "output": "El factorial de ese número",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "number theory"
    ],
    "id": 4483
  },
  {
    "title": "El clásico problema de big mod",
    "url": "https://omegaup.com/arena/problem/El-clasico-problema-de-big-mod",
    "history": "Dados tres numeros b, p y m, imprime \" Si\" ( sin las comillas) si b^ p ≡ 0 ( m)",
    "input": "Tres enteros, b, p, y m.",
    "output": "Imprime \" Si\" o \" No\" segun el caso.",
    "note": "",
    "topics": [
      "math",
      "number theory"
    ],
    "id": 4216
  },
  {
    "title": "Factorial de ASINUS",
    "url": "https://omegaup.com/arena/problem/Factorizar-de-ASINUS",
    "history": "La maestra de matematicas esta enojada > : v, porque los shabos no saben como sacar el factorial de un numero asi que deja una tarea voluntaria ( voluntariamente a fuerzas) y pues como tienes mucho tiempo libre pues dices porque no hago un programa que alfin y alcabo voy a terminar aprendiendo ( : v.",
    "input": "Se ingresa un numero * * N* * y recuerda que factorial de 1 es 1 y factorial de 0 es 1* * 0> = N< = 30* *",
    "output": "Debe salir el numero y si sale con potencia se debe usar * * e* * # Ejemplos| | input0| | output1| | input1| | output1| | input6| | output720| | input30| | output2. 65253e+ 032| | end",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 3923
  },
  {
    "title": "Divisores de N!",
    "url": "https://omegaup.com/arena/problem/Divisores-de-N",
    "history": "Para que no pierdas mas tiempo leyendo tantos problemas, los organizadores serán buena onda y pondrán al menos este problema con redacción corta. Es un problema fácil de entender, pero de responder, quién sabe. Tu tarea consiste en calcular cuantos divisores tiene el factorial de un número N. El factorial de un número es la multiplicación de todos los números de 1 a N, por ejemplo 4! = 1×2×3×4 = 24 y es divisible por 1, 2, 3, 4, 6, 8, 12, 24 por lo tanto tiene 8 divisores. ¿Suena fácil? , Pues bien, 0 le; N le; 1, 000, 000, ya no es tan fácil como se veía. . . ¿o si?",
    "input": "Una línea con un solo número entero N",
    "output": "Un único número entero, la cantidad de divisores en N! , como este número puede ser muy grande deberás imprimir su residuo( módulo) con el número 987654321",
    "note": "",
    "topics": [
      "number theory",
      "math"
    ],
    "id": 3755
  },
  {
    "title": "3 divisores",
    "url": "https://omegaup.com/arena/problem/3-divisores",
    "history": "Una propiedad de los números enteros es la de la divisibilidad. Un número aes un divisor de b si al dividir b por a, el residuo es cero. Porejemplo, el 15 es un divisor de 45 ya que al dividir 45 entre 15 nosobra ningún número. Los números primos son aquellos que solo tienen 2divisores, el 1 y ellos mismos. Existen números que tienen exactamente 3divisores, como el 4 que solamente es dividido por el 1, 2 y 4. Tutarea es crear un programa que dados 2 números p y q calcules cuantosnúmeros con 3 divisores existen entre p y q.",
    "input": "Dos enteros p y q separados por un espacio.",
    "output": "Un solo número con el resultado",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 3693
  },
  {
    "title": "Los caminos de Ulises",
    "url": "https://omegaup.com/arena/problem/Los-caminos-de-Ulises",
    "history": "Un día Ulises vio a Briares y le dijo: Oye chairo, a que no sabes cuántos caminos hay tales que no cruzan la diagonal en una cuadrícula de NxN. Y Briares le respondió: tú tampoco. Al llegar a su casa, Briares intentó hacer un programa que responda a la pregunta de Ulises, pero al no conseguirlo decidió pedirte ayuda. # ProblemaAyuda a Briares a resolver la pregunta de Ulises. Cuántos caminos hay tales que no cruzan la diagonal en una cuadrícula de NxN y van de la esquina inferior izquierda a la esquina superior derecha avanzando solo hacia a la derecha y hacia arriba. ! [ ] ( https: / / upload. wikimedia. org/ wikipedia/ commons/ thumb/ a/ a0/ Catalan_ number_ 3x3_ grid_ example. svg/ 525px- Catalan_ number_ 3x3_ grid_ example. svg. png)",
    "input": "Un entero N que representa las dimensiones de la cuadrícula.",
    "output": "La cantidad de caminos que existen tales que no cruzan la diagonal en módulo 1 000 000 007.",
    "note": "",
    "topics": [
      "number theory",
      "combinatorics",
      "math"
    ],
    "id": 3421
  },
  {
    "title": "Numeros Naturales a un Byte",
    "url": "https://omegaup.com/arena/problem/Naturales-Byte",
    "history": "Realice un programa que convierta números naturales a números binarios. Queremos convertir un número que sea mayor o igual que 0 y menor que 256, se representará el número en un número binarios de 8 dígitos",
    "input": "Un número natural que sea 0< = n< = 255",
    "output": "El número transformado a un número binario de 8 dígitos",
    "note": "",
    "topics": [
      "number theory",
      "bitmasks",
      "implementation",
      "constructive algorithms"
    ],
    "id": 3228
  },
  {
    "title": "Karel-En busca de la Karesmeralda",
    "url": "https://omegaup.com/arena/problem/en_busca-de_la_karesmeralda",
    "history": "Karel ha entrado a una piramide en busca de la gema karesmeralda. Sin embargo se encontró con varias gemas. Estas están talladas con un numero. Gracias a una expedición anterior sabe que busca la única tallada con el numero 3, si saca una equivocada y no la devuelve rápido se activara una trampa. Pero puede que alguien mas se la llevo antes que el así que deberá resignarse si no esta.",
    "input": "Karel esta situado en la avenida 1 y calle 1, orientado al norte. Enfrente de el esta todas las gemas sin espacios entre ellas. Estas están rodeadas a la derecha e izquierda con un muro. Tienen una casilla extra a un lado y al otro. Formando una sala cerrada( Karel sabra después como salir) .",
    "output": "Karel deberá estar encima del lugar de la gema y con esta en su mochila. Si no hay, estará en la siguiente calle ( fila) después de la ultima gema.",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 3176
  },
  {
    "title": "Fibonacci Facil",
    "url": "https://omegaup.com/arena/problem/Fibonacci-Facil",
    "history": "# Fibonacci 1La serie Fibonacci es una de las series más famosas, y tiene diversas aplicaciones en la computación. Incluso le sirvió a Robert Langdon para obtener la Fleur- de- lis en el código da Vinci, y así descubrir el tesoro del Priorato de Sion. La secuencia se construye de la siguiente manera. Los primeros dos elementos de la secuencia son f( 0) = 1 y f( 1) = 1. Los siguientes elementos se calculan mediante la suma de los dos elementos previos, por lo que: f( n) = f( n- 1) + f( n- 2) Escribe un programa que dado un número k, devuelva el número fibonacci f( k) .",
    "input": "Un sólo número k ( 1 ≤ k ≤ 20)",
    "output": "Un sólo número indicando f( k) # # Ejemplos| | input0| | output1| | input1| | output1| | input2| | output2| | end",
    "note": "",
    "topics": [
      "math",
      "number theory",
      "implementation"
    ],
    "id": 3152
  },
  {
    "title": " El Rey Caprichoso",
    "url": "https://omegaup.com/arena/problem/El-Rey-Caprichoso",
    "history": "Un Rey te ha obligado a cumplir la siguiente tarea de la hora de la cena o te cortará el cuello, ¿Que por qué? pues porque puede, su consejero te dará un número N y una lista de N números, tu tarea es encontrar la pareja de números cuyo máximo común divisor sea el máximo de todas las parejas, sin embargo, el consejero se da cuenta de que es posible que varias parejas cumplan esto, así que decide que de estas parejas elijas aquella cuyo mínimo común múltiplo sea el más grande. Al rey no le importa mucho la decisión de su consejero, después de todo el sólo quiere ver rodar cabezas.",
    "input": "En la primera línea el número N, en la siguiente línea N números: a0, a1, . . . , an- 1 la lista que te da el consejero",
    "output": "En la primer línea el mínimo común múltiplo de la pareja",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 2841
  },
  {
    "title": "Fibonacci-Básico",
    "url": "https://omegaup.com/arena/problem/Fibonacci-Basico",
    "history": "Dado un entero M, imprime todos los números de la serie de fibonacci menores a M. La serie de fibonacci se calcula: 1 2 3 5 8 13 21 34. . . Donde un elemento f_ i= f_ i- 1+ f_ i- 2",
    "input": "Una línea con el entero M.",
    "output": "Los números de la serie fibonacci menores a M, separados por un espacio. # Ejemplos# | | input26| | output1 2 3 5 8 13 21| | description| | end# Limites1 ≤ M ≤ 10^ 6",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "brute force",
      "number theory"
    ],
    "id": 2647
  },
  {
    "title": "Numeros Amigables",
    "url": "https://omegaup.com/arena/problem/Numeros-Amigables",
    "history": "Los griegos definieron una propiedad sobre los números naturales ( 1, 2, 3, . . . ) que establece que dos números son amigos si la suma de los divisores propios de uno da el otro. Los divisores propios de un numero natural N son aquellos que lo dividen exactamente y son menores a el. Por ejemplo los divisores propios del 6 son 1, 2, 3. Y los numeros 220 y 284 son amigos ya que 220= 1+ 2+ 4+ 71+ 142 y 284= 1+ 2+ 4+ 5+ 10+ 11+ 20+ 22+ 44+ 55+ 110 Se te dara una pareja de numeros, tu tarea es determinar si los numeros son amigos o no.",
    "input": "Dos numeros naturales a y b.",
    "output": "Un 0 si los numeros NO son amigos y un 1 si son amigos.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 2598
  },
  {
    "title": "MCD Euclides",
    "url": "https://omegaup.com/arena/problem/MCD-Euclides",
    "history": "El algoritmo de Euclides es un procedimiento para calcular el mcd ( máximo común divisor) de dos números. Los pasos son: - Se divide el número mayor entre el menor. - Si la división es exacta, el divisor es el mcd. - Si la división no es exacta, dividimos el divisor entre el resto obtenido y se continúa de esta forma hasta obtener una división exacta, siendo el último divisor el mcd. Por ejemplo si se requiere el mcd de 72 y 16: ! [ mcd de 72 y 16. ] ( ejem. png)",
    "input": "Dos enteros M, N separados por un espacio. Asume que M siempre es mayor a N.",
    "output": "el mcd de M y N. # Ejemplos# | | input72 16| | output8| | description| | end| | input173 7| | output1| | description| | end",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 2535
  },
  {
    "title": "Factoriales extremos",
    "url": "https://omegaup.com/arena/problem/Factoriales-extremos",
    "history": "Hugo el Hurón estaba resolviendo su tarea de matemáticas, pero como no le gusta hacer cálculos a mano, utilizaba su nueva calculadora OMI- 9000 que compró por 10 pesos en el Sistema de Transporte Colectivo Metro de la Ciudad de México. Pero llegó un momento en el que su calculadora no le ayudó de mucho, ya que no soportaba más de 6 dígitos para hacer operaciones ( no podía esperar mucho de una calculadora de 10 pesos) . Es por eso que requiere de un programa que le ayude a calcular la operación matemáticaN!",
    "input": "Una única línea con dos enteros positivos N y M.",
    "output": "El resultado de la operación N!",
    "note": "",
    "topics": [
      "implementation",
      "math",
      "number theory"
    ],
    "id": 2007
  },
  {
    "title": "Factorial base 2",
    "url": "https://omegaup.com/arena/problem/Factorial-base-2",
    "history": "# Factorial base kJulito quiere abrir una puerta de seguridad que tiene una pantalla donde tiene que teclear una contraseña. El sabe que la contraseña es un número. También sabe que ese número es generado con de la siguiente forma. En la pantalla aparecen dos números, N y K en base decimal, y el número de la contraseña es igual al número de ceros al final que tiene N! en base 2^ K. Sin embargo, el no ha podido resolver el problema aun, y si falla una vez más el sistema de seguridad cerrará esa puerta para siempre. Ayúdale a encontrar la solución a este problema.",
    "input": "Dos números N y K.",
    "output": "El número de la contraseña",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 1796
  },
  {
    "title": "Rambo III",
    "url": "https://omegaup.com/arena/problem/Rambo-III",
    "history": "En una de sus últimas misiones para rescatar prisioneros de guerra, Rambo fue rodeado por k vietnamitas. Afortunadamente, Rambo ha estado en este tipo de situaciones miles de veces y sabe exactamente como proceder: comenzará a girar disparando su M60 ( su ametralladora automática favorita) * * hasta agotar sus m municiones* * , esperando eliminar a la mayor cantidad posible de vietnamitas. En las películas, Rambo es capaz de eliminar a todos los vietnamitas que quiera, pero esto es la vida real! así que necesita saber en qué momento empezar a disparar su M60 para eliminar a la mayor cantidad de vietnamitas. La situación se ilustra en el ejemplo de la figura 1. Rambo está rodeado por los vietnamitas colocados en las casillas coloreadas de rojo. En este ejemplo, hay n= 12 casillas en total numeradas de 0 a n- 1 y hay k= 5 vietnamitas. Rambo comienza a girar en el sentido de las manecillas del reloj a partir de la posición 2 ( en esa posición hay un vietnamita) y su M60 disparará una bala cada d casillas hasta agotar sus m municiones. Por ejemplo, si d= 3 y m= 3 entonces disparará hacia las casillas 2, 5 y 8, eliminando a 3 vietnamitas. Pero si Rambo hubiera empezado apuntando hacia la casilla 10, hubiera eliminado solamente 2 vietnamitas ( en las casillas 10 y 1) y si hubiera empezado apuntando hacia la casilla 1 solamente habría eliminado a uno ( precisamente el de la casilla 1) . ! [ Figura 1] [ 1]",
    "input": "En la primera linea, los números n, d, k, m antesdescritos. En la segunda linea, k enteros en orden creciente, separados por espacios, indicando las posiciones de los k vietnamitas.",
    "output": "En la primera linea, el máximo número de vietnamitas que Rambo puede eliminar.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 1335
  },
  {
    "title": "Rambo II",
    "url": "https://omegaup.com/arena/problem/Rambo-II",
    "history": "En una de sus últimas misiones para rescatar prisioneros de guerra, Rambo fue rodeado por k vietnamitas. Afortunadamente, Rambo ha estado en este tipo de situaciones miles de veces y sabe exactamente como proceder: comenzará a girar disparando su M60 ( su ametralladora automática favorita) * * hasta agotar sus m municiones* * , esperando eliminar a la mayor cantidad posible de vietnamitas. En las películas, Rambo es capaz de eliminar a todos los vietnamitas que quiera, pero esto es la vida real! así que necesita saber en qué momento empezar a disparar su M60 para eliminar a la mayor cantidad de vietnamitas. La situación se ilustra en el ejemplo de la figura 1. Rambo está rodeado por los vietnamitas colocados en las casillas coloreadas de rojo. En este ejemplo, hay n= 12 casillas en total numeradas de 0 a n- 1 y hay k= 5 vietnamitas. Rambo comienza a girar en el sentido de las manecillas del reloj a partir de la posición 2 ( en esa posición hay un vietnamita) y su M60 disparará una bala cada d casillas hasta agotar sus m municiones. Por ejemplo, si d= 3 y m= 3 entonces disparará hacia las casillas 2, 5 y 8, eliminando a 3 vietnamitas. Pero si Rambo hubiera empezado apuntando hacia la casilla 10, hubiera eliminado solamente 2 vietnamitas ( en las casillas 10 y 1) y si hubiera empezado apuntando hacia la casilla 1 solamente habría eliminado a uno ( precisamente el de la casilla 1) . ! [ enter image description here] [ 1]",
    "input": "En la primera linea, los números n, d, k, m antesdescritos. En la segunda linea, k enteros en orden creciente ( a lo mas un vietnamita por casilla) , separados por espacios, indicando las posiciones de los k vietnamitas.",
    "output": "En la primera linea, dos enteros separados por un espacio indicando el máximo número de vietnamitas que Rambo puede eliminar y el número de la casilla hacia la que debe comenzar a disparar. Si hay mas de una posible casilla inicial, imprime la de menoríndice.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 1306
  },
  {
    "title": "Rambo",
    "url": "https://omegaup.com/arena/problem/Rambo",
    "history": "En una de sus últimas misiones para rescatar prisioneros de guerra, Rambo fue rodeado por k vietnamitas. Afortunadamente, Rambo ha estado en este tipo de situaciones miles de veces y sabe exactamente como proceder: comenzará a girar disparando su M60 ( su ametralladora automática favorita) esperando eliminar a la mayor cantidad posible de vietnamitas. En las películas, Rambo es capaz de eliminar a todos los vietnamitas que quiera, pero esto es la vida real! así que necesita saber en qué momento empezar a disparar su M60 para eliminar a la mayor cantidad de vietnamitas. La situación se ilustra en el ejemplo de la figura 1. Rambo está rodeado por los vietnamitas colocados en las casillas coloreadas de rojo. En este ejemplo, hay n= 12 casillas en total numeradas de 0 a n- 1 y hay k= 5 vietnamitas. Rambo comienza a girar en el sentido de las manecillas del reloj a partir de la posición 2 ( en esa posición hay un vietnamita) y su M60 disparará una bala cada d casillas. Por ejemplo, si d= 3 entonces disparará hacia las casillas 2, 5, 8, 11, 2, 5, 8, 11, 2, 5, . . . y así sucesivamente hasta agotar sus municiones ( * * en este problema, puedes suponer que la M60 tiene infinitas municiones* * ) . Bajo estas condiciones, Rambo eliminará a los vietnamitas de las casillas 2, 5 y 8. Pero si Rambo hubiera empezado apuntando hacia la casilla 1, hubiera eliminado solamente 2 vietnamitas y si hubiera empezado apuntando hacia la casilla 0. . . bueno, todos los vietnamitas se habrían divertido mucho viéndolo girar. ! [ Figura 1] [ 1]",
    "input": "En la primera linea, los números n, d, k antesdescritos. En la segunda linea, k enteros distintos separados por espacios, en orden creciente, indicando las posiciones de los k vietnamitas.",
    "output": "En la primera linea, dos enteros separados por un espacio indicando el máximo número de vietnamitas que Rambo puede eliminar y el número de la casilla hacia la que debe comenzar a disparar. Si hay mas de una posible casilla inicial, imprime la de menoríndice.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 1305
  },
  {
    "title": "Detective's Game",
    "url": "https://omegaup.com/arena/problem/Detectives-Game",
    "history": "# Detective’s GameAs you may know, Sherlock Holmes is a brilliant english detective and Professor James Moriarty his eternal archenemy. Moriarty has designed an excellent game for Sherlock to play, of course, he’s having fun making Holmes losing his mind discovering the answer of his evil puzzle. Professor Moriarty has kidnapped n people and put them in lethal traps all over London. He tells the following to Holmes: “Listen to me Sherlock, I have chosen an arbitrary number from 1 to n and you must guess that number in order to stop me. You can guess the number I choose as many times as you want, but for every guess, one of my traps will activate and we do not want anyone to get hurt, right? But that’s not a fair game, huh? For every guess you make, I’ll reveal you what is the greatest common divisor between your guessed number and the number I choose. The game is on, Holmes, you better play perfectly”. For example, if n= 6 Moriarty could choose any number between 1 and 6. Sherlock can find the number Moriarty choose in at most 2 guesses. The optimal strategy is: Sherlock guess 6. If Professor Moriarty says 1 then the chosen number cannot be 2, 3, 4 or 6, so the answer is 1 or 5, just check again with 5. In other case, Moriarty could say 2, then the answer must be 2 or 4. If Professor says 3, then the answer is 3. Finally, if Professor Moriarty answered 6, Holmes correctly guess the number on the first try. You must help Sherlock find the maximum number of guesses he must make if he plays optimally.",
    "input": "An unique line with an integer n ( 2 ≤ n ≤ 10, 000) .",
    "output": "The maximum number of guesses Sherlock must make in the worst case in order to stop Moriarty. # Example| | input6| | output2| | end",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 1263
  },
  {
    "title": "UltraPrimo",
    "url": "https://omegaup.com/arena/problem/UltraPrimo",
    "history": "# UltraPrimoLuis y Alma han decidido crear un divertido juego en el cual Alma elige un número y Luis debe decir si es un número UltraPrimo o no. Alma es algo tramposa por lo que Luis te ha encargado escribir un programa que verifique su respuesta y así Alma no pueda mentirle. Se dice que un número es UltraPrimo si la suma de sus dígitos es un número primo.",
    "input": "Un número entero M que representa la cantidad de números que Alma le presentará a Luis, las siguientes M_ i líneas contendrán un número entero que representa el número que Alma eligió en cada turno.",
    "output": "Para cada caso deberás imprimir si el número que eligió Alma es UltraPrimo o no. Si el número es UltraPrimo deberás imprimir * * \" UltraPrimo\" * * , de lo contrario se imprimirá * * \" No UltraPrimo\" * * .",
    "note": "",
    "topics": [
      "strings",
      "number theory"
    ],
    "id": 1165
  },
  {
    "title": "Sistema de ecuaciones diofantinas",
    "url": "https://omegaup.com/arena/problem/sed",
    "history": "Escribe un programa que determine la cantidad n de soluciones enteras que tiene el sistema de ecuaciones ax + by = c, dx + ey = f. Observa que es posible que este sistema no tenga ninguna solución entera ( es decir n = 0) o que tenga un número infinito de soluciones enteras ( en cuyo caso debes reportar n = - 1) . Por ejemplo, si a = 2, b = 1, c = 3, d = 2, e = 3, f = 1 entonces n = 1 ya que el sistema únicamente tiene la solución x = 2, y = - 1.",
    "input": "Seis números enteros a, b, c, d, e y f separados por espacios y todos ellos en el intervalo de - 1, 000, 000 a 1, 000, 000 ( incluyéndolos) .",
    "output": "Un número entero n.",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "number theory"
    ],
    "id": 1015
  },
  {
    "title": "Euclides y Euler",
    "url": "https://omegaup.com/arena/problem/eye",
    "history": "Dados dos enteros positivos p y q, su máximo común divisor es el entero positivo más grande que los divide a ambos exactamente y se puede calcular con el algoritmo de Euclides ( el cual puedes investigar cómo funciona casi en cualquier lugar) . Si el máximo común divisor de p y q es igual a 1, entonces se dice que p y q son primos relativos. La función φ( n) de Euler es igual a la cantidad de enteros en el intervalo del 1 al n que son primos relativos con n. Por ejemplo, φ( 9) = 6 debido a que 9 es primo relativo con los seis enteros 1, 2, 4, 5, 7 y 8. Escribe un programa que, dados dos enteros p y q, encuentre el máximo valor m que toma la función φ( n) de entre todos los enteros n en el intervalo de p a q, además del menor valor de n en ese intervalo tal que φ( n) = m. Por ejemplo, si p = 4 y q = 10 entonces φ( 4) = 2, φ( 5) = 4, φ( 6) = 2, φ( 7) = 6, φ( 8) = 4, φ( 9) = 6 y φ( 10) = 4 por lo que m = 6 y n = 7.",
    "input": "Dos números enteros p y q tales que 1 ≤ p ≤ q ≤ 1, 000, 000.",
    "output": "Un número entero m y un numero entero n.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 1012
  },
  {
    "title": "Fibonacci Rápido",
    "url": "https://omegaup.com/arena/problem/Fibonacci-Rapido",
    "history": "La secuencia de Fibonacci F se define comoF_ i = F_ i- 1 + F_ i- 2 para i > 1, conF_ 0 = 0, y F_ 1 = 1. Dado i, calcula F_ i 98765431.",
    "input": "Un entero, i.",
    "output": "F_ i 98765431.",
    "note": "",
    "topics": [
      "number theory",
      "math"
    ],
    "id": 906
  },
  {
    "title": "Karel",
    "url": "https://omegaup.com/arena/problem/karel",
    "history": "Karel se encuentra moviéndose dentro de un cuarto de W unidades horizontales por H unidades verticales, delimitado por paredes ( y sin paredes en el interior) . Las esquinas están numeradas de 0 a W- 1 horizontalmente de oeste a este ( izquierda a derecha) y de 0 a H- 1 verticalmente de sur a norte ( abajo a arriba) . En el cuarto hay K beepers. El movimiento de Karel depende de dos orientaciones: vertical y horizontal. La orientación vertical de Karel puede ser ' norte' o ' sur' y su orientación horizontal puede ser ' este' u ' oeste' . Karel está programado para dar X ' pasos horizontales' seguidos de Y ' pasos verticales' ( cuando no hay paredes que lo impidan) . Si Karel no puede dar un paso en una dirección debido a una pared, entonces en lugar de dar el paso, cambia su orientación. Por ejemplo, si Karel tiene orientación [ este, norte] y se encuentra en la posición [ x= 5, y= 5] , un ' paso horizontal' llevara a Karel a la posicion [ x= 6, y= 5] si no hay una pared al este de Karel. En cambio, si hubiera una pared al este de Karel, entonces un ' paso horizontal' lo dejaría en la misma posición [ x= 5, y= 5] pero su nueva orientación sería [ oeste, norte] . Análogamente, un ' paso vertical' llevaría a Karel a la posición [ x= 5, y= 6] si no hay pared al norte, y si hubiera pared al norte, entonces Karel permanecería en [ x= 5, y= 5] pero su nueva orientación seria [ este, sur] . Inicialmente, Karel se encuentra en la posición [ x= 0, y= 0] con orientación [ este, norte] . Luego de dar X pasos horizontales y Y pasos verticales, Karel verifica si está sobre un beeper y de ser asi lo recoge. Lo anterior se repite indefinidamente. Dadas las dimensiones H, W, del cuarto, el numero X y Y de pasos horizontales y verticales que da Karel y el numero K de beepers y sus posiciones ( x_ i, y_ i) . Determina el número de beepers que recogerá Karel.",
    "input": "En la primera linea los números W, H, X, Y, K separados por espacios. En las siguientes K lineas las posiciones x_ i, y_ i de los beepers.",
    "output": "En la primera linea el número de beepers que recogerá Karel.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 186
  },
  {
    "title": "Balanza",
    "url": "https://omegaup.com/arena/problem/balanza",
    "history": "# Balanza< img src= \" http: / / www. cimat. mx/ omar/ omegaup/ balanza. jpg\" width= 512> < / img> Tenemos una balanza con dos platos, izquierdo y derecho, que pesan G_ 1 gramos y G_ 2 gramos respectivamente. Queremos balancearla y para esto contamos con dos tipos de pesas. Las pesas de tipo 1 pesan A gramos y las pesas de tipo 2 pesan B gramos. Por ejemplo, en la figura el plato de la izquierda pesa G_ 1= 12 gramos, y el plato de la derecha pesa G_ 2= 8 gramos. Las pesas rojas pesan 7 gramos y las pesas verdes pesan 3 gramos. Una forma de balancear los platos es agregando 2 pesas rojas y 2 pesas verdes al plato de la izquierda ( para un total de 12+ 2× 7+ 2× 3 = 32) y agregando 3 pesas rojas y una pesa verde al plato de la derecha ( para un total de 8 + 3× 7 + 1× 3 = 32) . Escribe un programa que dados G_ 1, G_ 2, A y B, determine si es posible balancear los platos.",
    "input": "En cada caso de prueba, tu programa debe responder n preguntas. En la primera linea estará el número n. En cada una de las siguientes n lineas estarán los 4 números G_ 1, G_ 2, A y B.",
    "output": "Para cada una de las n preguntas, tu programa debe imprimir 1 si es posble balancear los platos y 0 si no es posible ( debes imprimir los dígitos en la misma linea, sin espacios) .",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 173
  },
  {
    "title": "Goldbach",
    "url": "https://omegaup.com/arena/problem/goldbach",
    "history": "# La conjetura de GoldbachLa conjetura de Goldbach nos dice que para todo número par positivo distinto a 2 se cumple que: X= P_ 1 + P_ 2, donde P_ 1 y P_ 2 son primosEs decir, todo número par puede ser representado como la suma de dos números primos, a excepción del 2. Es considerada una conjetura, puesto que no ha sido demostrado ni comprobado un porque, ni se ha encontrado algo que la contradiga. # ProblemaDado un número X, encontrar la pareja de números primos que incluya al número mas pequeño que cumpla con lo establecido. Por ejemplo: el 10 puede ser representado como 5+ 5 y 3+ 7. La pareja deseada es 3+ 7, ya que contiene un elemento menor al de la otra pareja.",
    "input": "| | output",
    "output": "| | input468100| | output2 23 33 53 7| | end# Límites* 4≤ X ≤ 5 × 10^ 6",
    "note": "* Un número primo es aquel que solo puede ser divido entre el 1 y entre sí mismo. El 1 no es considerado como un numero Primo.",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 156
  },
  {
    "title": "Jack el factorizador",
    "url": "https://omegaup.com/arena/problem/Jack-el-factorizador",
    "history": "Jack el Factorizador es un criminal en serie que ataca a números compuestos ( los números “compuestos” son los números < b> mayores que 1< / b> , que no son primos) . Cuando Jack el Factorizador ataca a un número compuesto, lo factoriza y deja en su lugar a sus factores primos. La pobre víctima queda irreconocible, pero al menos todos sus factores primos permanecen juntos. Jack el Factorizador acaba de atacar a algunos elementos de una lista de C números compuestos. El resultado fue una lista de N enteros positivos que podría contener números primos. Las autoridades locales necesitan determinar la identidad de todos los elementos de la lista original. Afortunadamente, Jack nunca ataca a dos números compuestos consecutivos en ninguna lista. Es decir, si Jack ataca a un número compuesto, nunca atacará a sus números compuestos adyacentes. Ayuda a las autoridades locales en su investigación de estos terribles crímenes determinando el número de elementos de la lista original.",
    "input": "En la primera línea, el número N de elementos en la lista final ( luego de los ataques de Jack el Factorizador) . En la segunda línea, los N enteros positivos { a_ i } separados por espacio.",
    "output": "En la primera línea, el número C de elementos en la lista original de números compuestos ( antes de los ataques de Jack el Factorizador) .",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14650
  },
  {
    "title": "The Real Party",
    "url": "https://omegaup.com/arena/problem/The-Real-Party",
    "history": "Los amigos Fan y Fun cumplen años el mismo día, y como era de esperarse, ambos están organizando juntos una gran fiesta. Para dar la bienvenida a sus invitados, tanto a Fan como a Fun se les ocurrió la idea de invitar caramelos. Fan compró a caramelos, y Fun b caramelos. Fan quiere dar a cada uno de sus invitados x caramelos de tal manera que, después de repartirlos, no quede ninguno de los a caramelos. Fun pretende hacer lo mismo, dará a cada uno de sus invitados y caramelos de tal manera que reparta todos los b caramelos comprados. Fan y Fun quieren que su fiesta sea inolvidable, es por ello que decidieron aplicar algunas condiciones extra: Fan y Fun darán a cada uno de sus invitados un número primo de caramelos, y además, ambas cantidades deben ser diferentes. Es decir, x e y son primos y x = ̸ yYa que el cumpleaños se acerca, los padres de Fan y Fun están preocupados por las peticiones tan excéntricas de sus hijos y se preguntan, ¿Será posible que Fan y Fun encuentren valores válidos para x e y?",
    "input": "La única linea de entrada consiste en 2 números enteros a y b, el número de caramelos que compraron Fan y Fun respectivamente.",
    "output": "Si existen valores válidos para x e y, imprimir * * \" Party\" * * ( sin comillas) y en una nueva linea los valores de x e y separados por un espacio. Caso contrario imprimir * * \" Sadge\" * * ( sin comillas) . En caso existan muchos valores válidos para x e y, imprimir cualquier respuesta.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12646
  },
  {
    "title": "Arreglo de primos",
    "url": "https://omegaup.com/arena/problem/Arreglo-de-primos",
    "history": "Un elemento básico en programación es la utilización de arreglos, por lo que se te pondrá a prueba para ello. Un profesor de matemáticas les cuestiono como saben si un número es primo, o no. Por lo que tendrás que demostrar que es muy fácil. A continuación, tendrás que encontrar números primos en un rango. Como entrada tendrás X números y un rango. Lo único que debe hacer el programa es calcular la cantidad de números primos que hay en dicho rango.",
    "input": "* Leer primero X. El dato X indica la cantidad de números que se leerán desde el teclado. En las siguientes X líneas se encuentran los datos de entrada. Al finalizar se tienen dos números enteros A y B, que indican el rango.",
    "output": "Imprima la cantidad de números que son primos en el rango desde A hasta B.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 9458
  },
  {
    "title": "Suma de muchos primos",
    "url": "https://omegaup.com/arena/problem/suma-muchos-p",
    "history": "Un número entero positivo p es primo si tiene exactamente dos divisores positivos: p y 1. Los números primos más pequeños son 2, 3, 5, 7 y 11. Además, y sólo para este ejercicio, consideraremos que el número 1 también es primo. Dado un número entero m, podemos escribirlo como suma de primos tan grandes como sea posible. Por ejemplo, si m = 10, lo podemos escribir como 7 + 3 ( porque 7 es el primo más grande menor o igual a 10 y 3 es primo) ; y si m = 27, lo podemos escribir como 23 + 3+ 1 ( porque 23 es el primo más grande menor o igual a 27, 3 es el primo más grande menor o igual al sobrante y finalmente sobra 1) .",
    "input": "Consiste de un número entero m que tendrá un valor entre 1 y 5000.",
    "output": "Consiste de una lista de números primos escritos en orden descendiente, que sumen m y estén separados por espacios.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 8583
  },
  {
    "title": "Cadenas de primos",
    "url": "https://omegaup.com/arena/problem/Cadenas-de-primos",
    "history": "Escribe un programa que calcule cuántas cadenas de N dígitos existen, tales que cada pareja de dígitos consecutivos ( subcadenas de tamaño 2) forman un número primo.",
    "input": "Un entero N. Puedes suponer que 2 ≤ N ≤ 15.",
    "output": "Un entero que sea el número de cadenas descritas.",
    "note": "",
    "topics": [
      "dfs and similar",
      "number theory"
    ],
    "id": 8547
  },
  {
    "title": "El ultimo teorema de Santy",
    "url": "https://omegaup.com/arena/problem/El-ultimo-teorema-de-Santy",
    "history": "Santy muy aburrido con su vida sin mucho que hacer, ha decidido plantear un teorema ( en realidad es una conjetura) . Pero el no cuenta con mucha creatividad así que es difícil. Para su buena suerte un día él escucha a uno de sus amigos decir una frase, la cual se expropia como su teorema, al cual lo nombró como su \" ultimo teorema\" porque se escucha cool. La frase decía: Todo número natural par mayor a 2 se puede descomponer como la suma de dos números primos. Como Santy no es matemático no busco forma de demostrar eso. Así que le dijo a Joel para ver si el podía demostrarlo; pero como todos buenos informáticos la forma en la cual lo demostraron ambos fue por casitos. Entonces, ellos plantearon poner esto como un problema para ver si la demostración por casitos funcionaba. # ProblemaSe te darán Q números pares mayores a dos, si se puede descomponer como la suma de dos primos saca cualesquiera dos primos que sumen ese número, si no se puede imprime dos \" - 1\" .",
    "input": "Un entero positivo Q que son cuantos casitos hicieron joel y santiagoEn las siguientes Q líneas un entero positivo que representa el casito.",
    "output": "La Q respuestas ( pares de números) , una por cada número N.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 8402
  },
  {
    "title": "Es o No es Primo",
    "url": "https://omegaup.com/arena/problem/Es-o-No-es-Primo",
    "history": "Edwin en su clase de matemáticas aprendió sobre los números primos, por lo cual la maestra le dejo una tarea y el debe decir si el numero N que le dan es un numero primo o no. Se puede decir que un numero es primo cuando la cantidad de divisores es igual a 2 ( https: / / es. wikipedia. org/ wiki/ N",
    "input": "En la primera linea un entero N.",
    "output": "La palabra \" SI\" si el numero ingresado es un numero primo, en caso contrario imprimir \" NO\" .",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 8240
  },
  {
    "title": "Criba",
    "url": "https://omegaup.com/arena/problem/COMI-Criba",
    "history": "La Criba de Eratóstenes es un algoritmo que permite hallar todos los números primos menores que un número natural dado n. Se forma una tabla con todos los números naturales comprendidos entre 2 y n, y se van tachando los números que no son primos de la siguiente manera: comenzando por el 2, se tachan todos sus múltiplos; comenzando de nuevo, cuando se encuentra un número entero que no ha sido tachado, ese número es declarado primo, y se procede a tachar todos sus múltiplos, así sucesivamente. El proceso termina cuando el cuadrado del mayor número confirmado como primo o no, lo es. ! [ Criba] ( criba. gif)",
    "input": "Se te dará k , en las siguientes k líneas se te dará una lista de k números.",
    "output": "Por cada número deberas imprimir * * SI* * si k_ i es primo y * * NO* * en caso contrario.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 6118
  },
  {
    "title": "Determina si es primo",
    "url": "https://omegaup.com/arena/problem/Determina-si-es-primo",
    "history": "Determina si un número es primo.",
    "input": "El número.",
    "output": "Escribir \" SI\" si el numero es primo, en caso contrario escribir \" NO\" .",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 6048
  },
  {
    "title": "Primos fractales",
    "url": "https://omegaup.com/arena/problem/Primos-fractales",
    "history": "Un primo fractal es un número primo tal que su representación en decimal consta de un único dígito, o bien, al partir su representación en dos mitades de la misma longitud, ambas mitades también son primos fractales. Escribe un programa que determine si un número es primo fractal.",
    "input": "Un entero N. Puedes suponer que 1 ≤ N < 100000000 y que su representación en base decimal consta de 1, 2, 4 u 8 dígitos.",
    "output": "Un 1 si N es primo fractal y un 0 en otro caso.",
    "note": "",
    "topics": [
      "dfs and similar",
      "dp",
      "number theory"
    ],
    "id": 5839
  },
  {
    "title": "Suma de primos",
    "url": "https://omegaup.com/arena/problem/Suma-de-primos",
    "history": "Un número entero p es primo si es positivo y sus únicos dos divisores positivos son 1 y p. Los números primos más pequeños son 2, 3, 5, 7 y 11. Algunos números enteros positivosno son primos, pero son la suma de dos números primos. Por ejemplo: 4 = 2+ 2, 8 = 5+ 3 y 9 = 7+ 2. Advierte que algunos números se pueden escribir - como suma de dos números primos- de más de una forma ( por ejemplo el 10 que puede escribirse 7 + 3 o 5 + 5) , pero nos basta con una de ellas. Dado un número entero n, podemos decidir si es primo o no y, en caso negativo, decidir si es la suma de dos primos o no.",
    "input": "Un número entero n que tendrá un valor entre 1 y 1 000 000.",
    "output": "Dos números enteros, p , q, separados por un espacio, tales que: si n es primo, entonces p = n, q = 0; si n es suma de dos primos p , q, entonces p ≥ q; y en caso contrario p = 0, q = 0. # Ejemplos| | input10| | output7 3| | input17| | output17 0| | input27| | output0 0| | end",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 5801
  },
  {
    "title": "occ04nssf25",
    "url": "https://omegaup.com/arena/problem/occ04nssf25",
    "history": "# Número PrimoUn número entero es primo si únicamente es divisible por 1 y por el mismo. Haga un programa que reciba como entradaun entero y diga si es primo o no. En caso de respuesta negativa debe dar el menor divisor diferente a 1 que tenga elnúmero.",
    "input": "Un número entero n.",
    "output": "SI si el número no es primo. NO seguido por el menor diferente a 1 ue tenta el número en caso contrario.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 3122
  },
  {
    "title": "Factorización prima",
    "url": "https://omegaup.com/arena/problem/Factorizacion-prima",
    "history": "Itzcoal ( El barbas) tiene ganas de ver cuál es la factorización prima de un número N, por lo cuál a solicitado tu ayuda, pues le ha dado una enfermedad denominada \" nenuco eruptitos\" . # ProblemaSe te dará como entrada un número N, tu deber es encontrar sus factores primos, por cada factor, deberá estar precedido por \" x \" , a excepción del último factor.",
    "input": "El número N.",
    "output": "Los factores primos del número. Cada factor debera estar precedido por \" x \" , a excepción del último factor, mira el ejemplo para mayor entendimiento. | | input12| | output2 x 2 x 3| | end| | input147| | output3 x 7 x 7| | end",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "number theory"
    ],
    "id": 2872
  },
  {
    "title": "Cuantos primos hay",
    "url": "https://omegaup.com/arena/problem/Cuantos-primos-hay",
    "history": "Imprimir la cantidad de numeros primos que hay desde 1 hasta N número. # NotaUn número primo es aquel que solo es divisible entre el 1 y el mismo.",
    "input": "1 solo número N.",
    "output": "La cantidad de numeros primos en el conjunto. En caso de que no haya númerosprimos imprimir: \" No existen numeros primos en la cantidad ingresada. \" sin las comillas. | | input10| | output4| | end",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 2591
  },
  {
    "title": "Primos gemelos",
    "url": "https://omegaup.com/arena/problem/Primos-gemelos",
    "history": "Se dice que un número entero positivo es primo si tiene exactamente dos divisores positivos distintos. Los números primos más pequeños son 2, 3, 5, 7 y 11. Dos números primos se dicen gemelos si difieren en 2. Las parejas de números primos gemelos más pequeñas son ( 3, 5) , ( 5, 7) , ( 11, 13) y ( 17, 19) . Dado un número entero m podemos encontrar la pareja ( p, q) de números primos gemelos tal que m ≤ p < q y que p es tan pequeño como sea posible. Por ejemplo, si m = 10 entonces p = 11 y q = 13.",
    "input": "La entrada consiste de un entero m que tendrá un valor entre 1 y 1, 000, 000, 000.",
    "output": "La salida consiste de los dos números enteros p y q separados por un espacio.",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 2395
  },
  {
    "title": "Primos y mas Primos",
    "url": "https://omegaup.com/arena/problem/PrimosYMasPrimos",
    "history": "Fuente: [ Abierto Nacional de Programación ANTS 2009] ( http: / / www. anpa. com. mx/ ) - RepechajeHistoria——–Los números primos fueron estudiados en la antigüedad por razones filosóficas. Hoy en día son usados en aplicaciones prácticas, especialmente los números primos grandes son usados en criptografía. Hay un número infinito de primos conocidos, sin embargo, el número primo más grande que se conoce es un número primo de Mersenne. Se dice que N es un número primo de Mersenne cuando N tiene la forma especial 2< sup> p< / sup> # 150; 1, donde P es también un número primo. Por ejemplo 7 es un número primo de Mersenne ya que 2< sup> 3< / sup> # 150; 1 = 7, y tanto 3 como 7 son números primos. Sin embargo, 2047 no es un número primo de Mersene porque aunque podemos darle la forma 2< sup> 11< / sup> # 150; 1 = 2047 y 11 es un número primo, 2047 = 23 * 89",
    "input": "—–Cada caso contiene un número * N* ( 1 ≤ * N* ≤ 10< sup> 6< / sup> ) del cual se tiene que decir si es primo de Mersenne.",
    "output": "——Para cada caso imprime la palabra SI o NO dependiendo si es número primo de Mersenne o no. Sample Input/ Output——————- | | input72047| | outputSINO| | end",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 2190
  },
  {
    "title": "Semiprimos",
    "url": "https://omegaup.com/arena/problem/semiprimos",
    "history": "Se dice que un número * n* es semiprimo si y solo sí es el producto de dos primos, no necesariamente distintos. Ejemplos de estos números son 4, 6, 9 y 77. # ProblemaEscribe un programa que dado un número * M* , calcule cuantos semiprimos hay * * estrictamente menores* * que * M*",
    "input": "Línea 1: Un número entero positivo * M* * * Ejemplo: * * | | input30| | end",
    "output": "Línea 1: El número de semiprimos menores que * M* * * Ejemplo: * * | | input10| | end# Límites1 ≤ * M* ≤ 10^ 7",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 1600
  },
  {
    "title": "Números Libres",
    "url": "https://omegaup.com/arena/problem/Numeros-Libres",
    "history": "# Numeros LibresDados dos números square- free a y b, determina si su producto también es square- free. Decimos que un número x es square- free si para todo primo p, p^ 2 no divide a x. Por ejemplo, 6 es square free porque el cuadrado de ningún primo lo divide. En cambio, 12 sí, porque 2^ 2 = 4 sí lo divide.",
    "input": "En la primera linea contiene un entero N el numero de casos a resolver. En las siguientes N lineas, dos numeros enteros a y b.",
    "output": "Para cada caso de prueba, decir \" SI\" ( sin comillas) si el producto de a y b es square- free, de caso contrario \" NO\" ( sin comillas)",
    "note": "",
    "topics": [
      "implementation",
      "math",
      "number theory"
    ],
    "id": 1301
  },
  {
    "title": "Las Meditaciones de Curiel",
    "url": "https://omegaup.com/arena/problem/Las-Meditaciones-de-Curiel",
    "history": "Curi, absorto en sus meditaciones, llegó a la que él considera una verdad profusamente trascendental: “si en tu canasto de mimbre traes una cantidad prima de mandarinas es más probable que, si una panda de ladrones te asalta, sus miembros se queden insatisfechos al ver que no pueden repartirse el botín de forma equitativa”. Como a Curi le interesa minimizar la felicidad de las pandas de ladrones de mandarinas, él solo transportará en su canasto cantidades primas de mandarinas. Anticipándose a la gran cantidad de fiestas y reuniones a las que planea asistir llevando por obsequio un canasto de mandarinas te pide tu ayuda para determinar si le será posible hacer esto dada la menor y la mayor cantidad de mandarinas que está dispuesto a obsequiar en cada fiesta. # ProblemaEscribe un programa que, dada la cantidad de fiestas a las que planea asistir Curi y la menor y la mayor cantidad de mandarinas que está dispuesto a regalar en cada una de estas, determine, para cada fiesta, cuantos regalos distintos podría hacer ( dos regalos se consideran distintos si contienen una cantidad distinta de mandarinas) .",
    "input": "- En la primera línea un número T. La cantidad de fiestas a las que planea asistir Curi. - En cada una de las siguientes T líneas, dos números l_ i y r_ i que representan la menor y la mayor cantidad de mandarinas que Curi está dispuesto a obsequiar en la i- ésima fiesta.",
    "output": "- En las primeras T líneas un número x_ i que represente la cantidad de obsequios distintos que Curi podría hacer el la i- ésima fiesta o la frase \" Será mejor que no asistas. \" ( sin comillas) en caso de que no hayan formas en que Curi pueda obsequiar mandarinas.",
    "note": "",
    "topics": [
      "number theory",
      "dp"
    ],
    "id": 15760
  },
  {
    "title": "Primésimos primos",
    "url": "https://omegaup.com/arena/problem/Primesimos-primos",
    "history": "Es bien sabido que los Primatitlenses tienen fama de orgullosos. Su mayor orgullo, que los distingue del resto de los números naturales, es ser números primos, por supuesto. Pero algo que no es tan bien sabido, es que existe un grupo de Primatitlenses aún más orgullosos y son la envidia de todo Primatitlán: los primésimos primos. Decimos que el k- ésimo número primo es es un “primésimo primo” si k es primo. Por ejemplo: El 2 no es un primésimo primo porque 2 es el 1er primo ( es decir, el “1- ésimo”) pero 1 no es primo. El 3 es un primésimo primo porque 3 es el 2do primo ( es decir, el “2- ésimo”) y 2 es primo. El 5 es un primésimo primo porque 5 es el 3er primo ( el “3- ésimo”) y 3 es primo. ¿Qué tan “especiales” serán estos orgullosos primos? O más precisamente, dado un número N, ¿Cuántos primésimos primos menores o iguales que N existirán?",
    "input": "En la primera línea el número N.",
    "output": "En la primera línea el número de primésimos primos menores que N.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14630
  },
  {
    "title": "Los Perez y los García - Sumando Primos Secundaria",
    "url": "https://omegaup.com/arena/problem/Los-Perez-y-los-Garcia-Sumando2",
    "history": "Solicite la descripción de este problema a su profesor.",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14223
  },
  {
    "title": "Los Perez y los García - Sumando Primos AEDD",
    "url": "https://omegaup.com/arena/problem/Los-Perez-y-los-Garcia-Sumando1",
    "history": "Solicite la descripción de este problema a su profesor.",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14222
  },
  {
    "title": "Sumas de primos",
    "url": "https://omegaup.com/arena/problem/Sumas-de-primos",
    "history": "Se dice que un numero N positivo puede ser igual a la suma de dos numeros primos. Por ejemplo el numero 100 = 47+ 53 pero también 100= 11+ 89. Cómo se puede apreciar estos dos últimos números son el menor posible y el mayor primo posible",
    "input": "Un numero entero N",
    "output": "El menor y el mayor primo posible que sumados sean igual a N",
    "note": "",
    "topics": [
      "number theory",
      "implementation",
      "*special"
    ],
    "id": 12960
  },
  {
    "title": "Primos gemelos",
    "url": "https://omegaup.com/arena/problem/Selectivo2-OIEC-2021-P3-2",
    "history": "Últimamente has estado estudiando matemáticas y te tiene asombrado la conjetura de los primos gemelos, que dice lo siguiente: \" Existe un número infinito de primos p tales que p+ 2 también es primo. \" No puedes comprender cómo es posible que esta aseveración no ha sido demostrada. De hecho, estás convencido de que no solamente se cumple para p y p+ 2, sino que se cumple para p y p+ d, para cualquier valor de d par. Una noche, sin poder dormir pensando en esta conjetura, te lanzas a escribir un programa que de todas las parejas de primos con diferencia d, donde d es cualquier entero positivo ( no necesariamente par) .",
    "input": "En la primera línea el valor de n. En la segunda línea el valor de d ( no necesariamente par) .",
    "output": "Todas las parejas de primos menores a n con diferencia d. Cada línea consiste de dos números separados por un espacio, representando una pareja de números con diferencia d, con el primer número siendo el menor de la pareja. La salida debe cumplir que el primer número de cada línea es menor al primer número de la línea siguiente.",
    "note": "Puedes asumir que la salida siempre tendrá al menos una pareja de primos.",
    "topics": [
      "number theory"
    ],
    "id": 12851
  },
  {
    "title": "Las fracciones de Juanito",
    "url": "https://omegaup.com/arena/problem/Las-fracciones-de-Juanito",
    "history": "Juanito estaba en su clase de matemáticas cuando vió que la profesora utilizó la fracción 22/ 7 para aproximar el constante π. Se le hizo muy curioso ese dato, y al investigar más encontró que existe una cantidad infinita de aproximaciones de π, como 355/ 113 y 245850922/ 78256779. Esto cumple para cualquier número irracional. Por ejemplo, √( 5) puede ser aproximada como 2889/ 1292 o 219602/ 98209. A Juanito le interesa la secuencia * * S* * de fracciones racionales que converge a un número irracional x. Esta secuencia empieza con la fracción más cercana a x con denominador de uno, y a partir de este valor se encuentra la siguiente fracción con mayor denominador que esta más cercana a x. Por ejemplo, dado x = √( 5) ≈ 2. 23606, la secuencia sería S = ( 2/ 1, 7/ 3, 9/ 4, 20/ 9, . . . ) . Esta secuencia no incluye fracciones como 4/ 2 o 11/ 5 porque estas no están más cercanas a √( 5) que otras fracciones con denominador más pequeño. Como Juanito es además fanático de los números primos, requiere tu ayuda para encontrar las fracciones de * * S* * con numerador y denominador primo. Sabe que esta secuencia es infinita, asi que solo te pedirá que encuentres fracciones con denominador menor a 10^ 6. # Límites0 < x < 10Para cada fracción A/ B en la salida, 1 ≤ A ≤ 10^ 71 ≤ B ≤ 10^ 6",
    "input": "El número irracional x",
    "output": "Una línea por cada fracción prima, donde se debe imprimir el numerador seguido por un signo * * / * * y el denominador de la fracción. Las fracciones deben ir ordenadas de menor denominador a mayor denominador. Se puede garantizar que para todos los casos de prueba, se tendrá que imprimir por lo menos una fracción",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12379
  },
  {
    "title": "Abigael vs Daniel",
    "url": "https://omegaup.com/arena/problem/Abigael-vs-Daniel",
    "history": "# Abigael vs DanielLos olímpicos Daniel y Abigael crearon un juego para pasar el rato mientras termina la cuarentena. El objetivo del juego es elegir el número con la mayor cantidad de factores primos diferentes que sea menor o igual a N. Durante una partida donde N era 1000, Daniel eligió el número 210. Confiado de su suerte, Abigael eligió el 999 pensando que ese número le haría ganar. Sin embargo, después de hacer los cálculos matemáticos, el ganador fue Daniel ya que 210 tiene 4 factores primos ( 2, 3, 5 y 7) mientras que 999 solo tiene 2 factores primos ( 3 y 37) . Después de muchas horas, se dieron cuenta que determinar quién era el ganador les tomaba demasiado tiempo y eso no era divertido. # ProblemaAyuda a Abigael y Daniel a saber quien fue el ganador del juego.",
    "input": "Dos números d y a que indican el número que eligió Daniel y Abigael, respectivamente.",
    "output": "En la primer línea, el nombre del ganador: ` Daniel` , ` Abigael` o ` Empate` . En la segunda línea la lista de factores primos del número que eligió Daniel, ordenados de menor a mayor. En la tercera línea la lista de factores primos del número que eligió Abigael, ordenados de menor a mayor. | | input210 999| | outputDaniel2 3 5 73 37| | input70 30| | outputEmpate2 5 72 3 5| | input4897 3216843| | outputAbigael59 833 7 51061| | end# Límites2 < = N < = 10^ 18",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 11613
  },
  {
    "title": "El k-ésimo número primo",
    "url": "https://omegaup.com/arena/problem/El-k-esimo-numero-primo",
    "history": "Escribe un programa que calcule el K- ésimo número primo.",
    "input": "Un entero K. Puedes suponer que 1 ≤ K ≤ 1000.",
    "output": "Un entero que es el K- ésimo número primo.",
    "note": "",
    "topics": [
      "number theory",
      "implementation"
    ],
    "id": 7100
  },
  {
    "title": "Primos menores a n",
    "url": "https://omegaup.com/arena/problem/Primos-menores-a-n",
    "history": "Hacer un programa que muestre los primeros N números primos.",
    "input": "Un entero N",
    "output": "Los números primos menores a N separados por un salto de linea.",
    "note": "",
    "topics": [
      "implementation",
      "math",
      "number theory"
    ],
    "id": 6046
  },
  {
    "title": "¿Dónde quedó el primo?",
    "url": "https://omegaup.com/arena/problem/findprime",
    "history": "Se le conoce como * número primo* a todo entero mayor a 1 que no posee divisoressalvo los triviales ( 1 y el mismo número) . Una propiedad tan simple, pero que asu vez les dota de importancia en diversos campos como la criptografía ycombinatoria. Encontrar primos nunca ha sido trivial, pero la llegada de las computadoras loha vuelto más sencillo. ¿Por qué no averiguas lo sencillo que es escribiendoun programa que dado un número n calcule el n- ésimo número primo ( empezandopor el 2) ?",
    "input": "Recibirás de entrada estándar una sola línea, la cual contiene el número enteron.",
    "output": "Imprime en salida entándar el n- ésimo número primo.",
    "note": "",
    "topics": [
      "implementation",
      "number theory",
      "brute force"
    ],
    "id": 4062
  },
  {
    "title": "Números Primos",
    "url": "https://omegaup.com/arena/problem/Numeros-primos",
    "history": "Los números primos tienen una gran utilidad en la seguridad y protección de datos, entre otras muchas aplicaciones. Un número primo es un número entero mayor que 1 que únicamente puede ser dividido por el mismo número y la unidad. Los números primos menores que 100 son los siguientes: 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89 y 97. # ProblemaEscribe un programa que lea dos enteros A y B, donde 0 < A < B < 1000000000 y se generen todos los números primos en forma ascendente, que se encuentren en dicho intervalo. En este problema se pretende que escribas un algoritmo con algunas optimizaciones básicas, por lo que el tiempo de ejecución debe satisfacer las condiciones establecidas. ( Sugerencia: al probar los divisores de un número para determinar si es primo o no, no es necesario considerar a todos los números menores que este) .",
    "input": "En la primera linea dos valores A y B enteros, separados por un espacio; que representen el límite inferior y el límite superior del intervalo en el que se van a generar números primos.",
    "output": "Una secuencia de todos los números primos que se encuentren en el intervalo cerrado [ A, B] ordenados ascendentemente y separados por un espacio.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 2589
  },
  {
    "title": "Esto no es un simulacro",
    "url": "https://omegaup.com/arena/problem/EstoNoEsUnSimulacro",
    "history": "Chicago 9: 36 a. m. Suenan las alarmas de uno de los rascacielos mas altos de la ciudad. El sistema electrico comienza a fallar, todo es confusion y el panico se apodera de la gente. Una bomba exploto en los primeros pisos del edificio y parece que este va a colapsar, la unica manera de salir de el es saltando por las ventanas. Los bomberos, policias y equipos de rescate hacen lo imposible por salvar vidas, pero son demasiados para salvarlos a todos. Surge un plan. Salvar unicamente a todas aquellas personas que se lancen desde un piso * n* , donde la sucesion de * 1* hasta * n* contenga una cantidad de numeros primos que sea multiplo del piso donde se lanzo. Parece confuso, pero aqui el ejemplo: Una persona se lanza del piso 27, en la sucesion de 1 a 27 ( incluyendo 1 y 27) hay 9 numeros primos, 9 es multiplo de 27, entonces la gente de ese piso sera salvada. Tu deberas decir a que gente salvar, asi como decir el numero de sobrevivientes y personas que perdieron la vida. La primera linea de entrada sera un numero * P* con el total de casos que debes evaluar, seguido de * P* lineas donde cada una tendra el numero de personas que hay en ese piso y el numero de piso donde se encuentran separados por un espacio. El numero de piso sera 0 < * n* < 1000. En la salida deberas imprimir \" * SERA SALVADA* \" o \" * NO LA SALVEN* \" de acuerdo sea el caso. Despues de lo anterior deberas imprimir el numero de sobrevivientes y en la siguiente linea el numero de decesos. | | input6256 27341 100321 915 7152 98253 67| | outputSERA SALVADASERA SALVADANO LA SALVENNO LA SALVENNO LA SALVENNO LA SALVEN597741| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 2209
  },
  {
    "title": "Primos",
    "url": "https://omegaup.com/arena/problem/conacup_primos",
    "history": "# # PrimosHay problemas que ni son complicados, ni necesitan explicaciones complejas. Digamos que en uno de esos momentos de ocio en los que la gente se pone a pensar en la inmortalidad del cangrejo a los programadores nos da por resolver el siguiente tipo de problemas por el puro gusto de hacerlo: alguien nos da una lista de N números y pregunta cuántos números primos hay entre 1 y cada número de dicho listado. Claro que lo menos que podemos hacer es escribir un programa que responda dicha pregunta en todos los casos. # Problema: En la primera línea un numero 1 < = N < = 5, 000 a continuación N líneas con un numero 1 < = K < = 50, 000, 000 en cada línea. Debes regresar N líneas en cada una un número indicando cuántos números primos positivos hay menores a K. En el 20",
    "input": "21020",
    "output": "48# Nota: En matemáticas, un número primo es un número natural mayor que 1 que tiene únicamente dos divisores distintos: él mismo y el 1.",
    "note": "",
    "topics": [
      "number theory",
      "implementation",
      "divide and conquer",
      "data structures",
      "math"
    ],
    "id": 619
  },
  {
    "title": "La AMDM",
    "url": "https://omegaup.com/arena/problem/La-AMDM",
    "history": "La Asociación Mundial Del Mar ( AMDM) quiere darse a conocer al público y para ganar notoriedad está preparando un show marítimo en el cuál van a realizar juegos competitivos y como premio van a regalar muchas lanchas. Asistirá gente de todos los lugares del mundo, así que para mantener una buena organización, el evento se realizará a la costa de una playa, teniendo cada grupo de personas su lugar en la playa. # ProblemaConcretamente, a lo largo de la playa hay una línea de N grupos de personas, cada grupo tiene una cantidad de personas distinta. Durante el día, irán armando juegos, para lo cuál necesitarán seleccionar distintos grupos de personas a lo largo de la playa para competir. Específicamente, cada vez que organicen un juego, sonarán la campana y tomarán una * * sección* * de la línea de N grupos de personas, comenzando en el grupo l y terminando en el grupo r, de tal forma que todas las personas que estén en un grupo i tal que l ≤ i ≤ r serán participantes. Durante el juego se van a tomar a todas las personas participantes para formar equipos, el problema es que la AMDM no sabe cómo repartir los equipos de forma que sea justa y no haya estafas, por lo que cada vez que armen un juego necesitan que les respondas la pregunta: ¿Cuántos tamaños posibles de equipo podemos formar, de forma que cada equipo tenga la misma cantidad de personas? Por ejemplo, si los grupos elegidos para competir son conformados por [ 3, 7, 6] * ( un grupo de 3 personas, un grupo de 7, y un grupo de 6) * entonces tenemos 16 personas en total. Tenemos 4 posibles tamaños de equipo. * 16 equipos de 1* 8 equipos de 2* 4 equipos de 4* 2 equipos de 8A lo largo del día, habrá gente que se vaya y gente que llegue, cada vez que entre o salga gente del show, sonará la campana, y a las personas que lleguen, se les asignará un grupo. En caso de que se vayan personas, se avisará de qué grupo fueron.",
    "input": "En la primera línea dos enteros N, Q siendo la cantidad de grupos de personas a lo largo de la playa y la cantidad de veces que sonará la campana * ( indicando ya sea el inicio de un juego o que se fue o llegó gente del show) * respectivamente. En la segunda línea N enteros, siendo la cantidad inicial de gente que hay en cada grupo. En las próximas Q líneas, tres enteros x, l, r* Si x es 1, significa que inicia un juego, entonces l y r representan los grupos en los que inicia y termina el segmento seleccionado, respectivamente. * Si x es 2, significa que llegó o se fue gente, l indicando el grupo, y r la cantidad de gente * ( si r es positivo, llegó gente, si r es negativo, se fue gente) *",
    "output": "Para cada juego, un entero indicando la cantidad de tamaños de equipo posibles.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 16293
  },
  {
    "title": "Minimo Comun Multiplo por factorizacion en primos",
    "url": "https://omegaup.com/arena/problem/Minimo-Comun-Multiplo-por-factor",
    "history": "El profesor Martín ( [ Martín Math- Teacher] [ 1] ) nos dejo de tarea calcular el Mínimo Común Múltiplo de dos números de a lo más 3 cifras realizando la factorización en primos, me puedes ayudar a hacer un programa para verificar si mis respuestas son correctas. El Mínimo Común Múltiplo ( mcm) es el número positivo más pequeño que es múltiplo de dos o más números. En la siguiente imagen se muestra un ejemplo del procedimiento y la salida esperada. ! [ Minimo Comun Multiplo] ( ejemplo. jpg)",
    "input": "Dos números enteros de a lo más tres cifras y mayores a 1.",
    "output": "La factorización en primos y el Minimo Comun Multiplo con el formato que se muestra a continuación: 128 192 | 264 96 | 232 48 | 216 24 | 28 12 | 24 6 | 22 3 | 21 3 | 31 1 | Minimo Comun Multiplo = 384",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15601
  },
  {
    "title": "Factores primos tarea",
    "url": "https://omegaup.com/arena/problem/Factores-primos-tarea",
    "history": "En la escuela me dejaron calcular los factores primos de varios números enteros, ya es noche y son varios ejercicios, quiero llorar, ¿me puedes ayudar a hacer un programa que, dado un número n me diga cuales son sus factores primos?",
    "input": "Un número entero n.",
    "output": "Los factores primos del número n, uno en cada línea.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15348
  },
  {
    "title": "Elecciones primales",
    "url": "https://omegaup.com/arena/problem/Elecciones-primales",
    "history": "Las elecciones para gobernador del Estado soberano de Primatitlán se acercan y los habitantes ( todos ellos números primos) se preparan para emitir sus votos. Por ley, todos los primos tienen derecho a ser votados, por lo que todos los primos se consideran candidatos. Cada habitante puede votar por cero o más primos candidatos escribiendo en su boleta un número positivo que representa el conjunto de candidatos por los que desea votar. Por ejemplo, si un habitante escribe en su boleta \" 1\" , eso significa que desea anular su voto, y ningún primo obtendrá ningún voto de esa boleta. Si un habitante escribe en su boleta \" 6\" , eso significa que desea votar por los primos candidatos \" 2\" y \" 3\" , ya que 6= 2* 3. Cada habitante puede votar por tantos primos candidatos como desee pero, para evitar fraudes, cada boleta solamente asignará a lo más un voto a cada candidato. Por ejemplo, si uno de los habitantes escribe \" 120\" en su boleta, entonces los primos candidatos 2, 3 y 5 recibiran cada uno un solo voto a pesar de que 120= 2* 2* 2* 3* 5 ( el candidato 2 solamente recibirá un voto, no tres) . El Instituto Factorizador Electoral ( IFE) es el encargado de contabilizar los votos y determinar al candidato primo ganador de las elecciones. Ayuda al IFE a determinar al ganador de la elección.",
    "input": "En la primera línea el número V de votos que fueron emitidos durante la elección. En la segunda línea, V enteros positivos { v_ i } , separados por espacio que representan los V votos emitidos.",
    "output": "En la primera línea, el primo ganador de la elección y el número de votos que obtuvo, separados por un espacio ( se garantiza que existirá exactamente un primo con la mayor cantidad de votos) .",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 14593
  },
  {
    "title": "Drinking Game",
    "url": "https://omegaup.com/arena/problem/Drinking-Game",
    "history": "In the way back home from the World Finals, Mr. Ed and his pals are visiting Madrid, but Mr. Ed is actually very tired and decided to rest a few days, so this problem is not about him. Ethan and the gang are going to drink some shots in the Gran Via; there, they have a good time drinking and talking about monsters and other terrifying adventures. After several minutes, Ethan came up with a fun drinking game he heard about at the World Finals called “Coprime Shots”, he explains: “Everybody has n piles of empty shot glasses, numbered from 1 to n, the i- th pile has g_ i glasses piled up. The objective of the game is to add or remove an arbitrary number of glasses to some of your piles in a way such that, for any pair of distinct piles ( i, j) in the set G ( result of adding and removing glasses to the original n piles) , it holds that gcd⁡( G_ i, G_ j) = 1. Sounds cool, huh? Anyway, you better play smart, because for every single shot glass you add or remove, you have to fill it up and drink! ”Being a decent programmer, you have no plans on getting wasted tonight, so you decided to minimize the number of shots you have to take in order to win the game.",
    "input": "The input will contain several test cases. The first line of each test contains an integer n: the number of piles in the game ( 1 ≤ n ≤ 100) . The next line contains n integers: the i- th integer represents g_ i, the number of shot glasses in the i- th pile ( 1 ≤ g_ i ≤ 20) . The last test case is followed by a single line containing 1 zero.",
    "output": "For each test case, print n positive integers separated by a single space, describing a winning configuration of piles that requires the minimum number of additions and removals to accomplish. Piles should be printed in the same order as in the input. See details in the format below. If there are multiples solutions to a test, any one of them will be accepted. # Example| | input31 2 352 4 6 9 100| | outputCase # 1: 1 2 3Case # 2: 1 4 7 9 11| | end",
    "note": "",
    "topics": [
      "number theory",
      "dp"
    ],
    "id": 3020
  },
  {
    "title": "Suma Divisores",
    "url": "https://omegaup.com/arena/problem/Suma-Divisores",
    "history": "Dado N un numero natural ( 1, 2, 3, . . . ) tu tarea es obtener la suma de los divisores propios de N, los divisores propios de un numero son todos aquellos naturales que dividen a este número, excepto el numero mismo. Por ejemplo los divisores propios del 6 son 1, 2 y 3.",
    "input": "Un numero natural N con 1≤ N ≤ 10^ 18",
    "output": "Un solo entero, la suma de los divisores propios de N",
    "note": "",
    "topics": [
      "divide and conquer",
      "number theory"
    ],
    "id": 2625
  },
  {
    "title": "Factores comunes",
    "url": "https://omegaup.com/arena/problem/factorescomunes",
    "history": "# Factores comunesEscribe un programa que dados dos enteros positivos A, B, imprima el número de divisores tienen en común.",
    "input": "En la primera linea, los dos enteros A, B, separados por un espacio.",
    "output": "En la primera linea imprime el número de factores que A y B tienen en común.",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 171
  },
  {
    "title": "Subprimos",
    "url": "https://omegaup.com/arena/problem/subprimos",
    "history": "La factorización en primos de un número X es la lista de números primos que se multiplican juntos para formar a X. Por ejemplo, la factorización prima de 12 es 2 × 2 × 3. Nota que 1 no es un número primo. Un subprimo es un número cuya factorización prima contiene cantidad prima de elementos. Por ejemplo, 12 es un subprimo porque su factorización prima contiene 3 elementos y 3 es un número primo. Dado 2 enteros A y B, regresa el número de subprimos que existen entre A y B, inclusive.",
    "input": "Dos enteros A y B. 2 ≤ A ≤ 100000 y A ≤ B ≤ 100000.",
    "output": "El número de subprimos entre los números dados, inclusive",
    "note": "",
    "topics": [
      "hashing",
      "number theory"
    ],
    "id": 90
  },
  {
    "title": "El número de Tapia y su cobaya",
    "url": "https://omegaup.com/arena/problem/OFMI-2022-Numero-Especial",
    "history": "Tapia y su cobaya son matemáticos y como todo matemático tienen una definición curiosa para números especiales. En particular, dados 3 números n, m y k, Tapia y su cobaya afirman que el n- ésimo número empezando a contar en m que * * no* * sea divisible por k es un número especial. # ProblemaDado los valores de n, m y k, encuentra el número especial de Tapia y su cobaya.",
    "input": "Deberás implementar una función ` int numeroEspecial( int n, int m, int k) ` que reciba los tres enteros n, m y k como parámetros y regrese el número especial de Tapia y su cobaya, este es, el n- ésimo número a partir de m que no sea divisible por k. # Ejemplos| | examplefilesample| | description6 es el primer número no divisible por 7. 8 es el segundo. 9 es el tercero y por lo tanto la respuesta. | | end# Límites- 1 ≤ n, m, k ≤ 10^ 15- k > 1# Subtareas- ( 20 puntos) : n, m, k 100- ( 40 puntos) : m = 1- ( 40 puntos) : Sin consideraciones adicionales. # Experimentaciónlibinteractive: downloadEl evaluador de prueba recibe el archivo ` sample. in` , donde la primera línea debe contener tres enteros n, m y k, que serán los parámetros de la función ` numeroEspecial` . _ IMPORTANTE: _ El evaluador de prueba y el evaluador final que se usará para calificar tu solución son diferentes. El evaluador de prueba tiene la depuración de tu solución y puede implementar algunas de sus funciones de distinta manera.",
    "output": "",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15590
  },
  {
    "title": "Mensajes interceptados",
    "url": "https://omegaup.com/arena/problem/Mensajes-interceptados",
    "history": "Como persona encargada del departamento de logística del servicio secreto, te dieron la misión de detectar si los mensajes de información confidencial de tu país han sido interceptados a la mitad del camino por algún espía. Cada mensajes se codifica a un número natural de N dígitos y es enviado por ondas de radio en una frecuencia específica. Para ayudarte con tu tarea, todos los mensajes están codificados como números divisible entre cuatro, y si son interceptados a medio camino, éstos cambiarán automáticamente su último dígito para dejar de ser divisibles entre cuatro. Tu orden es contar cuántos de los M mensajes que se recibieron en este día han sido interceptados, dados los números naturales en los que se codificaron.",
    "input": "En la primera línea dos enteros N y M que representan, respectivamente, el número de dígitos que tendrán los mensajes codificados como números naturales y el número de mensajes del día. Posteriormente se dan M enteros que representan la codificación que recibes de cada uno de los mensajes.",
    "output": "Un entero que representa el número de mensajes que han sido interceptados en el día.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15516
  },
  {
    "title": "Divisibilidad por 3",
    "url": "https://omegaup.com/arena/problem/Divisibilidad-por-3",
    "history": "El número 3 es el número favorito de Sophia. Siempre que encuentra un número quiere saber si es divisible por 3. Ahora está aprendiendo a programar y quiere escribir un programa que le diga si dado un número este es divisible por 3 o no.",
    "input": "Un entero n.",
    "output": "Una solo línea con la palabra Si si n es divisible por 3 o No si no es divisible.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 15470
  },
  {
    "title": "parImpar2",
    "url": "https://omegaup.com/arena/problem/parImpar2",
    "history": "Desarrolle un programa en lenguaje C/ C+ + que dado un número entero determine si se trata de un número PAR o IMPAR.",
    "input": "El programa deberá recibir por la entrada estándar un valor entero a.",
    "output": "El programa deberá imprimir PAR, si se trata de un número PAR e IMPAR en otro caso.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 13233
  },
  {
    "title": "99",
    "url": "https://omegaup.com/arena/problem/99",
    "history": "# EnunciadoPaulina tiene una extraña obsesión por el número 99. Le gusta coleccionar objetos que tengan este número, y recientemente se incursionó en un nuevo tipo de coleccionismo: el de los múltiplos de 99. Actualmente, su colección consiste de un solo número, el 99, pero está planeando en incorporar más. Hoy se encuentra en la tienda de números, pero necesita tu ayuda para determinar cuáles de los números que tienen disponibles son múltiplos de 99.",
    "input": "Un entero n, que indica el total de números que tienen a la venta en la tienda, seguido de n enteros a_ 1, a_ 2, . . . a_ n, los números en cuestión.",
    "output": "En total n líneas, una para cada entero. En la línea i deberás de imprimir * * Me lo llevo* * si a_ i sirve para la colección de Paulina, o * * No gracias* * en caso de que no.",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 12984
  },
  {
    "title": "Portal peninsular",
    "url": "https://omegaup.com/arena/problem/Portal-peninsular",
    "history": "# # Prologo de la historiaEl * * Malvado Robot OMI* * ( Odia Mayas Inteligentes) quiere destruir la península de Yucatán, debido a que no lo dejaron participar en ninguna competición estatal de informática por ser un robot. Con toda esta rabia contenida, el quiere acabar con todos los competidores mayas de informática sin importar el costo ( * \" mayas\" * porque se comparte la cultura de procedencia) . Los programadores de Quintana Roo descubrieron sus malvados planes pero no pueden acabar con el Malvado Robot OMI. Este robot esta programado en Maya+ + , un lenguaje antiguo de los primeros programadores que muy pocos conocen. Por lo tanto, decidieron unir fuerzas con los programadores de Yucatán. Para ello necesitan crear un portal para viajar al estado de Yucatán y derrotar al Malvado Robot OMI, este portal solo se puede crear con unas piedras preciosas que vende un Chaman. # # HistoriaNecesitan n piedras preciosas para crear el portal, pero el Chaman solo vende paquetes de hasta k piedras, es decir, paquetes de 1 piedra, 2 piedras, 3 piedras, . . . , k- 1 piedras y k piedras. El Chaman tiene una condición, solo te puede vender un tipo de paquete, es decir, si compran el paquete de 2 piedras ya no pueden comprar otro paquete de diferente cantidad de piedras. La tienda del Chaman y el lugar donde se creará el portal están separados. Además, los programadores de Quintana Roo solo pueden llevar un paquete por vuelta. Para no tardar tanto quieren minimizar el número de vueltas y que no sobre ninguna piedra. # ProblemaDado el número de piedras que se necesitan para crear el portal n y la cantidad de diferentes paquetes k, decir el mínimo número de vueltas que deben dar los programadores de Quintana Roo.",
    "input": "Dos enteros n y k, el número de piedras que necesita el portal y el límite de piedras en paquetes que vende el Chaman.",
    "output": "Dos enteros a y b, que es el número de piedras que tiene el paquete y el menor número de vueltas que tienen que hacer los informaticos de Quintana Roo. | | input8 7| | output4 2| | input6 10| | output6 1| | input999999733 999999732| | output1 999999733| | end# Límites* * Para el 25",
    "note": "",
    "topics": [
      "implementation",
      "number theory"
    ],
    "id": 11594
  },
  {
    "title": "MCD - Primos",
    "url": "https://omegaup.com/arena/problem/MCD---Primos",
    "history": "",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "number theory"
    ],
    "id": 4957
  }
]