[
  {
    "title": "occ22sfinns23",
    "url": "https://omegaup.com/arena/problem/occ22sfinns23",
    "history": "# ¿Vértices de un Rectángulo? Dadas las coordenadas enteras de cuatro puntos en el plano cartesiano, determinar si son los vérticesde un rectángulo con los lados paralelos a los ejes cartesianos. Lasrespuestas posibles son \" Si\" o \" No\" # Ejemplos| | input3 4 3 2 5 4 5 2| | outputSi| | input3 4 3 2 5 4 5 1| | outputNo| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 15978
  },
  {
    "title": "occ22sfinpn3",
    "url": "https://omegaup.com/arena/problem/occ22sfinpn3",
    "history": "# Misma Horizontal, Misma Vertical o NingunaDados las coordenadas de dos puntos en el plano cartesiano determinar si están en una mismarecta horizontal, en una misma recta vertical o en ninguna de esas dos. Las salidas posibles sonhorizontal, vertical y ninguna. # Ejemplos| | input2 4 5 4| | outputhorizontal| | input10 20 10 10| | outputvertical| | input8 8 54 72| | outputninguna| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 15970
  },
  {
    "title": "occ22claspn14",
    "url": "https://omegaup.com/arena/problem/occ22claspn14",
    "history": "# Menor distanciaDadas las coordenadas enteras del vértice superior izquierdo e inferior derecho de un rectángulo en el plano cartesiano y, la posición de las coordenadas enteras de un punto dentro de ese rectángulo, encontrar la menordistancia de ese punto a uno de los lados del rectángulo. # Ejemplos| | input2 56 - 23 0| | output1| | input2 56 - 24 3| | output2| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 15838
  },
  {
    "title": "Cobertura para puntos de colores",
    "url": "https://omegaup.com/arena/problem/Cobertura-para-puntos-de-colores",
    "history": "Dadas las coordenadas en el plano de N puntos rojos y N puntos negros, se desean trazar segmentos de recta de modo que cada punto rojo esté unido con al menos uno negro y cada punto negro esté unido con al menos uno rojo. Escribe un programa que minimice la suma de las longitudes de los segmentos usados.",
    "input": "Un entero N seguido de 2N parejas de reales X, Y. Las primeras N parejas denotan las coordenadas de los puntos rojos y las siguientes N parejas denotan las coordenadas de los puntos negros. Puedes suponer que 1 ≤ N ≤ 500 y que las componentes de las coordenadas están entre 0 y 100.",
    "output": "Un real impreso con dos decimales de precisión que sea la suma mínima de las longitudes de los segmentos usados.",
    "note": "",
    "topics": [
      "geometry",
      "graph matchings"
    ],
    "id": 15546
  },
  {
    "title": "Barco",
    "url": "https://omegaup.com/arena/problem/Barco",
    "history": "Un barco ha tenido un accidente y necesita auxilio. En el área hay otras dos embarcaciones y en base a sus coordenadas el capitán debe determinar cuál es la más cercana para llamarle y pedir rescate. Ayuda al capitán a encontrar la nave más cercana.",
    "input": "En la primera línea, dos enteros separados por un espacio x_ 0 y y_ 0 representando las coordenadas del barco accidentado. En la siguiente, dos enteros separados por un espacio x_ a y y_ a representando las coordenadas del primer barco de rescate, denotado A en la salida. En la tercera, dos enteros separados por un espacio x_ b y y_ b representando las coordenadas del otro barco de rescate, denotado B en la salida.",
    "output": "La letra A o B, que indique qué barco está más cerca del navío accidentado.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 15384
  },
  {
    "title": "La fila perfecta",
    "url": "https://omegaup.com/arena/problem/La-fila-perfecta",
    "history": "En una empresa de desarrollo de sistemas informáticos han decidido premiar la precisión de sus programadores. Y tal vez pienses que se tomará en cuenta la precisión con la que desarrollan sus códigos. . . ¡Pero no! . El único criterio para obtener el premio es: hacer una fila perfecta; después de todo, uno debe ser muy preciso para lograr ese objetivo. En un punto P_ 0 ( X_ 0, Y_ 0) se coloca el director de la empresa, listo para entregar el premio a quienes superen la prueba. Luego se forma el primer programador en el punto P_ 1 ( X_ 1, Y_ 1) , quien, por cierto, asegura su premio por ser el primero en llegar a la fila. Detrás de él se forman el resto de los programadores intentando hacer una fila perfecta con respecto del director y del primer programador que llegó a formarse. Un dron que sobrevuela el espacio donde se lleva a cabo la prueba, captura las coordenadas del resto de los empleados y las envía al servidor central de la empresa. Sólo se premiará a quienes estén colocados en una fila perfecta. Ya que los N programadores acudieron por el premio, no hay quién programe la solución al problema. ¿Crees que puedas ayudarles? ! [ enter image description here] [ 1]",
    "input": "Dos enteros X_ 0 y Y_ 0 que representan las coordenadas de la ubicación del director, seguidos de la cantidad N de programadores que acudieron por el premio. En seguida, N pares de números enteros representando las coordenadas de cada empleado en la fila.",
    "output": "La cantidad de programadores que recibieron el premio.",
    "note": "",
    "topics": [
      "implementation",
      "geometry",
      "math"
    ],
    "id": 15281
  },
  {
    "title": "Carretera recta",
    "url": "https://omegaup.com/arena/problem/Carretera-recta",
    "history": "El gobierno de Plaquetaque quiere construir una carretera que conecte sus muchas ciudades. Las ciudades están representadas como puntos con valores x y y. Esta carretera será perfecta, por lo cual no tendrá ni una sola imperfección, ¡Como por ejemplo tener curvas! Así es, la carretera será completamente recta, desde su comienzo hasta el fin. Esto por supuesto implica que muy probablemente no será posible conectar todas las ciudades con la misma carretera. Ayuda a los ingenieros a saber cual se la máxima cantidad de ciudades que pueden ser conectadas con esta nueva carretera.",
    "input": "En la primer línea un entero 2 ≤ n ≤ 1000 la cantidad de ciudades en Plaquetaque. Las siguientes n líneas contienen cada una un par de enteros - 100 ≤ x_ i, y_ i ≤ 100 las coordenadas de la i- ésima ciudad. Está garantizado que en cada punto solo puede existir una sola ciudad, es decir, cada par dado será único.",
    "output": "Imprime un solo entero, la máxima cantidad de ciudades que es posible conectar con una carretera recta.",
    "note": "",
    "topics": [
      "number theory",
      "geometry"
    ],
    "id": 14759
  },
  {
    "title": "Tiendas en el supermercado",
    "url": "https://omegaup.com/arena/problem/Tiendas-en-el-supermercado",
    "history": "Grecia y Axyoan están en un supermercado, en un punto decidieron hacer una visita de varias tiendas, para ellos el orden en que las visitan es muy importante, por lo cual siempre las van a visitar en el orden que planearon visitarlas, por lo tanto, si después de una tienda A quieren ir a una tienda B irán en línea recta desde las coordenadas X, Y de A hacia las coordenadas X, Y de B, como es un supermercado al aire libre no hay paredes que los detengan. Sabiendo las coordenadas de las tiendas y el orden en que las van a recorrer ayuda a Grecia y Axyoan a saber la longitud total de su recorrido, siendo el punto de partida la primer coordenada de la lista.",
    "input": "Un entero N ( 1 ≤ N ≤ 1000000) que indica la cantidad de tiendas que van a visitar, seguido habrán N lineas, cada una conteniendo las coordenadas X_ i y Y_ i de la i- esima tienda ( 1 < = X, Y, < = 1000000) .",
    "output": "La distancia total del recorrido.",
    "note": "",
    "topics": [
      "implementation",
      "geometry"
    ],
    "id": 14356
  },
  {
    "title": "La caja de zapatos",
    "url": "https://omegaup.com/arena/problem/caja-de-zapatos",
    "history": "Es navidad y Neil recibió como regalo un nuevo par de zapatos. Como la caja es muy bonita, Neil quiereconservarla en su armario. El único problema es que Neil no sabe si tiene suficiente espacio para guardarla. Para responder esa pregunta, Neil tiene que conocer el volumen de la caja. Neil tiene una regla y es capaz de mediral largo l de la caja, el ancho a de la caja y la altura h de la caja. La caja tiene la forma de un paralelepípedo rectangular. Recordemos que el volumen de un parlelepípedorectangular es la multiplicación de su largo, su ancho y su altura. Ayuda a Neil a calcular el volumen de la caja escribiendo un programa que lo resuelva.",
    "input": "Tres números l, a y h, la longitud, anchura y altura de la caja. Se cumple que 1 ≤ l, a, h ≤ 100.",
    "output": "El volumen de la caja. # Ejemplos| | input1 2 4| | output8| | input3 5 4| | output60| | input5 5 5| | output125| | input1 1 1| | output1| | end",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 14355
  },
  {
    "title": "Pizza Vinotinto",
    "url": "https://omegaup.com/arena/problem/pizza-vinotinto",
    "history": "Neil y Cristian están reunidos para ver el partido de la Vinotinto, pero como es de noche, deben cenar antes. Los amigos quieren cocinar una pizza, pero les falta uno de los ingredientes más importantes: el queso. Neil y Cristian saben el tamaño del radio de la bandeja y quieren calcular cuánto queso deben comprar para hacer su pizza. Para esto, deben calcular el área de la pizza. Además, quieren añadirle bordes de queso, por lo que también necesitan calcular el perímetro. Para este problema asumiremos que la pizza es perfectamente circular. Dado el radio de la pizza, ayuda a Neil y a Cristian a calcular rápidamente el área y el perímetro de la misma. ¡Rápido, antes de que empiece el partido! Afortunadamente, a los amigos no les importa ser muy precisos, por lo que piden que la respuesta tenga exactamente * * dos dígitos de precisión* * . Por ejemplo, si el valor total es 34. 5431, los amigos se conforman con una respuesta de 34. 54. De la misma manera, si el valor real es 55. 1, tu respuesta debe ser 55. 10. # NotaPara este problema vamos a asumir que el valor de π es exactamente * * 3. 14* *",
    "input": "Una única línea que contiene un entero r, el radio de la pizza.",
    "output": "Imprime dos líneas. En la primera, el entero a: el área de la pizza. En la segunda, el entero p: el perímetro de la pizza. # Ejemplos| | input3| | output28. 2618. 84| | input5| | output78. 5031. 40| | end# Explicación del ejemploEn el primer caso, el radio de la pizza es r= 3. De esta manera, el área de la pizza viene dado por: a = π r ^ 2 = 3. 14 * 9 = 28. 26Además, el perímetro viene dado por: p = 2 π r = 2 * 3. 14 * 3 = 18. 84",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 14043
  },
  {
    "title": "occ21sfinpn24",
    "url": "https://omegaup.com/arena/problem/occ21sfinpn24",
    "history": "# ¿Cuántos vértices? Dados dos rectángulos en el plano cartesiano encontrar cuántos vértices del segundo están en el interiordel primero ( incluyendo los bordes) . Su programarecibirá como entrada las coordenadas enteras de los vértices superior izquierdo e inferior derecho del primer rectángulo seguidospor las coordenadas enteras de los vértices superior izquierdo e inferior derecho del segundo rectángulo",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 13860
  },
  {
    "title": "Agujeros negros",
    "url": "https://omegaup.com/arena/problem/Agujeros-negros",
    "history": "El otro día descubriste dos agujeros negros usando tu telescopio. Sabes que si se acercan lo suficiente se fusionarán y formarán un agujero negro aún mas grande. Esto, como dicen por ahí, \" estaría bien padre\" así que quieres saber si sucederá o no. Ambos ajugeros negros pueden ser ilustrados como puntos en un plano cartesiano el cual representa el cielo. Estos agujeros negros tienen un radio de atracción. Si estos radios se tocan, o si uno de los agujeros negros se encuentra dentro del radio de atracción del otro, sabes que se fusionarán.",
    "input": "En la primer línea tres enteros - 100 ≤ a_ x, a_ y ≤ 100 y 1 ≤ a_ r ≤ 100 las coordenadas X y Y y el radio del primer agujero negro. En la segunda línea tres enteros - 100 ≤ b_ x, b_ y ≤ 100 y 1 ≤ b_ r ≤ 100 las coordenadas X y Y y el radio del segundo agujero negro.",
    "output": "Si los agujeros colisionarán, imprime \" Si\" , caso contrario imprime \" No\" .",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 13548
  },
  {
    "title": "Investigación Espacial Especial",
    "url": "https://omegaup.com/arena/problem/investigacion_espacial",
    "history": "Un equipo de investigación espacial especial te ha contratado para que los ayudes con sus cálculos. En particular necesitan que les ayudes a simular los movimientos de un conjunto de N planetas después de ser sometidos a M operaciones rotatorias. Se te darán las coordenadas exactas de cada uno de los N planetas. Las cuales serán coordenadas enteras en el plano. Habrá M operaciones rotatorias, las cuales estarán descritas con: * Coordenadas ( X, Y) . Éste será el punto sobre el cual van a girar los planetas. * Ángulo de rotación α. El cual siempre será un múltiplo de 90. Éste será el número de grados que rotarán ( contrario a las manecillas del reloj * * CCW* * ) . Nota que cualquier rotación de 360 + α_ 2 es lo mismo que una rotación de α_ 2 ( por ejemplo una rotación de 450 es lo mismo que una de 90, una de 720 es lo mismo que 0. ) Al final tu tarea es imprimir las coordenadas finales de cada uno de los planetas después de todas las rotaciones.",
    "input": "La primer línea contendrá los enteros N y M que representan el número de planetas y el número de rotaciones a simlular. Las siguientes N líneas contienen las coordenadas enteras ( X, Y) de cada uno de los planetas. Las siguientes M líneas contienen las coordenadas enteras ( X, Y) y el ángulo entero α de cada operación rotatoria.",
    "output": "N líneas con las coordenadas ( X, Y) finales de cada planeta, en el mismo orden en el que se dan en la entrada.",
    "note": "",
    "topics": [
      "geometry",
      "constructive algorithms",
      "implementation"
    ],
    "id": 12982
  },
  {
    "title": "Uniendo puntos con segmentos cortos",
    "url": "https://omegaup.com/arena/problem/Uniendo-puntos-con-segmentos-cor",
    "history": "Tenemos cuatro puntos A, B, C, D en el plano. Deseamos unirlos usando tres segmentos de recta. ¿En qué orden tenemos que unirlos si deseamos minimizar la suma de las longitudes de los segmentos de recta usados?",
    "input": "Cuatro parejas de reales que denotan las coordenadas en el plano de los puntos A, B, C, D respectivamente. Puedes suponer que todas las coordenadas están en el rango de - 10 a + 10.",
    "output": "El orden en el que se deben unir los cuatro puntos ( denotados con caracteres) . En caso de existir más de una solución, puedes imprimir cualquiera de ellas. Además, se debe imprimir un real que sea la suma de las longitudes de los segmentos usados. El real impreso se considerará correcto si es razonablemente cercano a la respuesta exacta.",
    "note": "",
    "topics": [
      "math",
      "geometry",
      "implementation"
    ],
    "id": 12938
  },
  {
    "title": "Vallas locas",
    "url": "https://omegaup.com/arena/problem/S1-2021-Senior-CCC",
    "history": "Necesitas pintar una valla de madera entre tu casa y la de tu vecino. Necesitas determinar el área de la valla, para poder determinar cuánta pintura necesitas usar. Sin embargo, la valla está hecha de N pedazos de madera no- uniformes, y tu vecino cree que tienen un toque artístico. En particular, las piezas de madera tienen distinta anchura. El lado inferior de cada pedazo de madera es horizontal, ambos lados serán verticales, pero la parte superior puede estar inclinada. A continuación se muestran dos pedazos de madera: ! [ Figura] ( figura1. png) Por suerte, la valla ha sido construida de tal forma que las piezas de madera adyacentes tienen la misma altura en los lados donde se tocan, lo que la hace lucir mejor visualmente.",
    "input": "La primera línea de la entrada contiene un entero positivo N donde N ≤ 10000. La segunda línea de entrada contiene N+ 1 enteros separados por un espacio h_ 1, . . . , h_ N+ 1 ( 1 ≤ h_ i ≤ 100, 1 ≤ i ≤ N + 1) describiendo las alturas de izquierda a derecha, de cada pieza de madera. Específicamente la altura izquierda de la i- ésima pieza de madera es h_ i y la altura derecha de la i- ésima pieza de madera es h_ i+ 1. La tercera línea de la entrada contendrá N enteros separados por un espacio w_ i ( 1 ≤ w_ i ≤ 100, 1 ≤ i ≤ N) describiendo el ancho de la i- ésima pieza de madera.",
    "output": "El área total de la valla.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 12857
  },
  {
    "title": "Grecia Illuminati",
    "url": "https://omegaup.com/arena/problem/Grecia-Illuminati",
    "history": "En la misteriosa ciudad de Guadalajara estaba una chica llamada Grecia, la cual estaba juntando ramitas en el bosque, sintiendo intriga por la situación se acerca el misterioso Axyoan a preguntarle \" Porque estas jutando ramitas? \" . < br/ > A lo que Grecia le contesto \" Para hacer mi casita que no ves? \" , pero en realidad Grecia es parte de los Iluminati, y estaba buscando ramitas para formar un triangulo y contactar con su antigua orden. < br/ > Para que un triangulo sea considerado valido solo tiene que cumplir de estar armado por 3 ramitas, y que ningun par de ramitas tenga longitud mayor que la suma de las longitudes de las otras 2 ( Se contaran los triangulos degenerados como triangulos) . Pero Axyoan siendo el detective que es estaba completamente seguro de lo que Grecia estaba haciendo, sin embargo el no sabia que ramitas iba a elegir asi que se quedo pensando de cuantas maneras podia elegir 3 ramitas para formar un triangulo. Ayuda a Axyoan a saber la cantidad.",
    "input": "Un entero N indicando la cantidad de ramitas que tiene Grecia. < br/ > En la siguiente linea se encontraran las longitudes de las N ramitas.",
    "output": "< br/ > La cantidad de formas que se pueden elegir 3 ramitas para formar un triangulo.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 12162
  },
  {
    "title": "Serpiente Gigante",
    "url": "https://omegaup.com/arena/problem/Serpiente-Gigante",
    "history": "Un grupo de criptozoólogos descubrieron en el lago de Chapala una gran serpiente marina de tamaño descomunal. Ahora monitorean sus movimientos con satélites. Sin embargo por limitaciones tecnológicas no pueden tomar video del animal, solo fotografías. Para deducir a donde se moverá a continuación la serpiente ( la cual le pusieron de apodo Pitón 3. 0) , observan la posición de su cabeza con el resto de su cuerpo. En las imágenes satelitales se representa la criatura con 3 coordenadas distintas sobre un plano cartesiano con centro en ( 0, 0) , la primer coordenada corresponde a su cola, la segunda a la base de su cabeza, y la tercera a la punta de su cabeza. Si formamos una linea recta con las primeras dos coordenadas, asumimos lo siguiente: si la punta de su cabeza continúa en la misma dirección, se moverá hacia adelante. Si se dobla hacia la izquierda o derecha ( con respecto a la línea trazada por su cuerpo) se moverá en esa dirección. Ayuda a la comunidad científica a predecir los movimientos de la serpiente.",
    "input": "La entrada consiste de 3 líneas, cada una con un par de enteros - 1e5 ≤ x, y ≤ 1e5 describiendo la posición de la cola de la serpiente, la base de su cabeza, y la punta de su cabeza respectivamente. Todas las coordenadas son distintas, la cabeza no puede voltearse directamente hacia atrás.",
    "output": "Una de las siguientes 3 opciones, sin comillas: \" IZQUIERDA\" , \" ADELANTE\" , \" DERECHA\" .",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 12139
  },
  {
    "title": "Ordenando por distancia al origen",
    "url": "https://omegaup.com/arena/problem/Ordenando-por-distancia-al-orige",
    "history": "Escribe un programa que lea un arreglo de N puntos en el plano ( x_ i, y_ i) y los ordene según su distancia con respecto al origen. En caso de empates en distancia, primero deben aparecer los de menor x y después los de menor y.",
    "input": "Un entero N seguido de N parejas de enteros ( x_ i, y_ i) . Puedes suponer que 1 ≤ N ≤ 10^ 5 y que las coordenadas están en el rango de - 25000 a + 25000.",
    "output": "Los N puntos del arreglo ordenado.",
    "note": "",
    "topics": [
      "math",
      "sortings",
      "geometry"
    ],
    "id": 12054
  },
  {
    "title": "occ20sfns24",
    "url": "https://omegaup.com/arena/problem/occ20sfns24",
    "history": "# ¿Qué lado corta? Considere un rectángulo en el plano cartesiano con su vértice inferior izquierdo en el origen ( 0, 0) y dos puntos que no están en ninguno de los lados del rectángulo. Usted debe hacer un programa que determine si el segmento que une esos puntos corta algún lado del rectángulo, en caso afirmativo decir qué lado es. Respuestas posibles N ninguno, A lado superior, B lado inferior, I lado izquierdo, D lado derecho. La entrada consta de tres pares de números. Los dos primeros x1 y y1 ( 0< x_ 1 , y_ 1< 1000) representan las coordenadas del vértice superior derecho del rectángulo, los siguientes dos pares representan las coordenadas de los puntos que definen el segmento. Las coordenadas de estos puntos pueden estar entre - 2000 y 2000. Se garantiza en todas las entradas de prueba que el segmento nunca va interceptar uno de los vértices ni a dos lados. # Ejemplos| | input3 5 1 2 2 2| | outputN| | input3 5 1 2 1 7| | outputA| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 12032
  },
  {
    "title": "occ20sfpn32",
    "url": "https://omegaup.com/arena/problem/occ20sfpn32",
    "history": "# ¿Qué lado corta? Considere un rectángulo en el plano cartesiano con su vértice inferior izquierdo en el origen ( 0, 0) y un segmento, horizontal o vertical, que no está sobre ningún lado del rectángulo. Usted debe hacer un programa que determine si el segmento corta algún lado del rectángulo, en caso afirmativo decir qué lado es. Respuestas posibles: N ninguno, A lado superior, B lado inferior, I lado izquierdo, D lado derecho. La entrada consta de tres pares de números. Los dos primeros x_ 1 y y_ 1 ( 0< x_ 1 , y_ 1< 1000) representan las coordenadas del vértice superior derecho del rectángulo, los siguientes dos pares representan las coordenadas de los puntos que definen el segmento. Las coordenadas de estos puntos pueden estar entre - 2000 y 2000. # Ejemplos| | input3 5 1 2 2 2| | outputN| | input3 5 1 2 1 7| | outputA| | end",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 12027
  },
  {
    "title": "El golfista vidente",
    "url": "https://omegaup.com/arena/problem/El-golfista-vidente",
    "history": "Eres un famoso vidente y has decidido incursionar en el mundo del golf para obtener más dinero. Aunque quieres aprovechar tus poderes para obtener un mejor desempeño, pronto te diste cuenta que conocer el futuro no te convierte un buen golfista: en tu visión del futuro puedes ver la distancia que recorrerá la bola en cada uno de tus siguientes N tiros, pero no puedes cambiar las distancias ni el orden en el que ocurrirán. El campo de golf es un plano en dos dimensiones y lo que sí puedes elegir sin restricciones es la orientación de cada tiro. Para al menos dar la batalla en el próximo torneo, deseas escribir un programa que determine si será posible llevar la bola de golf de su punto inicial al agujero de meta usando los tiros de tu visión.",
    "input": "Cuatro enteros X_ 1, Y_ 1, X_ 2, Y_ 2 que denotan la posición inicial de la bola y la posición de la meta, respectivamente. Posteriormente, un entero N seguido de N enteros D_ 1, D_ 2, . . . , D_ N que denotan la magnitud de la distancia de tus N tiros. Puedes suponer que - 10^ 5 ≤ X_ 1, Y_ 1, X_ 2, Y_ 2 ≤ + 10^ 5, que 1 ≤ D_ i ≤ 10^ 6 y que D_ 1 + D_ 2 + . . . + D_ N ≤ 10^ 9.",
    "output": "Un entero que sea la menor cantidad de tiros que necesitas para llevar la bola de golf a la meta o el entero - 1 si es imposible.",
    "note": "",
    "topics": [
      "dp",
      "binary search",
      "geometry"
    ],
    "id": 10860
  },
  {
    "title": "Y^3 + X^5 = N^7",
    "url": "https://omegaup.com/arena/problem/Y3--X5--N7",
    "history": "# HistoriaUn dia, Sebas estaba leyendo un Tzaloa de la OMM, y se encontro un problema muy dificil: \" Dado un entero N, determina si se cumple la igualdad Y^ 3 + X^ 5 = N^ 7 para algun X, Y entero. \" , cuya solucion no encontro. Tu como buen programador que eres, escribe un codigo que resuelva dicho problema.",
    "input": "Un entero N.",
    "output": "Imprime 1 o - 1 si existen o no dichos enteros respectivamente.",
    "note": "",
    "topics": [
      "strings",
      "trees",
      "combinatorics",
      "graph matchings",
      "binary search",
      "dp",
      "matrices",
      "dfs and similar",
      "number theory",
      "math",
      "greedy",
      "implementation",
      "brute force",
      "graphs",
      "games",
      "data structures",
      "meet-in-the-middle",
      "string suffix structures",
      "flows",
      "geometry",
      "shortest paths",
      "constructive algorithms",
      "sortings"
    ],
    "id": 9724
  },
  {
    "title": "Sumita cuadrada",
    "url": "https://omegaup.com/arena/problem/Sumita-cuadrada",
    "history": "Sebas está en un entrenamiento de matematicas, y le presentaron un problema: \" Demuestra que para toda N existe una suma de N números tal que su suma sea un cuadrado perfecto. \" , Sebas esta muy ocupado para resolver ese problema, y tú como buen programador que eres, te ha pedido que demuestres el problema con \" casitos\" .",
    "input": "Un entero N",
    "output": "Los N números distintos entre sí separados por un espacio y ordenados en orden creciente tal que su suma sea un cuadrado perfecto",
    "note": "",
    "topics": [
      "dfs and similar",
      "graph matchings",
      "string suffix structures",
      "flows",
      "strings",
      "sortings",
      "shortest paths",
      "combinatorics",
      "number theory",
      "games",
      "data structures",
      "implementation",
      "brute force",
      "greedy",
      "trees",
      "graphs",
      "meet-in-the-middle",
      "geometry",
      "dp",
      "math",
      "binary search",
      "matrices",
      "constructive algorithms"
    ],
    "id": 9723
  },
  {
    "title": "Áreas Verdes",
    "url": "https://omegaup.com/arena/problem/Areas-Verdes",
    "history": "La Organización Medidora de Áreas Verdes en Ambientes Urbanos ( OMAVAU) es un ente encargado tal y como su nombre lo indica, de medir áreas verdes en ambientes urbanos, y el día de hoy te han encargado el proyecto más importante del año: Medir el área verde del nuevo Aeropuerto Internacional de la Ciudad de México, y para lograrlo cuentas con los planos de la nueva obra los cuales nos indican las coordenadas de cada uno de los vértices del Aeropuerto.",
    "input": "En cada una de las siguientes * * N* * lineas encontraras los enteros * * X* * y * * Y* * , los cuales indican la coordenada en la que se encuentra un vértice del Aeropuerto, todas los vértices se encuentran en orden ( NOTA: El área total del Aeropuerto incluyendo sus zonas verdes nunca excederán los limites dados por las coordenadas) . Terminaras de leer cuando la coordenada * * X* * y * * Y* * sean las iniciales.",
    "output": "En una sola linea escribirás el símbolo * *",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 9587
  },
  {
    "title": "ITC Cajitas Felices",
    "url": "https://omegaup.com/arena/problem/Las-cajitas",
    "history": "Aarón es un alumno que durante sus primeras semanas dentro del ITC, se enfoco en su materia preferida \" Programación\" . Por lo cual dejo pasar sus demás materias. Aarón necesita de tu ayuda para poder entregar todas sus tareas. por lo que te pide ayuda en su tarea de Matemáticas. Su tarea consiste en dado una hoja de papel m* n, formar una caja. En la cual debe de determinar el volumen máximo y la altura máxima que puede tener dicha caja. # ProblemaDadas las medidas del papel m* n formar una caja, recortando a la hoja en cada esquina un cuadrado de x* x donde x es la altura de la caja. con la figura resultante formar la caja y calcular la altura máxima h y el volumen v máximo de la caja! [ Texto alternativo] ( recorte. png) ! [ Texto alternativo] ( cubo. png)",
    "input": "Ingresar 2 valores enteros m y n representando las medias de la hoja.",
    "output": "Imprimir 2 valores enteros h y v. Donde h es la altura máxima que puede tener la caja y v el volumen máximo de la misma.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 8908
  },
  {
    "title": "Distancia entre dos puntos",
    "url": "https://omegaup.com/arena/problem/Distancia-entre-dos-puntos",
    "history": "# Descripción: Este es un problema simple y sencillo, tu única tarea es mostrar en pantalla la distancia entre dos puntos dados ( A, y B) , dentro de un plano cartesiano. ! [ enter image description here] [ 1]",
    "input": "- En la primera línea, las coordenadas x y y del punto A. - En la segunda línea, las coordenadas x y y del punto B.",
    "output": "- La distancia que hay entre los puntos A y B.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 8809
  },
  {
    "title": "Analygeos de Xcoder",
    "url": "https://omegaup.com/arena/problem/Analygeos-de-Xcoder",
    "history": "———- > # Descripcion: > > Un día como cualquier otro, Xcoder observa en la lejania tres> barcos, los cuales ordeno alfabeticamente, el Barco A, Barco B y> Barco C. En el Barco A se encuentra el gran Dr. MrKrista, en el> barco B se encuentra Apocryphon, > mientras que en el barco C se encuentran los _ \" dioses\" _ Amehc y> Citalord quienes acababan de terminar una disputa entre los dos. > Cada uno de ellos quiere saber que distancia hay entre cada uno de sus> barcos. Amehc te a pedido calcular el semiperimetro, mientras que> Citalord el area. JosepHy ( quien esta viendo desde lejos) , posee un> mapa muy preciso de esa región dividido por coordenadas y orientado> mediante dos ejes ( vertical para y, y horizontal para x) , el te ha> pedido que le digas si los tres barcos A, B y C se encuentran en> una recta paralela al eje x, o una recta paralela al eje y ( si es> que se presenta el caso) . > > ! [ enter image description here] [ 1] > > # Entrada> > - En la primera línea las coordenadas del barco A. > - En la segunda línea las coordenadas del barco B. > - En la tercera línea las coordenadas de barco C. > > # Salida> > - El semiperimetro ( S) del poligono formado por los tres barcos. > - El perímetro ( P) de dicho poligono. > - El área del poligono mencionado anteriormente. > - En caso de que los 3 barcos, A, B y C se encuentren en una misma linea recta paralela, imprimirás: ̀̀Recta paralela al> eje x\" , si es que corresponde al eje x, en caso contrario> imprimiras: ̀̀Recta paralela al eje y\" . ————————————————————————",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry",
      "implementation"
    ],
    "id": 8801
  },
  {
    "title": "Figuras Planas",
    "url": "https://omegaup.com/arena/problem/Figuras-Planas",
    "history": "Dado cuatro puntos * * A* * , * * B* * , * * C* * y * * D* * determina si la figura * * ABCD* * es un cuadrado, un rectángulo, un paralelogramo, un trapezoide o ninguno bajo las siguientes definiciones: Cuadrado: Cuadrilátero con cuatro ángulos rectos y cuatro lados del mismo tamañoRectangulo: Cuadrilátero que no es cuadrado pero tiene cuatro ángulos rectosParalelogramo: Cuadrilátero que no tiene ángulos rectos pero cada par de lados opuestos tiene el mismo tamaño e inclinación ( son paralelos) . Trapezoide: Cuadrilátero que tiene dos lados paralelos y dos lados no paralelos. Ninguno: No cumple con las últimas descripciones. Las figuras no se intersectarán y formarán un cuadrilátero con lados * * AB* * , * * BC* * , * * CD* * y * * AD* * .",
    "input": "Cuatro pares de números enteros * * X* * : - 10000 ≤ X ≤ 10000 y * * Y* * : - 10000 ≤ Y ≤ 10000 en distintas líneas correspondiendo a * * A* * , * * B* * , * * C* * y * * D* * en ese orden.",
    "output": "Cuadrado, Rectangulo, Paralelogramo, Trapezoide o Ninguno dependiendo de la figura",
    "note": "",
    "topics": [
      "geometry",
      "implementation"
    ],
    "id": 8614
  },
  {
    "title": "Tipos de Triangulos",
    "url": "https://omegaup.com/arena/problem/Tipos-de-Triangulos",
    "history": "Escribe un programa que detecte el tipo de un triángulo dadas las longitudes x, y, z de sus tres lados. - * * Equilátero* * : triángulo con los tres lados iguales. - * * Isósceles* * : triángulo con dos lados iguales. - * * Escaleno* * : triángulo con los tres lados desiguales.",
    "input": "Los tres enteros x, y, z separados por un espacio. Puedes suponer que x, y, z > 0 y que existe una forma válida de construir un triángulo con esas longitudes de lados.",
    "output": "El tipo de triángulo que se tiene. La cadena a imprimir debe estar en minúscula y no debe incluir acentos.",
    "note": "",
    "topics": [
      "implementation",
      "geometry"
    ],
    "id": 8551
  },
  {
    "title": "Campo Electrico",
    "url": "https://omegaup.com/arena/problem/Campo-Electrico",
    "history": "La mamá de Juanito esta atrapada en un campo eléctrico y ocupa tu ayuda para salir de él. Dado cierto número de cargas electricas en espacio tridimensional, debes calcular cual será el vector de campo eléctrico en el punto indicado. Para obtener el valor del campo electrico en cierto punto, debes aplicar la formula E⃗ = ∑kQ/ r^ 2 con dirección hacia el punto si el valor de la carga Q es negativo y dirección contraria si es positivo. Considera k = 9x10^ 9, y r como la magnitud de la distancia entre el punto y la carga.",
    "input": "La primera línea será el número de cargas puntuales * * N* * seguido por tres números separados por espacios que son las coordenadas X, Y y Z de la mamá de Juanito. En las siguientes * * N* * lineas vendrán 4 números reales, el valor de la carga seguido por sus coordenadas.",
    "output": "Debes imprimir tres valores con dos puntos decimales redondeados indicando los componentes del campo electrico en X, Y y Z divididos por 1x10^ 9",
    "note": "",
    "topics": [
      "implementation",
      "geometry"
    ],
    "id": 7861
  },
  {
    "title": "Alturas equiláteros",
    "url": "https://omegaup.com/arena/problem/Alturas-equilateros",
    "history": "La maestra de Juanito le encargó de tarea encontrar una expresión para calcular la altura de cualquier triángulo equilátero dada la longitud de uno de sus lados. Como Juanito está muy ocupado terminando su robot, te dará un sandwich si le ayudes a resolver su tarea. A continuación se muestran los apuntes descifrados de la tarea de Juanito.",
    "input": "En la primera línea encontrarás el valor * * N* * que indicará cuantos triángulos ocupas leer y en las siguientes * * N* * lineas encontrarás un entero con el valor de cualquiera de los lados de ese triángulo.",
    "output": "* * N* * líneas con las alturas de cada triángulo redondeados a dos lugares despues del punto.",
    "note": "",
    "topics": [
      "implementation",
      "math",
      "geometry"
    ],
    "id": 7837
  },
  {
    "title": "Uniendo puntos",
    "url": "https://omegaup.com/arena/problem/Uniendo-puntos",
    "history": "De niño siempre comprabas revistas para colorear y te gustaba la sección en la que unías puntos numerados para formar una figura. Esas revistas no son tan populares como antes, pero te gustaría contar con un programa que simule la misma actividad. Si unes el punto 1 con el 2 mediante una recta, el 2 con el 3, . . . , el N - 1 con el N y finalmente el N con el 1 para cerrar el dibujo, ¿cuál fue la longitud total del trazo realizado?",
    "input": "Un entero N seguido de N parejas enteros que denotan las coordenadas X, Y de los puntos desde el punto 1 hasta el N. Puedes suponer que 2 ≤ N ≤ 200 y que para cada punto se cumple que 0 ≤ X, Y ≤ 100.",
    "output": "Un real con dos decimales de precisión que sea la longitud del trazo realizado. Éste corresponde con la suma de las longitudes de cada recta dibujada. # NotaEste problema se puede resolver con los temas vistos en * Programación Estructurada* de la UAM Azcapotzalco.",
    "note": "",
    "topics": [
      "geometry",
      "implementation",
      "math"
    ],
    "id": 7551
  },
  {
    "title": "Expected area",
    "url": "https://omegaup.com/arena/problem/Expected-area",
    "history": "Tenemos dos segmentos en R^ 3: O⃗A⃗ y O⃗B⃗, donde O es el origen. Escogemos de forma aleatoria dos puntos en el segmento O⃗A⃗ y uno más en el segmento O⃗B⃗. Los tres puntos escogidos forman los vértices de un triángulo. ¿Cuál es el valor esperado de su área? La elección de los puntos en ambos segmentos es uniforme sobre su longitud, no sobre sus coordenadas.",
    "input": "La primera línea contiene tres enteros A_ x, A_ y y A_ z, que son las coordenadas del punto A. La segunda línea contiene tres enteros B_ x, B_ y y B_ z, que son las coordenadas del punto B.",
    "output": "El valor esperado del área del triángulo formado, redondeado a 4 decimales.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 7220
  },
  {
    "title": "Tareas",
    "url": "https://omegaup.com/arena/problem/CEP2017-Tareas",
    "history": "A la profesora de Alfredo se le ha ocurrido nuevamente dejar una tarea muy aburrida y bastante larga. Esta vez, les ha pedido calcular el área de muchos trapecios. Como Alfredo aprendió a programar con los chicos del ACM, decide hacer un programa para resolver su tarea. Cada ejercicio es dado por 3 números a, b y h, los cuales son la bases del trapecio y la altura, respectivamente.",
    "input": "Un única línea conteniendo los 3 enteros a, b y h.",
    "output": "Un única línea con el resultado del área del trapecio. Si el área es entera, puedes incluir o no decimales.",
    "note": "",
    "topics": [
      "math",
      "geometry"
    ],
    "id": 6210
  },
  {
    "title": "Canchas",
    "url": "https://omegaup.com/arena/problem/COMI-Canchas",
    "history": "El director de la escuela necesita tu ayuda para redistribuir la cancha de baskety de volley en el patio de la escuela. Ambas canchas ahora serán rectángulos cuyas esquinasestarán en coordenadas enteras dentro del nuevo patio. El director te dará las coordenadas de las esquinas opuestas de cada cancha nuevay quiere que calcules cuál será el área total del patio que quedará cubierta porambas canchas. A pesar del tamaño del patio de la escuela, puede ser que ambas canchas puedan encimarse, por lo que deberás tomar eso en cuenta para no contar dos veces el área. # TareaEscribe un programa que dadas las coordenadas de un par de esquinas opuestas de cadacancha calcule el área total cubierta por ambas canchas.",
    "input": "Tu programa deberá leer del teclado dos líneas, cada una con 4 números enteros separadospor un espacio que representan las coordendas x_ 1, y_ 1, x_ 2, y_ 2de cada una de las canchas.",
    "output": "Tu programa deberá escribir en la pantalla un único número entero que represente elárea total cubierta por ambas canchas",
    "note": "",
    "topics": [
      "math",
      "geometry",
      "implementation"
    ],
    "id": 6120
  },
  {
    "title": "Manecillas del reloj",
    "url": "https://omegaup.com/arena/problem/manecillas-reloj",
    "history": "El interés medieval en los disposivos mecánicos está bien ilustrado por el desarrollo del reloj mecánico. El más antiguo de los cuales es impulsado por pesas y controlado en un borde por un brazo oscilante que interactúacon una rueda dentada se remonta a 1386. Los relojes controlados por muelles aparecieron a mediados del siglo XV, esto que permitió construir mecanismos más compactos y preparar el camino para el reloj portátil. Los relojes de péndulo impulsados ​​por resorte ingleses mantuvieron primero en un soporte de pared pequeño y más tarde en un estante. Muchos relojes de soporte contenían un cajón para sostener la llave de enrollamiento. Los primeros relojes de soporte, hechos para un período posterior a 1660, eran de diseño arquitectónico, con pilares a los lados y un frontón en la parte superior. En Francia, en los siglos XVII y XVIII, el reloj de mesa se convirtió en un objeto de diseño monumental, cuyos mejores ejemplos son obras menores de escultura. Los relojes Longcase ( también llamados relojes de pie) son relojes de péndulo altos encerrados en una caja de madera que se levanta sobre el piso y tiene típicamente entre 6 y 7, 5 pies ( 1, 8 a 2, 3 m) de altura. Más tarde, el nombre * * reloj de abuelo* * se hizo popular después de la popular canción * * El reloj de mi abuelo* * , escrita en 1876 por Henry Clay Work. Uno de los primeros relojes atómicos era un reloj controlado por amoníaco. Fue construido en 1949 en la Oficina Nacional de Estándares, Washington, D. C . ; en este reloj, la frecuencia no varió en más de una parte en 10< sup> 8< / sup> . Los relojes nucleares se construyen con dos relojes. El conjunto de átomos que emiten la radiación gamma de frecuencia precisa se puede llamar el reloj emisor; y, otro grupo de átomos que absorben esta radiación, siendo éste el reloj absorbente. Un par de estos relojes nucleares puede detectar cambios de energía de una parte en 10< sup> 14< / sup> , siendo aproximadamente 1000 veces más sensible que el mejor reloj atómico. El reloj de cesio es el tipo de reloj más preciso que se haya desarrollado. Este dispositivo hace uso de las transiciones entre los estados de giro del núcleo de cesio y produce una frecuencia que es tan regular que se ha adoptado para establecer el estándar de tiempo. La historia de los relojes es fascinante, pero no relacionada con este problema. En este problema, se le pide que encuentre el ángulo entre la aguja de los minutos y la manecilla de las horas en un reloj analógico normal. Suponga que la manecilla de los segundos, si hubiera una, estaría apuntando hacia arriba hacia la 12. Dé todos los ángulos como ángulos positivos más pequeños. Por ejemplo, 9: 00 es 90 grados; no - 90 o 270 grados.",
    "input": "La entrada es un tiempo de la forma * * H: M* * , en una sola línea, con 1 ≤ H ≤ 12 y 00 ≤ M ≤ 59. Tenga en cuenta que * * H* * puede representarse con 1 ó 2 dígitos ( para 1 - 9 ó 10 - 12, respectivamente) ; M siempre se representa con 2 dígitos ( los tiempos de entrada son los que normalmente se ven en un reloj digital) .",
    "output": "La salida muestra el ángulo positivo más pequeño en grados entre las manecillas. La respuesta debe estar entre 0 grados y 180 grados. La salida debe redondearse al 1/ 1000 más cercano, es decir, tres lugares después de imprimir el punto decimal.",
    "note": "",
    "topics": [
      "geometry",
      "implementation"
    ],
    "id": 5856
  },
  {
    "title": "Base de un triangulo",
    "url": "https://omegaup.com/arena/problem/Base-de-un-triangulo",
    "history": "Un día Miguelito se sentía muy frustado ya que no había pasado la olimpiada de matemáticas, así que decidió pasar la de informática como venganza. A miguelito le gustaba la de informática ya que no había problemas de geometría pero ¡Oh, sorpresa! de repente vio un problema de un triangulo en la plataforma el cual te decía * * * \" Halla la base de triangulo teniendo la altura\" * * * , el dijo \" Que fácil\" pero al parecer como Diosito no lo quiere su computadora fallaba y le dividía la altura entre dos, así que a el no lo detuvo eso y consiguió resolver el problema# ProblemaDecrifa cual era el programa que creo miguel con su computadora fallada",
    "input": "Dos enteros A y B, la media altura del triangulo y su área respectivamente",
    "output": "La base del triangulo",
    "note": "",
    "topics": [
      "math",
      "geometry",
      "implementation"
    ],
    "id": 5845
  },
  {
    "title": "Bisección de un polígono",
    "url": "https://omegaup.com/arena/problem/Biseccion-de-un-poligono",
    "history": "En lógica difusa, la fuerza con la que una regla difusa se cumple es un real en el intervalo [ 0, 1] y cada regla hace referencia a una función con el mismo codominio. Durante el proceso de desdifusificación, el área debajo de la curva de la función se sombrea a partir de una altura Y que es igual a la fuerza de su regla. Lo anterior se hace para todas las reglas del sistema. Al final se obtiene un polígono ( no necesariamente conexo) y un algoritmo de desdifusificación consiste en encontrar la X tal que una línea vertical en esa posición bisecta al polígono en dos partes cuyas áreas sombreadas son de la misma magnitud. Escribe un programa que implemente dicho algoritmo de desdifusificación. La entrada consistirá de N reglas, donde cada regla está descrita por los puntos ( X_ 1, X_ 2, X_ 3) de una función triangular y un valor Y que es la fuerza con la que se cumple la regla. Una función triangular ( X_ 1, X_ 2, X_ 3) se ve en el plano cartesiano como el triángulo con vértices en ( X_ 1, 0) , ( X_ 2, 1) , ( X_ 3, 0) .",
    "input": "El entero N seguido de las N reglas descritas como una cuadrupleta de reales X_ 1, X_ 2, X_ 3, Y. Puedes suponer que 1 ≤ N ≤ 100 además de que 0 ≤ X_ 1 < X_ 2 < X_ 3 ≤ 1000 y 0 ≤ Y ≤ 1 para todas las reglas.",
    "output": "Un real que es la coordenada X de la recta vertical que bisecta el polígono. La salida se considerará correcta si coindice con el valor exacto con una precisión de un decimal.",
    "note": "",
    "topics": [
      "dp",
      "geometry"
    ],
    "id": 5834
  },
  {
    "title": "Área de un triángulo ",
    "url": "https://omegaup.com/arena/problem/area-triangulo-inout",
    "history": "En la escuela a Carlitos le han enseñado a calcular el área de un triángulo usando los valores de los lados. La maestra le ha indicado que lo primero que debe calcular es el valor: S = L_ 1 + L_ 2 + L_ 3/ 2 El siguiente paso es aplicar la fórmula para calcular el área. area = √( s ( s- L_ 1) ( s- L_ 2) ( s- L_ 3) ) Carlitos está empezando sus cursos, por ello te pide que le apoyes escribiendo un programa que permita verificar si está haciendo bien sus cálculos.",
    "input": "Recibirás 3 valores de tipo real. Estos lados corresponden siempre a un triángulo válido.",
    "output": "Mostrar cada uno de los lados leídos en la entrada y el área del triángulo. Considera 15 caracteres para imprimir cada número y cuatro decimales. Los detalles puedes consultarlos en los ejemplos.",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "geometry"
    ],
    "id": 5821
  },
  {
    "title": "Puntos colineales",
    "url": "https://omegaup.com/arena/problem/Puntos-colineales",
    "history": "Dados dos puntos en el plano, siempre existe una línea recta que los une. Sin embargo, para tres puntos puede que dicha recta no exista. Dadas las coordenadas de tres puntos en el plano, determina si existe o no una recta que toca a todos los puntos.",
    "input": "Seis enteros x_ 1, y_ 1, x_ 2, y_ 2, x_ 3, y_ 3 separados por espacios que denotan las coordenadas de los tres puntos en el plano, respectivamente. Puedes suponer que - 1000 ≤ x_ i, y_ i ≤ + 1000 para 1 ≤ i ≤ 3.",
    "output": "La letra ' S' si existe una recta que toque todos los puntos y la letra ' N' en caso contrario.",
    "note": "",
    "topics": [
      "implementation",
      "geometry"
    ],
    "id": 5755
  },
  {
    "title": "Buscando rutas",
    "url": "https://omegaup.com/arena/problem/Buscando-rutas",
    "history": "Es usual que en la Universidad de las Ciencias Informáticas te encuentres con gran cantidad de ranas en sus instalaciones. Ya sea en los cuartos, pasillos, baños, etc. . . Esto no es ningún problema a menos que tengas fobia a estos anfibios. Durante más de 4 años el profesor Edgardo Adrián Franco Martínez, ha sido participe en el campamento caribeño de entrenamiento con distintos estudiantes de la ESCOM, y ninguno de ellos ha tenido problemas con este aspecto. ¡En la VIII edición de este gran evento, algo inesperado sucedió, una participante que no podía ver a las ranas ni en pintura, asistió! ¡Elsy Pinzón es su nombre! Durante varios días se encontró con estos pequeños animalitos en distintos lugares de su apartamento y en varias instalaciones de la institución. Esto ocasionó que tuviera que estar migrando entre los cuartos de los compañeros del Club de Algoritmia ESCOM por que el suyo estaba infestado. Ella tenía lugares a los que quería asistir durante el transcurso del campamento, pero no quería encontrarse con ninguna rana en su camino. Por lo tanto, se puso a pensar en alguna forma de poder ir a todos los lugares sin tener que pasar dificultades en el camino. Al no poder encontrar ninguna forma, Fili le mencionó que existía algo mágico que hacía que las ranas desaparecieran. Para lograr esto ella tenía que escoger un punto de inicio y un punto de fin ( * * No necesariamente diferentes* * ) de entre las distintas locaciones que quería visitar y escoger una ruta tal que las siguientes restricciones se cumplieran: ∙ * Que la ruta escogida pase por todas las locaciones las cuales ella quiere visitar. * ∙ * Pasar por todos los lugares a los más una vez, con excepción del punto de inicio y de fin, las cuales están permitidas que se visiten a los más 2 veces. * ∙ * Que la ruta trazada forme un polígono convexo de area positiva y que a lo más contenga una línea recta dentro de este. * ! [ Ruta valida] [ 1] ! [ Ruta Invalida] [ 2] ! [ Ruta valida] [ 3] * * Las imágenes describen un ruta valida, invalida y valida respectivamente. * * * ( Explicación al final del problema) * Elsy al saber, de esto se emocionó demasiado y pensó: * \" ¡Si logro hacer lo que Fili me dijo, podre caminar libremente en cierta área de la universidad y así podre vivir feliz! \" * Es por eso que ella construyó un traje que la aísla de todo lo exterior y que le provee solo aire para que pueda respirar y seguir viviendo. Con el uso de este traje al estar en un sitio x, ella puede trasladarse directamente a cualquiera de los otros lugares, siempre y cuando no viole la restricción definida anteriormente. Ella quiere conocer cuantas rutas validas existen ( lo mas rapido posible) para saber de cuantas maneras dfierentes podría vivir feliz durante el transcurso del campamento caribeño. Es por eso que te pide tu ayuda para resolver este problema. * * Nota: Dos rutas son consideradas diferentes si la figura formada es diferente. * *",
    "input": "La primera línea de entrada contendrá un numero N, describiendo la cantidad de sitios que Elsy quiere visitar. A continuación N líneas, donde cada una contendrá dos números enteros x_ i, y_ i dando las coordenadas de cada lugar.",
    "output": "El número de formas en las que se puede trazar la ruta, cumpliendo las restricciones descritas en el enunciado del problema. Como este numero puede ser muy grande, se pide que se imprima la respuesta modulo 10^ 9 + 7",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 5583
  },
  {
    "title": "Distancia Manhattan",
    "url": "https://omegaup.com/arena/problem/Distancia-Manhattan",
    "history": "Dados dos puntos en el plan ( X, Y) determinar la distancia Manhattan que existe entre ellos. La distancia Manhattan es la diferencia que existe entre las X' s, más la diferencia de la Y' s.",
    "input": "La primera línea contiene un número entero 1 ≤ T ≤ 10^ 4 que es el número de casos de prueba. Después de este T casos existen. Cada caso de prueba consta de cuatro números enteros X1, Y1, X2 y Y2 . . . en una línea por sí mismo que denotan las coordenadas de los puntos. Los valores para las coordenadas de todos los puntos estarán siempre entre - 10^ 4 y 10^ 4.",
    "output": "Para cada caso de prueba de salida de una sola línea con un número entero: la distancia de Manhattan entre los puntos dados. | | input32 3 4 56 7 8 32 8 6 4| | output468| | end",
    "note": "",
    "topics": [
      "geometry",
      "implementation",
      "math"
    ],
    "id": 5195
  },
  {
    "title": "Bad Luck Chimpa",
    "url": "https://omegaup.com/arena/problem/Bad-Luck-Chimpa",
    "history": "El Guerrero Chimpa Definitivo ( también conocido como GCD) , viajero del tiempo del año 207̃012, ha llegado a nuestros días para realizar la misión más difícil de toda la historia: evaluar el resultado de la partida de Worms de esta noche ( el equipo de desarrollo de Team 17 arruinó los métodos de revisión de colisiones de todas las armas del juego) y así arreglar el futuro y el destino de la raza humana. El juego de Worms ( desarrollado por Team 17) es un juego de estrategia por turnos que se juega entre dos o más jugadores quienes tienen 4 gusanos al inicio del juego; el objetivo del juego es eliminar a todos los gusanos de los otros jugadores atacándolos con las armas que tienes a tu disposición. La forma en el que las armas del juego dañan a los gusanos se basa en explosiones de forma circular, cada tipo de arma tiene un radio de explosión definido, mientras más cerca esté del gusano más daño realizará, aunque si no está lo suficientemente cerca no le hará daño. Cabe recalcar que cualquier gusano dentro del radio de explosión de un arma será dañado aunque sea del jugador atacante. La partida de esta noche es especial pues solamente hay dos jugadores ( Chimpa y Medina) que cuentan con un gusano cada uno con 1 punto de vida por lo que cualquier explosión que los toque los mataría. Y si no era suficiente, Chimpa tiene ventaja pues Medina, después de aceptar la partida pero antes de hacer algún movimiento, tuvo que ir a conseguir botanas antes de que la tienda cerrara por lo que Chimpa hizo todos sus movimientos seguidos antes de que Medina regresara ( Medina no hizo ningún movimiento) . Finalmente, el juego puede acabar porque Chimpa elimine a su propio gusano ( o elimine al de Medina y al suyo con la misma explosión) o se acaben los movimientos de la bitácora. GCD posee la bitácora de los movimientos que se realizaron en la partida; la bitácora contiene la información de las n armas que se permite utilizar en la partida y los m turnos que duró la partida ( antes de acabar por tiempo) . Además, cuenta con las posiciones del gusano de Chimpa ( denotado como x_ C, y_ C) y del gusano de Medina ( denotado como x_ M, y_ M) , las descripciones de las armas que se utilizaron que se definen con un caracter en mayúscula identificador para cada arma c_ i y un radio de la explosión r_ i. Finalmente, la bitácora contiene la información de cada movimiento hecho por Chimpa el cual cuenta con el caracter identificador del arma que se utilizó y la posición del centro de la explosión del arma ( x_ j, y_ j) . Ahora que GCD sabe cómo interpretar la bitácora de movimientos, necesita que le ayudes a hacer un programa que lea esta bitácora y le genere el resultado de la partida; pero eso no es todo, GCD también es muy orgulloso por lo que si los ataques de Chimpa pueden eliminar al gusano de Medina múltiples veces antes de que acabe el juego entonces quiere que se genere ese resultado; la convención que sigue el juego es, en caso de que sea solo una vez \" Chimpa gana! \" o si son más de una, entonces \" Chimpa gana x x! \" donde x es el número de veces. Finalmente, si Chimpa empata, es decir, nunca eliminó al gusano de Medina en los turnos anteriores y el ataque de Chimpa hizo que los gusanos de ambos jugadores fueran eliminados en el turno actual, entonces imprime \" Ethan dira: Au au, no puedo ganar, amo\" ( sin comillas) y si Chimpa pierde, es decir, nunca eliminó al gusano de Medina y el ataque de Chimpa eliminó a su propio gusano o ninguno de los ataques de Chimpa eliminó al gusano de Medina, entonces imprime \" El futuro esta condenado\" ( sin comillas) . Recuerda que todo movimiento en la bitácora después de que el gusano de Chimpa muera va a ser desechado y no importa para el resultado del juego.",
    "input": "La primera línea de entrada contiene dos enteros n y m. La segunda línea de entrada contiene cuatro enteros x_ C, y_ C, x_ M y y_ M. Cada una de las siguientes n lineas contiene la descripción de un arma con un caracter en mayúscula c_ i y un entero r_ i. Finalmente, cada una de las siguientes m lineas contiene el caracter identificador del arma que utilizó Chimpa c_ j y la posición del centro de explosión dada por los valores enteros x_ j y y_ j.",
    "output": "La salida sólo debe contener la frase de resultado como se explicó en el problema ( sin comillas) .",
    "note": "",
    "topics": [
      "math",
      "implementation",
      "geometry"
    ],
    "id": 4084
  },
  {
    "title": "En busca de Namekusei",
    "url": "https://omegaup.com/arena/problem/Fili-y-Angie",
    "history": "Fili y Angie han sido amigos desde tiempos inmemorables. Ahora que ellos han terminado su carrera y se han convertidos en unos grandes astronautas, se han dado la tarea de encontrar un nuevo planeta en la galaxia debido a que el nuestro esta a punto de desaparecer. Por suerte han encontrado el planeta Namekusei que es completamente habitable para seres humanos aunque ahora se han encontrado con un nuevo dilema. . . Al ser amigos de toda la vida no quieren estar separados el uno del otro y es por eso que ellos quieren encontrar 2 casas que estén comunicadas y que el tiempo de recorrido de una a otra se la mínima posible. El planeta tiene zonas territoriales a la que ellos han denominado de las siguientes 2 formas: * * * Rapadopolus* * * * * Ransemnios* * Un rapadopolus es una zona territorial que contiene un conjunto de ransemnios. Por otra parte un ransemnio es una zona territorial en donde se pueden construir casas. * * Nota: Para este problema se puede asumir que en los ransenmios hay construida solo una casa y no pueden añadirse mas. * * El costo de llegar de un ransemnio a otro es equivalente a * * K * | i - j | ^ 2* * , donde * * i* * y * * j* * son los identificadores de los 2 ransemnios y * * K* * es un entero dado en la entrada. Existen aparatos especiales diseñados por Fili y Angie que permiten a los habitantes de este planeta teletransportarse de un Rapadopolus a otro, donde el costo asignado a esta acción es igual a * * K * | i - j | ^ 2* * , donde * * i* * y * * j* * son los identificadores de los Rapadopolus y * * K* * es un entero dado en la entrada. Cuando te teletransportas siempre llegas a el ransenmio con identificador * * i* * , donde * * i* * es el mismo número del ransenmio en donde estabas ubicado anteriormente. Ten en cuenta que puedes pasar por el ransenmio * * i* * pero no puedes construir una casa si no fue dado este en la entrada.",
    "input": "La entrada contendrá dos números * * N* * y * * K* * , donde * * N* * es el número de Rapadopolus que existen en Namekusei y * * K* * el entero mencionado en la descripción. Las siguientes * * N* * lineas contendrán un entero * * M* * indicando el número de ransemnios que existen en el * * i- th* * Rapadopolus. A continuación * * ( En cada una de las N lineas) * * * * M* * números * * A_ i* * diciéndonos el identificador de cada ransemnio.",
    "output": "La sálida estará formada por 1 linea indicando la distancia minima entre las 2 casas en donde Fili y Angie deben habitar. Se garantiza que la respuesta sera menor a 2^ 60. * * Nota: Los rapadopolus dados están numerados de 1 a N. * *",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 4008
  },
  {
    "title": "Polygons",
    "url": "https://omegaup.com/arena/problem/Polygons",
    "history": "Dada una lista L de n puntos ( x_ i, y_ i) , y un polígono de k lados, calcula: 1. El área del polígono2. El centroide de los vértices del polígono3. El número de puntos d de la lista L que están estrictamente dentro del polígono4. El número de puntos f de la lista L que están estrictamente fuera del polígono",
    "input": "En la primera linea el entero n indicando el número de puntos de la lista L. En cada una de las siguientes n lineas, dos enteros x_ i, y_ i indicando las coordenadas del i- ésimo punto. En la siguiente linea el entero k indicando el número de puntos del polígono. En cada una de las siguientes k lineas, dos enteros u_ i, v_ i indicando las coordenadas del i- ésimo punto del polígono. Los puntos del polígono estarán dados en forma consecutiva, es decir, los segmentos del polígono serán precisamente lossegmentos que van de ( u_ i, v_ i) a ( u_ i+ 1, v_ i+ 1) para 0 ≤ i ≤ k- 1, y el segmento que va de( u_ k- 1, v_ k- 1) a ( u_ 0, v_ 0) .",
    "output": "En la primera linea el area A del polígono. En la segunda linea el centro de masa C_ x C_ y del polígono. En la tercera linea, el número de puntos dentro y puntos fuera d f separados por un espacio.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2592
  },
  {
    "title": "Convex hull",
    "url": "https://omegaup.com/arena/problem/Convex-hull",
    "history": "Dada una lista de n puntos ( x_ i, y_ i) , encuentra su envolvente convexa.",
    "input": "En la primera linea el entero n indicando el número de puntos. En cada una de las siguientes n lineas, dos enteros x_ i, y_ i indicando las coordenadas del i- ésimo punto.",
    "output": "En la primera linea, el número k de puntos en la envolvente convexa. En las siguientes k lineas, los puntosP_ 0, P_ 1, . . . , P_ k- 1 que forman la envolvente convexa. Los puntos deben aparecer en forma consecutiva, es decir, los segmentos de la envolvente deben ser precisamente los segmentos que van de P_ i a P_ i+ 1 para 0 ≤ i ≤ k- 1, y el segmento P_ k- 1 a P_ 0.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2590
  },
  {
    "title": "Line intersection",
    "url": "https://omegaup.com/arena/problem/Line-intersection",
    "history": "Dado un conjunto de n pares de rectas, determina si las rectas se intersecan en 0, 1 o más de un punto. Si se intersecan en sólo un punto, encuentra la intersección.",
    "input": "En la primera linea el entero n indicando el número de pares de rectas. En cada una de las siguientes n lineas, 8 enteros separados por espacios. Los primeros 4 enteros P_ x, P_ y, Q_ x, Q_ yindican las posiciones de dos puntos distintos P, Q por los que pasa la primera recta. Los siguientes 4 enteros R_ x, R_ y, S_ x, S_ y indican las posiciones los puntos distintos R, S por los que pasa lasegunda recta.",
    "output": "En la i- ésima linea, imprime 0 si las rectas no se intersecan, - 1 si se intersecan en más de un punto, o x y ( la intersección del par de rectas) si se intersecan en un único punto.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2584
  },
  {
    "title": "Left Right",
    "url": "https://omegaup.com/arena/problem/Left-Right",
    "history": "Dada una lista de n puntos ( x_ i, y_ i) , y un vector ( u, v) cuenta el número de puntos a la izquierda yel número de puntos a la derecha de la linea orientada en la dirección ( u, v) . ! [ Fig. 1: ejemplo. Los puntos verdes se encuentran a la iquierda de la linea y los puntos rojos se encuentran a la derecha. ] [ 1]",
    "input": "En la primera linea los enteros n, u, v indicando el número de puntos y la dirección ( u, v) . En cada una de las siguientes n lineas, dos enteros x_ i, y_ i indicando las coordenadas del i- ésimo punto.",
    "output": "En la primera linea, el número de puntos a la izquierda y el número de puntos a la derecha, separados por un espacio.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2583
  },
  {
    "title": "Largest collinear",
    "url": "https://omegaup.com/arena/problem/Largest-colinear",
    "history": "Dada una lista de n puntos ( x_ i, y_ i) , encuentra el mayor subconjunto de puntos colineales.",
    "input": "En la primera linea el entero n indicando el número de puntos. En cada una de las siguientes n lineas, dos enteros x_ i, y_ i indicando las coordenadas del i- ésimo punto.",
    "output": "En la primera linea, el máximo número de puntos colineales.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2569
  },
  {
    "title": "Least angle",
    "url": "https://omegaup.com/arena/problem/Least-angle",
    "history": "Dada una lista de n vectores ( x_ i, y_ i, z_ i) , encuentra el par de ellos que forman el menor ángulo entre sí.",
    "input": "En la primera linea el entero n indicando el número de puntos. En cada una de las siguientes n lineas, tres enteros x_ i, y_ i, z_ i indicando las coordenadas del i- ésimo vector.",
    "output": "En la primera linea, los índices i, j de los vectores que forman el menor ángulo entre sí. Si hay másde un par de vectores con ángulo mínimo, regresa el par con menor índice i. Si aún hay más de una soluciónregresa el par con menor índice j.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2562
  },
  {
    "title": "Closest pair",
    "url": "https://omegaup.com/arena/problem/Closest-pair",
    "history": "Dada una lista de n puntos ( x_ i, y_ i) , encuentra la mínima distancia de entre todos los pares de puntos.",
    "input": "En la primera linea el entero n indicando el número de puntos. En cada una de las siguientes n lineas, dos enteros x_ i, y_ i indicando las coordenadas del i- ésimo punto.",
    "output": "En la primera linea, la distancia mas corta de entre todos los pares de puntos.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2558
  },
  {
    "title": "Ligas",
    "url": "https://omegaup.com/arena/problem/Ligas",
    "history": "Tu hermano pequeño y tú tienen un juego bastante curioso. Tu abuela les regaló una tabla con clavos dispuestos en una matriz cuadrangular y unas ligas. Tu hermano y tú se turnan colocando ligas de la siguiente manera: seleccionan dos clavos y estiran la liga para que los extremos de la liga se sostengan con ellos. El chiste del juego es que las ligas que coloquen nunca se intersecten ni toquen. El primer jugador que no pueda colocar su liga es el que pierde. ! [ Ligas] [ 1] Tú como buen programador decides hacer un programa para que tu hermanito se entretenga. Tu programa coloca una liga al azar y espera a que tu hermano coloque la suya. Ahora debes verificar si tu hermano colocó la liga en un lugar válido.",
    "input": "La primer línea del programa contiene un entero k ( 1 ≤ k ≤ 100) con el número de casos de prueba. Cada caso de prueba contiene la descripción de las dos ligas. Cada liga se puede representar con dos pares de coordenadas enteras x1, y1, x2, y2 ( 0 ≤ xi, yi ≤ 1000) que representan el punto de inicio y final de la liga.",
    "output": "Para caso de prueba debes escribir una línea de texto con el mensaje \" Caso k: No hay interseccion. \" si las ligas no se intersectan o \" Caso k: Hay interseccion. \" , si las ligas se intersectan. k es el número de caso de prueba ( están numerados secuencialmente, empezando por 1) . No escribas el acento de intersección. | | input21 4 5 2 3 4 7 81 4 5 2 1 2 7 8| | outputCaso 1: No hay interseccion. Caso 2: Hay interseccion. | | endLuis Héctor Chávez2007- 04- 291er Concurso Local de Programacion del Club de Progra[ 1] : 7976ccc46322059565d5bed9181cf6a2390cd2ad. png",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2176
  },
  {
    "title": "Reactor nuclear",
    "url": "https://omegaup.com/arena/problem/A-Reactor-nuclear",
    "history": "Un reactor nuclear ha explotado y se tendrá que reconstruir, afortunadamente la radiación fue detenida por una serie de celdas de plomo que cubren las paredes que tiene un ancho de 1 metro y una altura igual a la altura del cuarto, pero en el punto donde se unen las celdas están las bases. Tu tienes los planos del cuarto , que es un cuadrado, de tamaño N por N metros, y dentro de este cuarto hay diversas columnas hechas totalmente de plomo así que estas columnas evitaron que algunas bases se dañaran. El punto con la coordenada ( 0, 0) es la esquina inferior izquierda del cuarto, y la coordenada ( N, N) es la esquina superior derecha. Las bases que se dañaron son aquellas que fueron alcanzadas por la radiación de la explosión de forma directa, es decir, que si se traza una línea recta entre el punto de la base y el lugar de la explosión, y no existe ninguna columna que atraviese la línea, esa base se daño, cabe aclarar que si ese punto se alinea perfectamente con una esquina de una columna se considera que ese punto no fue dañado. Las columnas son siempre figuras convexas con área mayor que cero y sus esquinas siempre se ubican en posiciones enteras, las cuales nunca se sobreponen, ni se tocan. # ProblemaTu tarea consiste en hacer un programa que dada la descripción del cuarto y en donde ocurrió la explosión diga cuantas bases se necesita reparar.",
    "input": "La primera línea tiene 2 enteros N y C. Donde N es la longitud de cada lado del cuarto donde estaba el reactor nuclear y C es el número de columnasLa segunda línea contiene 2 enteros X y Y la coordenada de donde ocurrió la explosión. El resto de la entrada consiste en la descripción de cada una de las columnas. La descripción de una columna consiste en primero un número E ( 3 < = E < = 20) que indica el número de esquinas que tiene la columna, las siguientes E líneas contiene cada una dos enteros X y Y que son las coordenadas de esa esquina ( las esquinas se darán en el orden contrario a las manecillas del reloj)",
    "output": "Un solo entero el número de bases que se necesitan reparar. | | input100 160 50570 4075 4080 4080 5070 60| | output319| | descriptionEn este ejemplo en total existen 400 bases, y solo una columna, la columna no protegió a ninguna base de la pared Izquierda, Superior ni Inferior mientras que en la pared derecha se protegió desde la base en el punto ( 100, 10) hasta la base en el punto ( 100, 90) en total 81 bases. Eso nos da un total de 319 bases dañadas. | | end# Límites* 1< = N < = 500, 000* 0< = C < = 30, 000",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 2001
  },
  {
    "title": "Area máxima dado un perímetro",
    "url": "https://omegaup.com/arena/problem/Area-maxima-dado-un-perimetro",
    "history": "# Descripción del problemaTe dan una cuerda de 100 metros de longitud. ¿Cuáles son las dimensiones( alto y ancho) del rectángulo de mayor área que puedes rodear con dichacuerda?",
    "input": "No se requieren entradas. Es un problema de \" solo salida\" . Solamente vasa escribir tu respuesta como salida de la forma que se indica acontinuación. No necesitas escribir ningún código ni programar.",
    "output": "La respuesta del problema es tu salida, y es lo que vas a escribir en lapantalla que aparecerá. Para enviar tu respuesta sigue los siguientes pasos: 1. Da click en donde dice “ nuevo envío “2. Selecciona como lenguaje “solo salida“3. Escribe tu respuesta en la ventana indicando los dosnúmeros de tu respuesta ( el alto y el ancho) separados por un espacio.",
    "note": "",
    "topics": [
      "implementation",
      "geometry"
    ],
    "id": 1877
  },
  {
    "title": "Los remos faltantes de Urshanabí",
    "url": "https://omegaup.com/arena/problem/remos",
    "history": "El último obstáculo de Gilgamesh para visitar a Utanapíshtim era cruzarlas aguas de la muerte y el único que lo podía ayudar era el barquero Urshanabí. Éste le pidió a Gilgamesh que fuera al bosque a cortar R árboles parahacer los R remos que le faltaban. Como Gilgamesh estaba cansado, queríacaminar lo menos posible para traer uno por uno los árboles necesarios. Escribeun programa que, dadas las coordenadas de N árboles, calcule la mínimadistancia D que debe caminar Gilgamesh desde el origen. Gilgamesh sólo puede cargar un árbol a la vez.",
    "input": "Dos enteros N y R, seguidos de N parejas de enteros X_ i, Y_ i que son lascoordenadas ( X_ i, Y_ i) del árbol i.",
    "output": "El valor de D ( redondeado al entero más cercano) .",
    "note": "",
    "topics": [
      "sortings",
      "geometry"
    ],
    "id": 1746
  },
  {
    "title": "Puntos dentro de un triángulo",
    "url": "https://omegaup.com/arena/problem/pdt",
    "history": "Considera un triángulo T dado por sus tres vértices ( a, b) , ( c, d) y ( e, f) con coordenadas enteras. Algunos puntos de coordenadas enteras están sobre los lados de T y otros puntos de coordenadas enteras están dentro de T. Escribe un programa que encuentre las cantidades s y t de puntos sobre los lados y dentro de T, respectivamente. Por ejemplo, si los vértices de T tienen las coordenadas ( 0, 1) , ( 4, 3) y ( 2, 5) entonces s = 6 y t = 4 ya que los 6 puntos ( 0, 1) , ( 2, 2) , ( 4, 3) , ( 3, 4) , ( 2, 5) y ( 1, 3) están sobre los lados de T mientras que los 4 puntos ( 1, 2) , ( 2, 3) , ( 2, 4) y ( 3, 3) están dentro de T.",
    "input": "Seis números enteros a, b, c, d, e y f separados por espacios y todos ellos en el intervalo de - 1, 000 a 1, 000 ( incluyéndolos) . Puedes suponer que los tres vértices de T no están alineados y por lo tanto forman un triángulo.",
    "output": "Dos números enteros s y t separados por un espacio.",
    "note": "",
    "topics": [
      "geometry"
    ],
    "id": 1021
  },
  {
    "title": "Área máxima de un trapecio",
    "url": "https://omegaup.com/arena/problem/amt",
    "history": "Un carpintero tiene cuatro tablas de madera de longitudes a, b, c, d con las cuales desea construir los lados de una caja con forma detrapecio ( es decir, un cuadrilátero que tiene dos lados paralelos) . Aunque sabe cómo construir dicha caja, no sabe cuál será el área delfondo resultante. Escribe un programa que determine el área que tendrá el fondo de la caja considerando que ha sido construida con unárea máxima. Puedes suponer que con las longitudes dadas se puede construir al menos un trapecio.",
    "input": "Cuatro números enteros a, b, c, d con 1 ≤ a, b, c, d ≤ 1000.",
    "output": "El área máxima m que puede tener la caja. Si dicha área tiene una parte decimal, ésta debe ser truncada.",
    "note": "",
    "topics": [
      "geometry",
      "math",
      "brute force",
      "implementation"
    ],
    "id": 999
  },
  {
    "title": "Taxis",
    "url": "https://omegaup.com/arena/problem/taxi",
    "history": "Te encuentras en el extremo de una calle de exactamente M metros de largo. A lo largo de la calle, hay N lugares donde puedes pedir un taxi. Los lugares donde se pueden pedir taxis están numerados de 1 a N, siendo 1 el más cercano a ti y N el mas lejano a ti. La forma cobrar de los taxis es un poco inusual, ya que el solo hecho de pedir un taxi en el lugar i, tiene un costo de c( i) . Además del costo por pedir el taxi, el taxista cobrará una cantidad de d^ 2 por hacer un viaje que recorra una distancia de d metros. Como estas lesionado no eres capaz de caminar ni siquiera un metro. # ProblemaEscribe un programa que dados los costos * c* , las posiciones para tomar cada taxi y el número * M* , determine el costo mínimo para viajar desde la posición inicial( 0) a la posición * M* .",
    "input": "Línea 1: Dos números N y MSiguientes N líneas: Cada línea representa un lugar para tomar taxis y contendrá dos números representando el lugar donde se toma el taxi( en metros) y el costo inicial por pedirlo. * * Ejemplo: * * 2 500 225 1",
    "output": "Un solo número: el costo mínimo para llegar a la posición M* * Ejemplo: * * 1253# Límites1 ≤ N ≤ 100, 000Siempre podrás pedir un taxi en la posición 0El costo de cualquier estrategia que evite retroceder siempre cabe en un entero de 64 bits",
    "note": "",
    "topics": [
      "dp",
      "geometry"
    ],
    "id": 1741
  },
  {
    "title": "Karel y la cima",
    "url": "https://omegaup.com/arena/problem/Karel-y-la-cima",
    "history": "< br/ > Hoy Karel amaneció muy motivado, por lo que estaba muy decidido de dar lo mejor de sí. Por lo que se decidió a escalar la escalera más alta como un entrenamiento, ya que miro a su héroe Rocky Balboa hacerlo también. Para su mala suerte Karel no encontró ninguna escalera, pero ese detalle no fue suficiente para desanimarlo, decidió que si no hay una escalera que subir el crearía su propia escalera y se pararía en la cima victorioso. < / br> Ayuda a Karel a construir la escalera más alta que pueda con la cantidad de zumbadores dadas en la posición ( 1, 1) . Al terminar deja a Karel en la cima de la escalera, victorioso, mirando al cielo( Norte) . # Consideraciones* Una escalera está compuesta por bloques de 2 zumbadores, subiendo diagonalmente hacia la derecha. * No se puede hacer bloques de solamente un zumbador, en caso de ser una cantidad impar se ignora el ultimo. * La cima de la escalera se define como la posición arriba del ultimo escalón en su beeper de la derecha. * En el mundo no hay paredes de por medio, y no hay zumbadores en una posición que no sea ( 1, 1) . * Solo deben haber zumbadores en el mundo que sean parte de la escalera. * Se considera la posicion final y orientacion de Karel. * En el mundo solo deben quedar los zumbadores que forman la escalera. * En la escalera no debe haber ningun monton con mas de un zumbador. ( Nota: Mirar la imagen para tener la definición de escalera más clara) < br/ > # Ejemplo Entrada! [ Ejemplo mundo entrada] ( KarelInput. png) # Ejemplo Salida! [ Ejemplo mundo salida] ( KarelOutput. png) # Límites< br/ > < br/ > * El mundo es de tamaño 100x100* Karel inicia en la posición ( 1, 1) mirando al norte. * Para 70",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "constructive algorithms",
      "geometry"
    ],
    "id": 12245
  },
  {
    "title": "Karel y la sana distancia",
    "url": "https://omegaup.com/arena/problem/Karel-y-la-sana-distancia",
    "history": "< br/ > Karel recientemente esta muy preocupado por el asunto de la pandemia, sin embargo el tenia la esperanza de que al final todo saldara bien y que regresaremos a la normalidad, el quiere agregar su granito de arena para que todo se desarrolle de la mejor manera posible. Karel decidio supervisar que todas las personas respeten la sana distancia, por lo que por cada persona par de personas ( representadas por montones de un zumbador) tiene que haber al menos una casilla vacia entre ellas dos, todas las personas se encuentran en un salon que tiene forma de pasillo de 1xN. En caso de que todas las personas respeten la sana distancia Karel se apagara viendo al norte, de caso contrario se apagara viendo al sur. # Consideraciones* Karel empieza dentro del pasillo sin embargo no sabes su posición. * No se sabe la orientación incial de Karel. * El largo del pasillo es a lo mas 50 y siempre tiene de altura 1. * Cada monton de zumbadores en el mundo cuenta a lo mas con un zumbador. * Karel inicia sin zumbadores. * En el mundo no hay paredes diferentes a las que definen el pasilllo. * Solo importa la orientacion final de Karel. < br/ > < br/ > A continuacion se muestra solamente el estado final de los siguientes mundos: # Ejemplo Entrada! [ Ejemplo mundo entrada] ( KarelInput. png) # Ejemplo Salida! [ Ejemplo mundo salida] ( KarelOutput. png) # Ejemplo Entrada! [ Ejemplo mundo entrada] ( KarelInput2. png) # Ejemplo Salida! [ Ejemplo mundo salida] ( KarelOutput2. png) # Nota< br/ > < br/ > * Los casos estan agrupados con parejas de tal forma que una respuesta mirando al norte siempre esta emparejada con una mirando al sur, se dan puntos si se contestan los dos casos de manera correcta en cada grupo.",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry",
      "constructive algorithms"
    ],
    "id": 12244
  },
  {
    "title": "Karel y la ruta de camion",
    "url": "https://omegaup.com/arena/problem/Karel-y-la-ruta-de-camion",
    "history": "< br/ > Karel se estaba preparando su viaje a Culiacan desde Los Mochis, sin embargo dentro del camion olvido que tipo de camion agarro, un Express un Directo o uno Normal. Sin embargo el podia saber que tipo de camion era contando las paradas que hacia, hacer solo una parada significaria que solo se paro en Culican, haciendolo un camion express, en caso de ser 3 paradas estas serian en Guamuchil, Guasave y Culiacan, haciendolo un camion directo, un camion normal el conto que hacia en total 7 paradas. Karel no podia evitar dormirse durante el viaje, asi que cuando el estaba despierto anotaba cuantas paradas hizo, lo cual lo anotaba mediante un monton de zumbadores en un pasillo de 1xN, un zumbador significa que agrego una parada mas, dos zumbadores que agrego dos paradas mas, etc. Habian varios montones de zumbadores durante todo el camino, por lo que despues de agarrar todos decidio mencionar que tipo de camion era expresando con la direccion en la que miraba, pero era posible que la cantidad no se refiriera a ningun tipo de camion por lo que Karel habia recordado mal las paradas, en ese caso debia apagarse mirando el sur. Para los demas tipos de camiones las direccions son: * Express = Este* Directo = Norte* Normal = Oeste# Consideraciones* Karel empieza en la posición ( 1, 1) mirando al norte. * El mapa es un pasillo cubierto de paredes de tamaño 1xN, con N < = 100. * En el mundo hay montones de zumbadores. * Karel inicia sin zumbadores. * Karel tiene que terminar en la casilla ( 1, N) . * Al terminar no deben quedar mas zumbadores en el mundo. < br/ > < br/ > A continuacion se muestra solamente el estado final de los siguientes mundos: # Ejemplo Entrada! [ Ejemplo mundo entrada] ( KarelInput. png) # Ejemplo Salida! [ Ejemplo mundo salida] ( KarelOutput. png) # Ejemplo Entrada! [ Ejemplo mundo entrada] ( KarelInput2. png) # Ejemplo Salida! [ Ejemplo mundo salida] ( KarelOutput2. png) # Límites< br/ > < br/ > * Los casos estan agrupados con parejas de tal forma que una respuesta mirando a una direccion siempre esta emparejada con una mirando a otra direccion, se dan puntos si se contestan los dos casos de manera correcta en cada grupo.",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "geometry",
      "constructive algorithms"
    ],
    "id": 12243
  },
  {
    "title": "Karel y los casi-cuadrados",
    "url": "https://omegaup.com/arena/problem/Karel-y-los-casi-cuadrados",
    "history": "< br/ > Karel recientemente compro un terreno para sembrar, el estaba muy emocionado por poder lograr su sueño de cultivar tomates, sin embargo Karel no puede evitar ocultar su amor por la geometria, de todas las figuras geometricas el esperaba que el terreno que recien compro sea un cuadrado. Sin embargo Karel sabe que la probabilidad de que sea un cuadrado es bastante baja, y el no quiere parecer alguien demasiado estricto con sus terrenos, por lo que decidio conformarse si el terreno es casi un cuadrado, Karel define un terreno como casi un cuadrado si la diferencia entre la base y la altura es a lo mas 2, ya sea que el lado menor sea la base o la altura del terreno. El terreno es un cuadrilatero con su esquina inferior izquierda en la casilla ( 1, 1) , se conforma de 4 lados que lo cierran completamente y no tiene ninguna pared dentro del area que limita al igual que tampoco zumbadores. En caso de que el terreno sea un casi cuadrado Karel decidio expresar su felicidad apagandose mirando al norte, en caso de no ser un casi cuadrado trata de ocultar su tristeza apagandose mirando al sur. # Consideraciones* Karel empieza en la posición ( 1, 1) mirando al norte. * Cada lado del terreno es menor que 100. * Cada lado del terreno mide al menos 3. * Karel inicia sin zumbadores. * En el mundo no hay paredes diferentes a las que definen el terreno y no hay zumbadores en el mundo. * Solo importa la orientacion final de Karel. < br/ > < br/ > A continuacion se muestra solamente el estado final de los siguientes mundos: # Ejemplo Entrada! [ Ejemplo mundo entrada] ( KarelInput. png) # Ejemplo Salida! [ Ejemplo mundo salida] ( KarelOutput. png) # Límites< br/ > < br/ > * El mundo es de tamaño 100x100* Karel inicia en la posición ( 1, 1) mirando al norte. * Los casos estan agrupados con parejas de tal forma que una respuesta mirando al norte siempre esta emparejada con una mirando al sur, se dan puntos si se contestan los dos casos de manera correcta en cada grupo.",
    "input": "",
    "output": "",
    "note": "",
    "topics": [
      "constructive algorithms",
      "geometry"
    ],
    "id": 12242
  }
]