{
    "url": "https://omegaup.com/arena/problem/Anos-extraterrestres-ANH",
    "name": "Años extraterrestres",
    "id": 13844,
    "site": "omegaup",
    "tags": [
        "conditionals",
        "formatted input and output"
    ],
    "history": "Una noche mientras regresabas de comerte unos ricos tacos, una luz se posa sobre ti y pierdes el conocimiento. Cuando por fin abres los ojos, te das cuenta que has sido abducido por un grupo de extraterrestres que buscan hacer contacto con los habitantes de la tierra, pero no están seguros si los humanos son lo suficientemente inteligentes para incluirlos en la Unión de Planetas para la Cuarta Transformación (UPCT), así que tu serás uno de los humanos a los cuales evaluarán para probar la inteligencia terrestre.El grupo de extraterrestres (provenientes de Venus, Marte y Saturno) quieren que muestres tus conocimientos de programación, ya que en todas las civilizaciones de la galaxia la programación es la habilidad más valiosa que hay y el estándar de la inteligencia en la galaxia.Te han puesto como tarea crear un programa, en el lenguaje que elijas, que calcule la cantidad de años terrestres equivalentes a los años que ellos indiquen de alguno de sus planetas de origen. De lograrlo, la Tierra será considerada para ingresar en la UPCT, de lo contrario los humanos quedarían relegados y muy probablemente exterminarían al planeta ya que no sería de utilidad a la Galaxia.",
    "input": "Dos datos, un número positivo que representa la cantidad de años seguido por el nombre del planeta de alguno de los extraterrestres. Puede asumir que no se ingresarán otros nombres de planetas.",
    "output": "La cantidad de años terrestres a los que equivale esa cantidad de años del planeta dado redondeado a 2 decimales seguido por las palabras \"años terrestres\" de acuerdo a la siguiente tabla de equivalencia:1.882 años terrestres    =   un año en Marte29.476 años terrestres    =   un año en Saturno0.616 años terrestres    =   un año en Venus"
}