{
    "url": "https://omegaup.com/arena/problem/El-Zorro",
    "name": "El Zorro",
    "id": 14193,
    "site": "omegaup",
    "tags": [
        "formatted input and output"
    ],
    "history": "A lo largo de 82 capítulos, en tres temporadas transmitidas originalmente entre 1957 y 1961, Guy Williams enamoró a millones de televidentes del mundo entero como el playboy don Diego de la Vega quien, oculto tras un antifaz y una capa, impartía justicia en la California española de principios del siglo XIX como el Zorro.Don Diego, el único hijo de don Alejandro de la Vega, regresa a su Los Ángeles natal convertido en un hábil espadachín y en un jinete sin igual tras sus años de estudio en Madrid. Al descubrir las injusticias y abusos en la colonia española en México, decide esconder sus dotes de luchador y, oculto tras un traje, capa, sombrero y antifaz negros se enfrenta a bandidos, militares y funcionarios corruptos que abusaban de los buenos y honestos habitantes de California.Un sirviente mudo, Bernardo, lo ayuda fielmente en su batalla contra la potencia colonial y para frenar a ladrones y malhechores que azotaban las tierras californianas. Su caballo negro Tornado obedecía a sus silbidos, lo salvaba cuando estaba en dificultades y se enfrentaba a la adversidad por su dueño que, a los ojos de la sociedad, sólo se dedicaba a leer, bailar, cantar y enamorar a las chicas de la zona.Los capitanes Monasterio, Briones, Arrellano y Mendoza trataban de imponer su ley y usaban como peones al bonachón sargento Demetrio López García y al inocente cabo Reyes. Mientras tanto, el capitán Arturo Toledano era honesto y un rival de altura para el Zorro.El gobernador se dejaba llevar por la corriente, mientras el clero hacía lo que podía para salvar a campesinos e indígenas de los abusos de poder.El Zorro dejaba su firma, una Z, tras cada acción y como marca para corruptos, ladrones y abusadores. Tu trabajo consiste en ayudar al nuevo zorro digital dejando su marca en la pantalla de la computadora. El tamaño N (un número entero) y los símbolos con que tienes que realizar la Z serán ingresados por pantalla.",
    "input": "Ingresaran por pantalla un número N y un símbolo x."
}