{
    "contestId": 1632,
    "index": "A",
    "name": "ABC",
    "type": "PROGRAMMING",
    "points": 500.0,
    "rating": 800,
    "tags": [
        "implementation"
    ],
    "input": "Each test contains multiple test cases. The first line contains the number of test cases t𝑡 (1≤t≤1001≤𝑡≤100). Description of the test cases follows.The first line of each test case contains a single integer n𝑛 (1≤n≤1001≤𝑛≤100) — the length of the string s𝑠.The second line of each test case contains the string s𝑠 of length n𝑛 consisting only of the characters 0 and 1.",
    "output": "For each test case, print YES (case-insensitive) if it is possible to reorder the characters of s𝑠 so that there are no substrings that are a palindrome of length greater than 1, or NO (case-insensitive) otherwise.",
    "history": "Recently, the students of School 179 have developed a unique algorithm, which takes in a binary string s𝑠 as input. However, they soon found out that if some substring t𝑡 of s𝑠 is a palindrome of length greater than 1, the algorithm will work incorrectly. Can the students somehow reorder the characters of s𝑠 so that the algorithm will work correctly on the string?A binary string is a string where each character is either 0 or 1.A string a𝑎 is a substring of a string b𝑏 if a𝑎 can be obtained from b𝑏 by deletion of several (possibly, zero or all) characters from the beginning and several (possibly, zero or all) characters from the end.A palindrome is a string that reads the same backwards as forwards.NoteIn the first three test cases, the given strings do not contain palindromes of length greater than 1, so the answers are YES.In the last test case, it is impossible to reorder the characters so that the string does not contain palindromes of length greater than 1, so the answer is NO."
}