{
    "contestId": 1644,
    "index": "D",
    "name": "Cross Coloring",
    "type": "PROGRAMMING",
    "rating": 1700,
    "tags": [
        "data structures",
        "implementation",
        "math"
    ],
    "input": "The first line contains a single integer t𝑡 (1≤t≤1041≤𝑡≤104) — the number of testcases.The first line of the testcase contains four integers n,m,k𝑛,𝑚,𝑘 and q𝑞 (1≤n,m,k,q≤2⋅1051≤𝑛,𝑚,𝑘,𝑞≤2⋅105) — the size of the sheet, the number of non-white colors and the number of operations.The i𝑖-th of the following q𝑞 lines contains a description of the i𝑖-th operation — two integers xi𝑥𝑖 and yi𝑦𝑖 (1≤xi≤n1≤𝑥𝑖≤𝑛; 1≤yi≤m1≤𝑦𝑖≤𝑚) — the row and the column the operation is applied to.The sum of q𝑞 over all testcases doesn't exceed 2⋅1052⋅105.",
    "output": "For each testcase, print a single integer — the number of different colorings modulo 998244353998244353.",
    "history": "There is a sheet of paper that can be represented with a grid of size n×m𝑛×𝑚: n𝑛 rows and m𝑚 columns of cells. All cells are colored in white initially.q𝑞 operations have been applied to the sheet. The i𝑖-th of them can be described as follows:   xi𝑥𝑖 yi𝑦𝑖 — choose one of k𝑘 non-white colors and color the entire row xi𝑥𝑖 and the entire column yi𝑦𝑖 in it. The new color is applied to each cell, regardless of whether the cell was colored before the operation. The sheet after applying all q𝑞 operations is called a coloring. Two colorings are different if there exists at least one cell that is colored in different colors.How many different colorings are there? Print the number modulo 998244353998244353."
}