{
    "contestId": 1650,
    "index": "C",
    "name": "Weight of the System of Nested Segments",
    "type": "PROGRAMMING",
    "rating": 1200,
    "tags": [
        "greedy",
        "hashing",
        "implementation",
        "sortings"
    ],
    "id": "1650C",
    "site": "codeforces",
    "url": "https://codeforces.com/problemset/problem/1650/C",
    "input": "The first line of input data contains an integer 𝑡t (1≤𝑡≤1041≤t≤104) —the number of input test cases.An empty line is written before each test case.The first line of each test case contains two positive integers 𝑛n (1≤𝑛≤1051≤n≤105) and 𝑚m (2⋅𝑛≤𝑚≤2⋅1052⋅n≤m≤2⋅105). The next 𝑚m lines contain pairs of integers 𝑥𝑖xi (−109≤𝑥𝑖≤109−109≤xi≤109) and 𝑤𝑖wi (−104≤𝑤𝑖≤104−104≤wi≤104) — coordinate and weight of point number 𝑖i (1≤𝑖≤𝑚1≤i≤m) respectively. All 𝑥𝑖xi are different.It is guaranteed that the sum of 𝑚m values over all test cases does not exceed 2⋅1052⋅105.",
    "output": "For each test case, output 𝑛+1n+1 lines: in the first of them, output the weight of the composed system, and in the next 𝑛n lines output exactly two numbers  — the indices of the points which are the endpoints of the 𝑖i-th segment (1≤𝑖≤𝑛1≤i≤n). The order in which you output the endpoints of a segment is not important — you can output the index of the left endpoint first and then the number of the right endpoint, or the other way around.If there are several ways to make a system of nested segments with minimal weight, output any of them.",
    "note": "The first test case coincides with the example from the condition. It can be shown that the weight of the composed system is minimal.The second test case has only 66 points, so you need to use each of them to compose 33 segments.",
    "history": "On the number line there are 𝑚m points, 𝑖i-th of which has integer coordinate 𝑥𝑖xi and integer weight 𝑤𝑖wi. The coordinates of all points are different, and the points are numbered from 11 to 𝑚m.A sequence of 𝑛n segments [𝑙1,𝑟1],[𝑙2,𝑟2],…,[𝑙𝑛,𝑟𝑛][l1,r1],[l2,r2],…,[ln,rn] is called system of nested segments if for each pair 𝑖,𝑗i,j (1≤𝑖<𝑗≤𝑛1≤i<j≤n) the condition 𝑙𝑖<𝑙𝑗<𝑟𝑗<𝑟𝑖li<lj<rj<ri is satisfied. In other words, the second segment is strictly inside the first one, the third segment is strictly inside the second one, and so on.For a given number 𝑛n, find a system of nested segments such that:  both ends of each segment are one of 𝑚m given points;  the sum of the weights 2⋅𝑛2⋅n of the points used as ends of the segments is minimal. For example, let 𝑚=8m=8. The given points are marked in the picture, their weights are marked in red, their coordinates are marked in blue. Make a system of three nested segments:  weight of the first segment: 1+1=21+1=2  weight of the second segment: 10+(−1)=910+(−1)=9  weight of the third segment: 3+(−2)=13+(−2)=1  sum of the weights of all the segments in the system: 2+9+1=122+9+1=12   System of three nested segments "
}